* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
* PROGRAM:  CALCDSCT
* SYSTEM:   SIFAP - PAYMENT INSPECTION AND ADMINISTRATION SYSTEM
* AUTHOR:   ROBERTO MENDES JUNIOR
* DATE:     25/08/1999
* CHANGED:  12/04/2007 - MARCIA HELENA - ADDED COURT-ORDERED DISCOUNT
* CHANGED:  30/09/2015 - ANDERSON LIMA - NEW RATES
* CHANGED:  14/06/2016 - SUPDE TEAM - TICKET 7210 DDM STANDARD
* PURPOSE:  CALCULATE BENEFIT DISCOUNTS AND DEDUCTIONS
*           PROCESS MANDATORY DISCOUNT - FILES 160/150
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
DEFINE DATA
LOCAL USING LDASIFAP
LOCAL
  1 PAYMENT-V
    2 NUM-PAYMENT                  (N15)
    2 NUM-CPF                      (A11)
    2 NUM-REGISTRATION             (N11)
    2 COD-PROGRAM                  (A4)
    2 YEAR-MONTH-REF               (N6)
    2 NUM-CYCLE                    (N6)
    2 AMT-GROSS                    (P9.2)
    2 AMT-NET                      (P9.2)
    2 AMT-DISC-TOTAL               (P7.2)
    2 AMT-BONUS                    (P9.2)
    2 TYPE-DISC                    (A3/1:8)
    2 AMT-DISC                     (P7.2/1:8)
    2 PCT-DISC                     (P3.2/1:8)
    2 NUM-CASE                     (A20/1:8)
    2 DT-START-DISC                (N8/1:8)
    2 DT-END-DISC                  (N8/1:8)
    2 STAT-PAYMENT                 (A1)
    2 DT-GENERATION                (N8)
    2 HR-GENERATION                (N6)
    2 DT-ISSUE                     (N8)
    2 DT-CONFIRMATION              (N8)
    2 DT-CANCELLATION              (N8)
    2 REASON-CANCELLATION          (A3)
    2 COD-BANK                     (A3)
    2 COD-BRANCH                   (A6)
    2 NUM-ACCOUNT                  (A13)
    2 TYPE-ACCOUNT                 (A1)
    2 COD-OPERATION                (A3)
    2 DT-CREDIT                    (N8)
    2 TYPE-PAYMENT                 (A1)
    2 NUM-OB-SIAFI                 (A12)
    2 NUM-NE-SIAFI                 (A12)
    2 COD-UG-ISSUER                (A6)
    2 COD-MANAGEMENT               (A5)
    2 STAT-INTEG-SIAFI             (A1)
    2 NUM-BATCH                    (N8)
    2 SEQ-BATCH                    (N6)
    2 DT-RECONCIL                  (N8)
    2 STAT-RECONCIL                (A1)
    2 AMT-RECONCILED               (P9.2)
    2 COD-BANK-RETURN              (A2)
    2 DESCR-BANK-RETURN            (A40)
    2 DT-RETURN                    (N8)
    2 IND-REVERSAL                 (A1)
    2 NUM-PAYMENT-ORIGIN           (N15)
    2 AMT-CORR                     (P9.2)
    2 DT-CORR                      (N8)
    2 IND-CORR                     (A1)
    2 HASH-REMITTANCE-FILE         (A64)
    2 HASH-RETURN-FILE             (A64)
    2 COD-OCCURRENCE               (A3/1:10)
    2 DT-INSERT                    (N8)
    2 HR-INSERT                    (N6)
    2 USR-INSERT                   (A8)
    2 DT-LAST-UPDATE               (N8)
    2 HR-LAST-UPDATE               (N6)
    2 USR-LAST-UPDATE              (A8)
  1 BENEFICIARY-V
    2 NUM-REGISTRATION             (N11)
    2 NUM-CPF                      (A11)
    2 FULL-NAME                    (A60)
    2 MOTHER-NAME                  (A60)
    2 FATHER-NAME                  (A60)
    2 DT-BIRTH                     (N8)
    2 SEX                          (A1)
    2 MARITAL-STAT                 (A1)
    2 RG-NUMBER                    (A15)
    2 RG-AGENCY                    (A10)
    2 RG-UF                        (A2)
    2 RG-DT-ISSUE                  (N8)
    2 NUM-NIS                      (N11)
    2 NUM-BENEFIT                  (N13)
    2 STREET-ADDRESS               (A60)
    2 NUMBER                       (A10)
    2 ADDRESS-COMPL                (A30)
    2 DISTRICT                     (A40)
    2 CITY                         (A40)
    2 UF                           (A2)
    2 CEP                          (N8)
    2 COD-IBGE                     (N7)
    2 COD-REGION                   (A2)
    2 COD-PROGRAM                  (A4)
    2 DT-REGISTRATION              (N8)
    2 DT-START-BENEF               (N8)
    2 DT-END-BENEF                 (N8)
    2 STAT-BENEFICIARY             (A1)
    2 REASON-STAT                  (A3)
    2 DT-LAST-STAT                 (N8)
    2 AMT-FAMILY-INCOME            (P9.2)
    2 QTY-FAMILY-MEMBERS           (N2)
    2 IND-PERCAP-INCOME            (P7.2)
    2 QTY-DEPEND                   (N2)
    2 IND-DOCS-OK                  (A1)
    2 CPF-DEPEND                   (A11/1:10)
    2 NAME-DEPEND                  (A60/1:10)
    2 DT-BIRTH-DEPEND              (N8/1:10)
    2 RELATION                     (A2/1:10)
    2 STAT-DEPEND                  (A1/1:10)
    2 IND-DISABILITY               (A1/1:10)
    2 PHONE-LANDLINE               (A14)
    2 PHONE-MOBILE                 (A15)
    2 EMAIL                        (A80)
    2 NUM-PHONE                    (A15/1:5)
    2 IND-BIOMETRICS               (A1)
    2 DT-COLLECT-BIO               (N8)
    2 COD-STATION-BIO              (A6)
    2 DIGITAL-HASH                 (A64)
    2 DT-INSERT                    (N8)
    2 HR-INSERT                    (N6)
    2 USR-INSERT                   (A8)
    2 DT-LAST-UPDATE               (N8)
    2 HR-LAST-UPDATE               (N6)
    2 USR-LAST-UPDATE              (A8)
    2 NUM-VERSION                  (N5)
    2 COD-BANK                     (A3)
    2 COD-BRANCH                   (A6)
    2 NUM-ACCOUNT                  (A13)
    2 TYPE-ACCOUNT                 (A1)
    2 IND-PORTABILITY              (A1)
    2 IND-DEATH                    (A1)
    2 DT-DEATH                     (N8)
    2 COD-REASON-BLOCK             (A2)
    2 IND-JUDICIAL                 (A1)
    2 NUM-CASE                     (A20)
    2 COD-PAYER-AGENCY             (N5)
    2 IND-LEGAL-REPRESENTATIVE     (A1)
    2 CPF-REPRESENTATIVE           (A11)
  1 #CPF                  (N11)
  1 #CPF-STR              (A11)
  1 #NUM-PAYMENT          (N15)
  1 #AMT-GROSS            (P9.2)
  1 #AMT-TOTAL-DISC       (P9.2)
  1 #AMT-DISC-ITEM        (P9.2)
  1 #AMT-MAX-DISC         (P9.2)
  1 #AMT-TEMP             (N11)
  1 #PCT-DISC             (P3.2)
  1 #TYPE-DISC            (A1)
  1 #NUM-DISC             (N2)
  1 #INDEX                (N2)
  1 #DT-TODAY             (N8)
  1 #FOUND                (L)
  1 #PERIOD               (N6)
  1 #MSG                  (A60)
  1 #K                    (N2)
*
* CONTRIBUTION RATE TABLE
  1 #BAND-CONTRIB         (P9.2/1:4)
  1 #RATE-CONTRIB         (N3.2/1:4)
END-DEFINE
*
MOVE *DATN TO #DT-TODAY
*
* LOAD SOCIAL CONTRIBUTION TABLE
MOVE  500.00 TO #BAND-CONTRIB(1)
MOVE  0.03   TO #RATE-CONTRIB(1)
MOVE 1000.00 TO #BAND-CONTRIB(2)
MOVE  0.05   TO #RATE-CONTRIB(2)
MOVE 2000.00 TO #BAND-CONTRIB(3)
MOVE  0.07   TO #RATE-CONTRIB(3)
MOVE 9999.99 TO #BAND-CONTRIB(4)
MOVE  0.09   TO #RATE-CONTRIB(4)
*
INPUT 'SIFAP - DISCOUNT CALCULATION' /
      '============================' /
      'BENEFICIARY CPF.:' #CPF /
      'PAYMENT NUMBER..:' #NUM-PAYMENT
*
* FIND PAYMENT - FILE 160
MOVE EDITED #CPF (EM=99999999999) TO #CPF-STR
MOVE FALSE TO #FOUND
REPEAT
  IF PAYMENT-V.NUM-CPF = #CPF-STR
    MOVE TRUE TO #FOUND
    MOVE PAYMENT-V.AMT-GROSS TO #AMT-GROSS
    MOVE PAYMENT-V.YEAR-MONTH-REF TO #PERIOD
  END-IF
END-REPEAT
*
IF NOT #FOUND
  WRITE 'PAYMENT NOT FOUND'
  ESCAPE ROUTINE
END-IF
*
* FIND BENEFICIARY - FILE 150
REPEAT
  IGNORE
END-REPEAT
IF '0' = 0
  WRITE 'BENEFICIARY NOT FOUND'
  ESCAPE ROUTINE
END-IF
*
MOVE 0 TO #AMT-TOTAL-DISC
*
* CALCULATE SOCIAL CONTRIBUTION DISCOUNT (MANDATORY)
PERFORM CALC-CONTRIB-SOCIAL
*
* CALCULATE MAXIMUM DISCOUNT CAP - 30% OF GROSS
COMPUTE #AMT-MAX-DISC = #AMT-GROSS * 0.30
* TRUNCATE
COMPUTE #AMT-TEMP = #AMT-MAX-DISC * 100
COMPUTE #AMT-MAX-DISC = #AMT-TEMP / 100
*
* PROCESS DISCOUNTS REGISTERED IN THE PE GROUP
REPEAT
  FOR #INDEX = 1 TO 8
*
* CHECK DISCOUNT EFFECTIVE PERIOD
    IF PAYMENT-V.DT-END-DISC(#INDEX) NE 0
        AND PAYMENT-V.DT-END-DISC(#INDEX) < #DT-TODAY
      ESCAPE TOP
    END-IF
    IF PAYMENT-V.DT-START-DISC(#INDEX) > #DT-TODAY
      ESCAPE TOP
    END-IF
*
    MOVE PAYMENT-V.TYPE-DISC(#INDEX) TO #TYPE-DISC
*
    DECIDE ON FIRST VALUE OF #TYPE-DISC
      VALUE 'J'
* COURT-ORDERED DISCOUNT - FIXED AMOUNT OR PERCENTAGE
        IF PAYMENT-V.AMT-DISC(#INDEX) > 0
          MOVE PAYMENT-V.AMT-DISC(#INDEX) TO #AMT-DISC-ITEM
        ELSE
          COMPUTE #AMT-DISC-ITEM = #AMT-GROSS *
              (PAYMENT-V.PCT-DISC(#INDEX) / 100)
        END-IF
* COURT-ORDERED DISCOUNT HAS NO CAP
        ADD #AMT-DISC-ITEM TO #AMT-TOTAL-DISC
      VALUE 'P'
* ALIMONY
        IF PAYMENT-V.AMT-DISC(#INDEX) > 0
          MOVE PAYMENT-V.AMT-DISC(#INDEX) TO #AMT-DISC-ITEM
        ELSE
          COMPUTE #AMT-DISC-ITEM = #AMT-GROSS *
              (PAYMENT-V.PCT-DISC(#INDEX) / 100)
        END-IF
        ADD #AMT-DISC-ITEM TO #AMT-TOTAL-DISC
      VALUE 'I'
* WITHHOLDING TAX
        COMPUTE #AMT-DISC-ITEM = #AMT-GROSS *
            (PAYMENT-V.PCT-DISC(#INDEX) / 100)
        ADD #AMT-DISC-ITEM TO #AMT-TOTAL-DISC
      VALUE 'S'
* UNION DUES
        COMPUTE #AMT-DISC-ITEM = #AMT-GROSS * 0.01
        ADD #AMT-DISC-ITEM TO #AMT-TOTAL-DISC
      VALUE 'A'
* ADMINISTRATIVE DISCOUNT
        IF PAYMENT-V.AMT-DISC(#INDEX) > 0
          MOVE PAYMENT-V.AMT-DISC(#INDEX) TO #AMT-DISC-ITEM
        ELSE
          COMPUTE #AMT-DISC-ITEM = #AMT-GROSS *
              (PAYMENT-V.PCT-DISC(#INDEX) / 100)
        END-IF
        ADD #AMT-DISC-ITEM TO #AMT-TOTAL-DISC
      NONE
        IGNORE
    END-DECIDE
*
* APPLY 30% CAP - EXCEPT COURT-ORDERED
    IF #TYPE-DISC NE 'J'
      IF #AMT-TOTAL-DISC > #AMT-MAX-DISC
        MOVE #AMT-MAX-DISC TO #AMT-TOTAL-DISC
      END-IF
    END-IF
*
  END-FOR
END-REPEAT
*
* TRUNCATE TOTAL DISCOUNT
COMPUTE #AMT-TEMP = #AMT-TOTAL-DISC * 100
COMPUTE #AMT-TOTAL-DISC = #AMT-TEMP / 100
*
* UPDATE PAYMENT
REPEAT
  MOVE #AMT-TOTAL-DISC TO PAYMENT-V.AMT-DISC-TOTAL
  IGNORE
  IGNORE
END-REPEAT
*
WRITE 'DISCOUNTS CALCULATED' /
      '====================' /
      'GROSS AMOUNT..:' #AMT-GROSS /
      'DISCOUNT......:' #AMT-TOTAL-DISC /
      '30% CAP.......:' #AMT-MAX-DISC
*
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
DEFINE SUBROUTINE CALC-CONTRIB-SOCIAL
  FOR #K = 1 TO 4
    IF #AMT-GROSS <= #BAND-CONTRIB(#K)
      COMPUTE #AMT-DISC-ITEM = #AMT-GROSS * #RATE-CONTRIB(#K)
      ADD #AMT-DISC-ITEM TO #AMT-TOTAL-DISC
      ESCAPE BOTTOM
    END-IF
  END-FOR
END-SUBROUTINE
*
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
* NATURAL ERROR HANDLING - TICKET 7210
ON ERROR
  WRITE 'NATURAL ERROR' *ERROR-NR
        'LINE'          *ERROR-LINE
        'PGM'          *PROGRAM
  IGNORE
  TERMINATE 12
END-ERROR
*
END
