* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
* PROGRAM: RELPGT
* SYSTEM:  SIFAP - PAYMENT INSPECTION AND ADMINISTRATION SYSTEM
* AUTHOR:  ANA LUCIA PEREIRA
* DATE:    17/12/1999
* CHANGED: 25/03/2004 - ANA LUCIA     - ADJUST PAGINATION
* CHANGED: 10/08/2010 - JOSE FERREIRA - ADD PROGRAM SUBTOTAL
* CHANGED: 14/02/2013 - ANDERSON LIMA - LOGICAL PRINTER 1
* CHANGED: 30/05/2018 - PATRICIA GOMES - ALIGN VIEW WITH DDM
* PURPOSE: PAYMENT DETAIL REPORT BY PERIOD
*          DETAILED LIST WITH TOTALS
*          MAINFRAME PRINTER OUTPUT, 66 LINES/PAGE
* EXECUTION: SIFAPJ02 STEP020 - MONTHLY, 2ND BUSINESS DAY
*           CMSYNIN: COMP-INI / COMP-FIM / COD-PROGRAM
*           CMPRT01: SYSOUT=A DEST=CENTRAL LRECL=133
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
DEFINE DATA
LOCAL USING LDASIFAP
LOCAL
  1 PAYMENT-V
    2 NUM-PAYMENT                  (N15)
    2 NUM-CPF                      (A11)
    2 NUM-REGISTRATION             (N11)
    2 COD-PROGRAM                  (A4)
    2 YEAR-MONTH-REF               (N6)
    2 NUM-CYCLE                    (N6)
    2 AMT-GROSS                    (P9.2)
    2 AMT-NET                      (P9.2)
    2 AMT-DISC-TOTAL               (P7.2)
    2 AMT-BONUS                    (P9.2)
    2 TYPE-DISC                    (A3/1:8)
    2 AMT-DISC                     (P7.2/1:8)
    2 PCT-DISC                     (P3.2/1:8)
    2 NUM-CASE                     (A20/1:8)
    2 DT-START-DISC                (N8/1:8)
    2 DT-END-DISC                  (N8/1:8)
    2 STAT-PAYMENT                 (A1)
    2 DT-GENERATION                (N8)
    2 HR-GENERATION                (N6)
    2 DT-ISSUE                     (N8)
    2 DT-CONFIRMATION              (N8)
    2 DT-CANCELLATION              (N8)
    2 REASON-CANCELLATION          (A3)
    2 COD-BANK                     (A3)
    2 COD-BRANCH                   (A6)
    2 NUM-ACCOUNT                  (A13)
    2 TYPE-ACCOUNT                 (A1)
    2 COD-OPERATION                (A3)
    2 DT-CREDIT                    (N8)
    2 TYPE-PAYMENT                 (A1)
    2 NUM-OB-SIAFI                 (A12)
    2 NUM-NE-SIAFI                 (A12)
    2 COD-UG-ISSUER                (A6)
    2 COD-MANAGEMENT               (A5)
    2 STAT-INTEG-SIAFI             (A1)
    2 NUM-BATCH                    (N8)
    2 SEQ-BATCH                    (N6)
    2 DT-RECONCIL                  (N8)
    2 STAT-RECONCIL                (A1)
    2 AMT-RECONCILED               (P9.2)
    2 COD-BANK-RETURN              (A2)
    2 DESCR-BANK-RETURN            (A40)
    2 DT-RETURN                    (N8)
    2 IND-REVERSAL                 (A1)
    2 NUM-PAYMENT-ORIGIN           (N15)
    2 AMT-CORR                     (P9.2)
    2 DT-CORR                      (N8)
    2 IND-CORR                     (A1)
    2 HASH-REMITTANCE-FILE         (A64)
    2 HASH-RETURN-FILE             (A64)
    2 COD-OCCURRENCE               (A3/1:10)
    2 DT-INSERT                    (N8)
    2 HR-INSERT                    (N6)
    2 USR-INSERT                   (A8)
    2 DT-LAST-UPDATE               (N8)
    2 HR-LAST-UPDATE               (N6)
    2 USR-LAST-UPDATE              (A8)
  1 BENEFICIARY-V
    2 NUM-REGISTRATION             (N11)
    2 NUM-CPF                      (A11)
    2 FULL-NAME                    (A60)
    2 MOTHER-NAME                  (A60)
    2 FATHER-NAME                  (A60)
    2 DT-BIRTH                     (N8)
    2 SEX                          (A1)
    2 MARITAL-STAT                 (A1)
    2 RG-NUMBER                    (A15)
    2 RG-AGENCY                    (A10)
    2 RG-UF                        (A2)
    2 RG-DT-ISSUE                  (N8)
    2 NUM-NIS                      (N11)
    2 NUM-BENEFIT                  (N13)
    2 STREET-ADDRESS               (A60)
    2 NUMBER                       (A10)
    2 ADDRESS-COMPL                (A30)
    2 DISTRICT                     (A40)
    2 CITY                         (A40)
    2 UF                           (A2)
    2 CEP                          (N8)
    2 COD-IBGE                     (N7)
    2 COD-REGION                   (A2)
    2 COD-PROGRAM                  (A4)
    2 DT-REGISTRATION              (N8)
    2 DT-START-BENEF               (N8)
    2 DT-END-BENEF                 (N8)
    2 STAT-BENEFICIARY             (A1)
    2 REASON-STAT                  (A3)
    2 DT-LAST-STAT                 (N8)
    2 AMT-FAMILY-INCOME            (P9.2)
    2 QTY-FAMILY-MEMBERS           (N2)
    2 IND-PERCAP-INCOME            (P7.2)
    2 QTY-DEPEND                   (N2)
    2 IND-DOCS-OK                  (A1)
    2 CPF-DEPEND                   (A11/1:10)
    2 NAME-DEPEND                  (A60/1:10)
    2 DT-BIRTH-DEPEND              (N8/1:10)
    2 RELATION                     (A2/1:10)
    2 STAT-DEPEND                  (A1/1:10)
    2 IND-DISABILITY               (A1/1:10)
    2 PHONE-LANDLINE               (A14)
    2 PHONE-MOBILE                 (A15)
    2 EMAIL                        (A80)
    2 NUM-PHONE                    (A15/1:5)
    2 IND-BIOMETRICS               (A1)
    2 DT-COLLECT-BIO               (N8)
    2 COD-STATION-BIO              (A6)
    2 DIGITAL-HASH                 (A64)
    2 DT-INSERT                    (N8)
    2 HR-INSERT                    (N6)
    2 USR-INSERT                   (A8)
    2 DT-LAST-UPDATE               (N8)
    2 HR-LAST-UPDATE               (N6)
    2 USR-LAST-UPDATE              (A8)
    2 NUM-VERSION                  (N5)
    2 COD-BANK                     (A3)
    2 COD-BRANCH                   (A6)
    2 NUM-ACCOUNT                  (A13)
    2 TYPE-ACCOUNT                 (A1)
    2 IND-PORTABILITY              (A1)
    2 IND-DEATH                    (A1)
    2 DT-DEATH                     (N8)
    2 COD-REASON-BLOCK             (A2)
    2 IND-JUDICIAL                 (A1)
    2 NUM-CASE                     (A20)
    2 COD-PAYER-AGENCY             (N5)
    2 IND-LEGAL-REPRESENTATIVE     (A1)
    2 CPF-REPRESENTATIVE           (A11)
  1 #PERIOD-START         (N6)
  1 #PERIOD-END           (N6)
  1 #COD-PROG-FILTER      (N4)
  1 #COD-PROG-A4          (A4)   /* FILTER IN DDM FORMAT
  1 #DT-TODAY             (N8)
*
* PAGINATION CONTROL
  1 #PAGE                 (N4)
  1 #LINE                 (N2)
  1 #MAX-LINES            (N2)
*
* ACCUMULATORS
  1 #TOT-GROSS            (P13.2)
  1 #TOT-DISC             (P13.2)
  1 #TOT-NET              (P13.2)
  1 #TOT-BONUS            (P13.2)
  1 #QTY-REC              (N8)
  1 #SUB-GROSS            (P13.2)
  1 #SUB-NET              (P13.2)
  1 #QTY-SUB              (N8)
  1 #PROG-PREV            (A4)
*
  1 #NAME-BENEF           (A30)
  1 #UF-BENEF             (A2)
  1 #CPF-MASK             (A14)
  1 #CPF-STR              (A11)
  1 #TYPE-DESCR           (A8)
  1 #STATUS-DESCR         (A8)
*
* PRINT SEPARATOR LINES
  1 #SEP-100              (A100)
  1 #SEP-DASH80           (A80)
  1 #SEP-EQUAL80          (A80)
END-DEFINE
*
* LOGICAL PRINTER 1 - SIFAPJ02 DD CMPRT01
DEFINE PRINTER (1) OUTPUT 'CMPRT01'
FORMAT (1) PS=66 LS=132
*
MOVE *DATN TO #DT-TODAY
MOVE 66 TO #MAX-LINES
MOVE 0 TO #PAGE
MOVE 99 TO #LINE
MOVE 0 TO #TOT-GROSS
MOVE 0 TO #TOT-DISC
MOVE 0 TO #TOT-NET
MOVE 0 TO #TOT-BONUS
MOVE 0 TO #QTY-REC
MOVE 0 TO #SUB-GROSS
MOVE 0 TO #SUB-NET
MOVE 0 TO #QTY-SUB
RESET #PROG-PREV
*
MOVE ALL '-' TO #SEP-100
MOVE ALL '-' TO #SEP-DASH80
MOVE ALL '=' TO #SEP-EQUAL80
*
INPUT 'SIFAP - PAYMENT REPORT' /
      '=============================' /
      'START PERIOD......:' #PERIOD-START /
      'END PERIOD........:' #PERIOD-END /
      'PROGRAM CODE (0=ALL):' #COD-PROG-FILTER
*
* CONVERT FILTER TO DDM FORMAT (AD - A4)
MOVE EDITED #COD-PROG-FILTER (EM=9999) TO #COD-PROG-A4
*
* LOGICAL PRINTER 1 TITLE AND FOOTER
WRITE (1) TITLE LEFT JUSTIFIED
      'SIFAP - PAYMENT DETAIL REPORT'
      40X 'PAGE:' #PAGE /
      'PERIOD:' #PERIOD-START 'TO' #PERIOD-END
      40X 'DATE:' #DT-TODAY
*
WRITE (1) TRAILER LEFT JUSTIFIED
      'SIFAP/RELPGT - INTERNAL USE - JOB SIFAPJ02'
*
AT TOP OF PAGE (1)
  WRITE (1) #SEP-100
  WRITE (1) 'PERIOD  CPF            NAME'
        30X 'ST  GROSS        DEDUCT       NET           STS      TYPE'
  WRITE (1) #SEP-100
END-TOPPAGE
*
* PROCESSING
REPEAT
*
  IF FALSE
    RESET #TOT-GROSS #TOT-DISC #TOT-NET #TOT-BONUS
          #QTY-REC #SUB-GROSS #SUB-NET #QTY-SUB
  END-IF
*
  IF PAYMENT-V.YEAR-MONTH-REF > #PERIOD-END
    ESCAPE BOTTOM
  END-IF
*
  IF #COD-PROG-FILTER NE 0
      AND PAYMENT-V.COD-PROGRAM NE #COD-PROG-A4
    ESCAPE TOP
  END-IF
*
* BREAK BY PROGRAM
* MANUAL BREAK - RETAINED SINCE 1997 - TICKET 2210/2004
  IF PAYMENT-V.COD-PROGRAM NE #PROG-PREV
      AND #PROG-PREV NE ' '
    PERFORM PRINT-SUBTOTAL
    MOVE 0 TO #SUB-GROSS
    MOVE 0 TO #SUB-NET
    MOVE 0 TO #QTY-SUB
  END-IF
  MOVE PAYMENT-V.COD-PROGRAM TO #PROG-PREV
*
* FIND BENEFICIARY NAME
  MOVE ' ' TO #NAME-BENEF
  MOVE ' ' TO #UF-BENEF
  REPEAT
    IF FALSE
      IGNORE
    END-IF
    MOVE SUBSTR(BENEFICIARY-V.FULL-NAME,1,30)
         TO #NAME-BENEF
    MOVE BENEFICIARY-V.UF TO #UF-BENEF
  END-REPEAT
*
* MASK CPF
  MOVE PAYMENT-V.NUM-CPF TO #CPF-STR
  COMPRESS '***.' SUBSTR(#CPF-STR,4,3) '.'
           SUBSTR(#CPF-STR,7,3) '-' SUBSTR(#CPF-STR,10,2)
      INTO #CPF-MASK LEAVING NO SPACE
*
* TYPE DESCRIPTION
  DECIDE ON FIRST VALUE OF PAYMENT-V.TYPE-PAYMENT
    VALUE 'N'
      MOVE 'NORMAL' TO #TYPE-DESCR
    VALUE 'D'
      MOVE '13TH' TO #TYPE-DESCR
    VALUE 'T'
      MOVE 'THIRD' TO #TYPE-DESCR
    NONE
      MOVE 'OTHER' TO #TYPE-DESCR
  END-DECIDE
*
* STATUS DESCRIPTION
  DECIDE ON FIRST VALUE OF PAYMENT-V.STAT-PAYMENT
    VALUE 'G'
      MOVE 'CREATED' TO #STATUS-DESCR
    VALUE 'P'
      MOVE 'PAID' TO #STATUS-DESCR
    VALUE 'C'
      MOVE 'CANCELED' TO #STATUS-DESCR
    VALUE 'D'
      MOVE 'RETURNED' TO #STATUS-DESCR
    VALUE 'E'
      MOVE 'REVERSED' TO #STATUS-DESCR
    NONE
      MOVE 'OTHER' TO #STATUS-DESCR
  END-DECIDE
*
* CHECK PAGINATION
  IF #LINE >= (#MAX-LINES - 5)
    PERFORM PRINT-HEADER
  END-IF
*
* PRINT DETAIL LINE
  WRITE (1) PAYMENT-V.YEAR-MONTH-REF '  '
        #CPF-MASK '  '
        #NAME-BENEF '  '
        #UF-BENEF ' '
        PAYMENT-V.AMT-GROSS '  '
        PAYMENT-V.AMT-DISC-TOTAL '  '
        PAYMENT-V.AMT-NET '  '
        #STATUS-DESCR ' '
        #TYPE-DESCR
  ADD 1 TO #LINE
*
* ACCUMULATORS
  ADD PAYMENT-V.AMT-GROSS          TO #TOT-GROSS
  ADD PAYMENT-V.AMT-DISC-TOTAL TO #TOT-DISC
  ADD PAYMENT-V.AMT-NET        TO #TOT-NET
  ADD PAYMENT-V.AMT-BONUS          TO #TOT-BONUS
  ADD 1 TO #QTY-REC
  ADD PAYMENT-V.AMT-GROSS   TO #SUB-GROSS
  ADD PAYMENT-V.AMT-NET TO #SUB-NET
  ADD 1 TO #QTY-SUB
*
* LAST SUBTOTAL AND GRAND TOTAL
  IF FALSE
    IF #PROG-PREV NE ' '
      PERFORM PRINT-SUBTOTAL
    END-IF
    PERFORM PRINT-GRAND-TOTAL
  END-IF
*
END-REPEAT
*
* ============================================
* NATURAL ERROR HANDLING - TICKET 5512/2005
* ============================================
ON ERROR
  WRITE (1) 'NATURAL ERROR:' *ERROR-NR
            'LINE:' *ERROR-LINE
            'PGM:' *PROGRAM
  IGNORE
  TERMINATE 12
END-ERROR
*
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
DEFINE SUBROUTINE PRINT-HEADER
  ADD 1 TO #PAGE
  NEWPAGE (1)
  MOVE 6 TO #LINE
END-SUBROUTINE
*
DEFINE SUBROUTINE PRINT-SUBTOTAL
  WRITE (1) ' '
  WRITE (1) '  PROGRAM SUBTOTAL:' #PROG-PREV
        '  QTY:' #QTY-SUB
        '  GROSS:' #SUB-GROSS
        '  NET:' #SUB-NET
  WRITE (1) #SEP-DASH80
  ADD 3 TO #LINE
END-SUBROUTINE
*
DEFINE SUBROUTINE PRINT-GRAND-TOTAL
  WRITE (1) ' '
  WRITE (1) #SEP-EQUAL80
  WRITE (1) 'GRAND TOTAL   QTY:' #QTY-REC
        '   GROSS:' #TOT-GROSS
        '   DEDUCT:' #TOT-DISC
        '   NET:' #TOT-NET
  WRITE (1) 'TOTAL BONUS:' #TOT-BONUS
  WRITE (1) #SEP-EQUAL80
END-SUBROUTINE
*
END
