* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
* PROGRAMA: BATCHREL
* SISTEMA:  SIFAP - SIST. FISC. ADM. PAGAMENTOS
* AUTOR:    PATRICIA GOMES DE SOUZA
* DATA:     10/11/1999
* ALTERADO: 20/04/2006 - ROBERTO MENDES - INC SUBTOTAIS REG
* ALTERADO: 09/10/2006 - ROBERTO MENDES - QUEBRA CONTROLE
* ALTERADO: 14/02/2013 - ANDERSON LIMA  - AJUSTE FORMATO
* ALTERADO: 05/06/2014 - EQUIPE SIFAP   - COPIA CMWKF01
* OBJETIVO: GERACAO RELATORIOS CONSOLIDADOS MENSAIS
*           SUMARIZACAO POR REGIAO/PROGRAMA/STATUS
*           SAIDA FLAT FILE P/ IMPRESSAO MAINFRAME
*
* JOB.....: SIFAPJ02 - STEP010 - PGM=NATBATCH
* ENTRADA.: CMSYNIN - COMPETENCIA AAAAMM
* SAIDA...: CMPRT01 - RELATORIO IMPRESSO    (LRECL 133)
*           CMWKF01 - COPIA P/ ARQUIVAMENTO (LRECL 132)
*           CMPRINT - LOG DE EXECUCAO
* RETORNO.: 0=OK  4=SEM MOVIMENTO  12=ERRO NATURAL
* NOTA....: RETENCAO 10 ANOS - LEI 8159 ART 14
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
DEFINE DATA
LOCAL USING LDASIFAP
LOCAL
  1 PAGAMENTO-V VIEW OF PAGAMENTO
    2 NUM-PAGAMENTO      (N15)
    2 NUM-CPF            (A11)
    2 COD-PROGRAMA       (A4)
    2 ANO-MES-REF        (N6)
    2 VLR-BRUTO          (P9,2)
    2 VLR-DESCONTO-TOTAL (P7,2)
    2 VLR-LIQUIDO        (P9,2)
    2 SIT-PAGAMENTO      (A1)
    2 TIPO-PAGAMENTO     (A1)
    2 VLR-ABONO          (P9,2)
*
  1 BENEFICIARIO-V VIEW OF BENEFICIARIO
    2 NUM-CPF            (A11)
    2 COD-REGIAO         (A2)
    2 UF                 (A2)
*
  1 #COMPETENCIA         (N6)
  1 #DT-HOJE             (N8)
*
* ACUMULADORES POR REGIAO (5 REGIOES)
  1 #TOT-REG-BRUTO       (P13,2/1:5)
  1 #TOT-REG-DESC        (P13,2/1:5)
  1 #TOT-REG-LIQ         (P13,2/1:5)
  1 #QTD-REG             (N8/1:5)
  1 #NOME-REG            (A15/1:5)
*
* ACUMULADORES POR STATUS
  1 #TOT-STS-BRUTO       (P13,2/1:5)
  1 #QTD-STS             (N8/1:5)
  1 #NOME-STS            (A15/1:5)
*
* TOTAIS GERAIS
  1 #TOT-GERAL-BRUTO     (P15,2)
  1 #TOT-GERAL-DESC      (P15,2)
  1 #TOT-GERAL-LIQ       (P15,2)
  1 #QTD-GERAL            (N8)
*
* VARIAVEIS AUXILIARES
  1 #IDX-REG             (N2)
  1 #COD-REG             (N2)
  1 #STATUS              (A1)
  1 #IDX-STS             (N2)
  1 #I                   (N2)
  1 #FOUND               (L)
  1 #LINHA-REL           (A132)
  1 #PAG                 (N4)
  1 #LINHA               (N2)
  1 #MAX-LINHAS          (N2)
*
* ARREDONDAMENTO RELATORIO
  1 #VLR-ARR             (P13,2)
  1 #VLR-TEMP            (N15)
END-DEFINE
*
* IMPRESSORA LOGICA DO SIFAPJ02 - DD CMPRT01
DEFINE PRINTER (1) OUTPUT 'CMPRT01'
FORMAT (1) PS=66 LS=132
*
MOVE *DATN TO #DT-HOJE
MOVE 66 TO #MAX-LINHAS  /* PADRAO IMPRESSORA MAINFRAME */
MOVE 0 TO #PAG
MOVE 99 TO #LINHA  /* FORCA CABECALHO NA PRIMEIRA PAG */
*
* NOMES REGIOES
MOVE 'NORTE' TO #NOME-REG(1)
MOVE 'NORDESTE' TO #NOME-REG(2)
MOVE 'SUDESTE' TO #NOME-REG(3)
MOVE 'SUL' TO #NOME-REG(4)
MOVE 'CENTRO-OESTE' TO #NOME-REG(5)
*
* NOMES STATUS
MOVE 'GERADO' TO #NOME-STS(1)
MOVE 'PAGO' TO #NOME-STS(2)
MOVE 'CANCELADO' TO #NOME-STS(3)
MOVE 'DEVOLVIDO' TO #NOME-STS(4)
MOVE 'ESTORNADO' TO #NOME-STS(5)
*
* INICIALIZA ACUMULADORES
FOR #I = 1 TO 5
  MOVE 0 TO #TOT-REG-BRUTO(#I)
  MOVE 0 TO #TOT-REG-DESC(#I)
  MOVE 0 TO #TOT-REG-LIQ(#I)
  MOVE 0 TO #QTD-REG(#I)
  MOVE 0 TO #TOT-STS-BRUTO(#I)
  MOVE 0 TO #QTD-STS(#I)
END-FOR
MOVE 0 TO #TOT-GERAL-BRUTO
MOVE 0 TO #TOT-GERAL-DESC
MOVE 0 TO #TOT-GERAL-LIQ
MOVE 0 TO #QTD-GERAL
*
* COMPETENCIA FORNECIDA PELO CMSYNIN DO SIFAPJ02
INPUT 'COMPETENCIA RELATORIO:' #COMPETENCIA
IF #COMPETENCIA = 0
  WRITE 'COMPETENCIA NAO INFORMADA NO CMSYNIN'
  TERMINATE 12
END-IF
*
* PROCESSAMENTO - LEITURA PAGAMENTOS
READ PAGAMENTO-V BY ANO-MES-REF = #COMPETENCIA
*
* QUEBRA DE CONTROLE POR COMPETENCIA - CHAMADO 3990/2006
  AT BREAK OF PAGAMENTO-V.ANO-MES-REF
    WRITE 'QUEBRA COMPETENCIA - LIDOS ATE AQUI:' #QTD-GERAL
  END-BREAK
*
  AT END OF DATA
    WRITE 'FIM DE ARQUIVO - TOTAL LIDO:' #QTD-GERAL
  END-ENDDATA
*
  IF PAGAMENTO-V.ANO-MES-REF NE #COMPETENCIA
    ESCAPE BOTTOM
  END-IF
*
* BUSCAR REGIAO DO BENEFICIARIO
  MOVE 0 TO #COD-REG
  FIND BENEFICIARIO-V WITH NUM-CPF = PAGAMENTO-V.NUM-CPF
    MOVE BENEFICIARIO-V.COD-REGIAO TO #COD-REG
  END-FIND
*
* DETERMINAR INDICE REGIAO
  IF #COD-REG >= 1 AND #COD-REG <= 5
    MOVE 1 TO #IDX-REG
  ELSE
    IF #COD-REG >= 6 AND #COD-REG <= 10
      MOVE 2 TO #IDX-REG
    ELSE
      IF #COD-REG >= 11 AND #COD-REG <= 15
        MOVE 3 TO #IDX-REG
      ELSE
        IF #COD-REG >= 16 AND #COD-REG <= 20
          MOVE 4 TO #IDX-REG
        ELSE
          MOVE 5 TO #IDX-REG
        END-IF
      END-IF
    END-IF
  END-IF
*
* ACUMULAR POR REGIAO
* NOTA: ARREDONDAMENTO DIFERE DO CALCBENF (ROUND VS TRUNCATE)
  COMPUTE #VLR-ARR = PAGAMENTO-V.VLR-BRUTO + 0.005
  COMPUTE #VLR-TEMP = #VLR-ARR * 100
  COMPUTE #VLR-ARR = #VLR-TEMP / 100
  ADD #VLR-ARR TO #TOT-REG-BRUTO(#IDX-REG)
  ADD PAGAMENTO-V.VLR-DESCONTO-TOTAL
      TO #TOT-REG-DESC(#IDX-REG)
  ADD PAGAMENTO-V.VLR-LIQUIDO  TO #TOT-REG-LIQ(#IDX-REG)
  ADD 1 TO #QTD-REG(#IDX-REG)
*
* ACUMULAR POR STATUS
  DECIDE ON FIRST VALUE OF PAGAMENTO-V.SIT-PAGAMENTO
    VALUE 'G'
      MOVE 1 TO #IDX-STS
    VALUE 'P'
      MOVE 2 TO #IDX-STS
    VALUE 'C'
      MOVE 3 TO #IDX-STS
    VALUE 'D'
      MOVE 4 TO #IDX-STS
    VALUE 'E'
      MOVE 5 TO #IDX-STS
    NONE
      MOVE 1 TO #IDX-STS
  END-DECIDE
  ADD PAGAMENTO-V.VLR-BRUTO TO #TOT-STS-BRUTO(#IDX-STS)
  ADD 1 TO #QTD-STS(#IDX-STS)
*
* ACUMULAR GERAL
  ADD #VLR-ARR TO #TOT-GERAL-BRUTO
  ADD PAGAMENTO-V.VLR-DESCONTO-TOTAL TO #TOT-GERAL-DESC
  ADD PAGAMENTO-V.VLR-LIQUIDO  TO #TOT-GERAL-LIQ
  ADD 1 TO #QTD-GERAL
*
END-READ
*
* SEM MOVIMENTO NA COMPETENCIA - RC=4 NO SIFAPJ02
IF #QTD-GERAL = 0
  WRITE 'NENHUM PAGAMENTO NA COMPETENCIA' #COMPETENCIA
  TERMINATE 4
END-IF
*
* IMPRIMIR RELATORIO
PERFORM IMPRIME-CABECALHO
*
WRITE (1) 'RESUMO POR REGIAO'
WRITE (1) '=========================================='
FOR #I = 1 TO 5
  WRITE (1) #NOME-REG(#I) '  QTD:' #QTD-REG(#I)
        '  BRUTO:' #TOT-REG-BRUTO(#I)
        '  DESC:' #TOT-REG-DESC(#I)
        '  LIQ:' #TOT-REG-LIQ(#I)
* COPIA P/ ARQUIVAMENTO CMWKF01 - CHAMADO 7120/2014
  RESET #LINHA-REL
  COMPRESS 'REG' #NOME-REG(#I) #QTD-REG(#I)
      #TOT-REG-BRUTO(#I) #TOT-REG-DESC(#I)
      #TOT-REG-LIQ(#I) INTO #LINHA-REL
  WRITE WORK FILE 1 #LINHA-REL
END-FOR
*
WRITE (1) ' '
WRITE (1) 'RESUMO POR STATUS'
WRITE (1) '=========================================='
FOR #I = 1 TO 5
  WRITE (1) #NOME-STS(#I) '  QTD:' #QTD-STS(#I)
        '  BRUTO:' #TOT-STS-BRUTO(#I)
  RESET #LINHA-REL
  COMPRESS 'STS' #NOME-STS(#I) #QTD-STS(#I)
      #TOT-STS-BRUTO(#I) INTO #LINHA-REL
  WRITE WORK FILE 1 #LINHA-REL
END-FOR
*
WRITE (1) ' '
WRITE (1) '=========================================='
WRITE (1) 'TOTAL GERAL  QTD:' #QTD-GERAL
      '  BRUTO:' #TOT-GERAL-BRUTO
      '  DESC:' #TOT-GERAL-DESC
      '  LIQ:' #TOT-GERAL-LIQ
WRITE (1) '=========================================='
*
RESET #LINHA-REL
COMPRESS 'TOT' #COMPETENCIA #QTD-GERAL #TOT-GERAL-BRUTO
    #TOT-GERAL-DESC #TOT-GERAL-LIQ INTO #LINHA-REL
WRITE WORK FILE 1 #LINHA-REL
CLOSE WORK FILE 1
*
WRITE 'BATCHREL ENCERRADO - REGISTROS:' #QTD-GERAL
TERMINATE 0
*
* --------------------------------------------------------
* TRATAMENTO DE ERRO NATURAL - CHAMADO 4182/2004
* --------------------------------------------------------
ON ERROR
  WRITE 'ERRO NATURAL NR..:' *ERROR-NR
  WRITE 'LINHA............:' *ERROR-LINE
  WRITE 'PROGRAMA.........:' *PROGRAM
  WRITE 'COMPETENCIA......:' #COMPETENCIA
  BACKOUT TRANSACTION
  CLOSE WORK FILE 1
  TERMINATE 12
END-ERROR
*
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
DEFINE SUBROUTINE IMPRIME-CABECALHO
  ADD 1 TO #PAG
  WRITE (1) '/' /* FORM FEED */
  WRITE (1) 'SIFAP - RELATORIO CONSOLIDADO MENSAL'
        52X 'PAG:' #PAG
  WRITE (1) 'COMPETENCIA:' #COMPETENCIA
        52X 'DATA:' #DT-HOJE
  WRITE (1) 60('-')
  MOVE 5 TO #LINHA
END-SUBROUTINE
*
END
