* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
* PROGRAMA: BATCHPGT
* SISTEMA:  SIFAP - SIST. FISC. ADM. PAGAMENTOS
* AUTOR:    CARLOS ROBERTO DA SILVA
* DATA:     22/06/1997
* ALTERADO: 12/08/1998 - R.SOUZA        - Y2K JANELA SECULO
* ALTERADO: 15/01/2000 - CARLOS SILVA   - OTIMIZ ORD CPF
* ALTERADO: 30/08/2004 - PATRICIA GOMES - INC LOG ERROS
* ALTERADO: 18/12/2009 - JOSE FERREIRA  - AJUSTE 13O/ABONO
* ALTERADO: 30/09/2011 - ROBERTO MENDES - INC CADEIA CALLNAT
* ALTERADO: 25/05/2012 - FERNANDA COSTA - NOVAS FAIXAS
* ALTERADO: 10/07/2015 - ANDERSON LIMA  - INC AUDITORIA
* ALTERADO: 18/03/2016 - EQUIPE SIFAP   - EXTRACAO CMWKF01
* OBJETIVO: GERACAO MENSAL DE PAGAMENTOS EM LOTE
*           BATCH CRITICO - EXECUCAO 1O DIA UTIL
*           PROCESSA TODOS BENEF ATIVOS ORD POR CPF
*           CHAMA CALCBENF E CALCDSCT - ARQ 150/160/155
*
* JOB.....: SIFAPJ01 - STEP010 - PGM=NATBATCH
* ENTRADA.: CMSYNIN - COMPETENCIA AAAAMM (CHAMADO 5980)
* SAIDA...: CMWKF01 - EXTRATO DE REMESSA   (LRECL 240)
*           CMWKF02 - LOG DE REJEITADOS    (LRECL 120)
*           CMPRINT - LOG DE EXECUCAO
* RETORNO.: 0=OK  4=COM REJEITADOS  8=NADA A FAZER
*           12=ERRO NATURAL - ACIONAR PLANTAO
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
DEFINE DATA
LOCAL USING PDAVALID
LOCAL USING PDACALC
LOCAL USING LDASIFAP
LOCAL
  1 BENEFICIARIO-V VIEW OF BENEFICIARIO
    2 NUM-CPF            (A11)
    2 NOME-COMPLETO      (A60)
    2 DT-NASCIMENTO      (N8)
    2 SIT-BENEFICIARIO   (A1)
    2 COD-PROGRAMA       (A4)
    2 VLR-RENDA-FAMILIAR (P9,2)
    2 QTD-DEPENDENTES    (N2)
    2 COD-REGIAO         (A2)
    2 UF                 (A2)
    2 NUM-NIS            (N11)
*
  1 PAGAMENTO-V VIEW OF PAGAMENTO
    2 NUM-PAGAMENTO      (N15)
    2 NUM-CPF            (A11)
    2 COD-PROGRAMA       (A4)
    2 ANO-MES-REF        (N6)
    2 VLR-BRUTO          (P9,2)
    2 VLR-DESCONTO-TOTAL (P7,2)
    2 VLR-LIQUIDO        (P9,2)
    2 DT-GERACAO         (N8)
    2 SIT-PAGAMENTO      (A1)
    2 TIPO-PAGAMENTO     (A1)
    2 VLR-ABONO          (P9,2)
    2 NUM-LOTE           (N8)
    2 SEQ-LOTE           (N6)
*
  1 PROGRAMA-V VIEW OF PROGRAMA-SOCIAL
    2 COD-PROGRAMA       (A4)
    2 TIPO-PROGRAMA      (A1)
    2 VLR-BASE-INDIVIDUAL (P7,2)
    2 FATOR-REAJUSTE     (P3,4)
    2 SIT-PROGRAMA       (A1)
    2 RENDA-MAX-PERCAP   (P7,2)
*
* TRILHA DE AUDITORIA - ARQ 153 - EXIGIDA POR CCAUDIT
  1 AUDITORIA-V VIEW OF AUDITORIA
    2 NUM-AUDITORIA      (N15)
    2 DT-EVENTO          (N8)
    2 HR-EVENTO          (N6)
    2 TS-EVENTO          (N14)
    2 COD-ACAO           (A2)
    2 COD-MODULO         (A8)
    2 DES-ACAO           (A80)
    2 TIPO-ENTIDADE      (A4)
    2 ID-ENTIDADE        (A15)
    2 NUM-CPF-AFETADO    (A11)
    2 USR-EVENTO         (A8)
    2 NOM-JOB-BATCH      (A16)
    2 SIT-BATCH          (A1)
*
* CONTADORES E ACUMULADORES
  1 #QTD-PROCESSADOS     (N8)
  1 #QTD-ERROS           (N8)
  1 #QTD-IGNORADOS       (N8)
  1 #QTD-GERADOS         (N8)
  1 #QTD-REJEIT          (N8)
  1 #VLR-TOTAL-BRUTO     (P13,2)
  1 #VLR-TOTAL-DESC      (P13,2)
  1 #VLR-TOTAL-LIQ       (P13,2)
  1 #VLR-TOTAL-ABONO     (P13,2)
*
* VARIAVEIS DE CALCULO
  1 #COMPETENCIA         (N6)
  1 #COMPET-A            (A6)
  1 #MES                 (N2)
  1 #ANO                 (N4)
  1 #DT-HOJE             (N8)
  1 #VLR-BASE            (P9,2)
  1 #VLR-BENF            (P9,2)
  1 #VLR-BRUTO           (P9,2)
  1 #VLR-DESC            (P9,2)
  1 #VLR-LIQ             (P9,2)
  1 #VLR-ABONO           (P9,2)
  1 #VLR-13              (P9,2)
  1 #VLR-TEMP            (N11)
  1 #FATOR-REG           (N3,4)
  1 #FATOR-FAM           (N3,4)
  1 #FATOR-RND           (N3,4)
  1 #FATOR-IDADE         (N3,4)
  1 #FATOR-REAJ          (N3,4)
  1 #IDADE               (N3)
  1 #ANO-NASC            (N4)
  1 #NUM-DEP             (N2)
  1 #COD-REG             (N2)
  1 #RENDA               (P9,2)
  1 #TIPO-PROG           (A1)
  1 #TIPO-PGTO           (A1)
  1 #STATUS-PROG         (A1)
  1 #ERRO-CALC           (L)
  1 #SEQ-PGTO            (N15)
  1 #MSG-LOG             (A120)
  1 #CPF-ANT             (A11)
  1 #CHAVE-CPF-COMP      (A17)
  1 #J                   (N2)
*
* TABELA FATORES REGIONAIS
  1 #TAB-REG             (N3,4/1:27)
*
* FAIXAS DE RENDA
  1 #FAIXA-RENDA         (P9,2/1:5)
  1 #FATOR-FAIXA         (N3,4/1:5)
*
* CONTROLE DE LOTE - CHAMADO 3315/1999
  1 #NUM-LOTE            (N8)
  1 #SEQ-LOTE            (N6)
*
* AREA DOS WORK FILES - DD ALOCADOS NO SIFAPJ01
* CMWKF01 EXTRATO REMESSA 240 - CMWKF02 REJEITOS 120
  1 #REG-EXTRACT         (A240)
  1 #LOG-ERRO            (A120)
*
* CAMPOS EXIGIDOS PELO COPYCODE CCAUDIT
  1 #AUD-ACAO            (A2)
  1 #AUD-ENTIDADE        (A4)
  1 #AUD-ID              (A15)
  1 #AUD-CPF             (A11)
  1 #AUD-DESCRICAO       (A80)
  1 #AUD-SEQ             (N15)
  1 #AUD-TIMN            (N7)
END-DEFINE
*
MOVE *DATN TO #DT-HOJE
*
* CALC COMPETENCIA
COMPUTE #ANO = #DT-HOJE / 10000
COMPUTE #MES = (#DT-HOJE - (#ANO * 10000)) / 100
COMPUTE #COMPETENCIA = (#ANO * 100) + #MES
*
* --------------------------------------------------------
* COMPETENCIA INFORMADA PELO CMSYNIN DO SIFAPJ01
* ATE 05/2012 ERA SEMPRE DERIVADA DE *DATN E NAO HAVIA
* COMO REPROCESSAR MES ANTERIOR - CHAMADO 5980/2012
* --------------------------------------------------------
INPUT #COMPETENCIA
IF #COMPETENCIA = 0
  COMPUTE #COMPETENCIA = (#ANO * 100) + #MES
END-IF
COMPUTE #ANO = #COMPETENCIA / 100
COMPUTE #MES = #COMPETENCIA - (#ANO * 100)
MOVE EDITED #COMPETENCIA (EM=999999) TO #COMPET-A
*
* INICIALIZA CONTADORES
MOVE 0 TO #QTD-PROCESSADOS
MOVE 0 TO #QTD-ERROS
MOVE 0 TO #QTD-IGNORADOS
MOVE 0 TO #QTD-GERADOS
MOVE 0 TO #QTD-REJEIT
MOVE 0 TO #VLR-TOTAL-BRUTO
MOVE 0 TO #VLR-TOTAL-DESC
MOVE 0 TO #VLR-TOTAL-LIQ
MOVE 0 TO #VLR-TOTAL-ABONO
MOVE 0 TO #SEQ-PGTO
MOVE 0 TO #SEQ-LOTE
MOVE #COMPETENCIA TO #NUM-LOTE
*
* INICIALIZA TABELA FATORES REGIONAIS (MESMA DO CALCBENF)
MOVE 1.3500 TO #TAB-REG(1)
MOVE 1.3200 TO #TAB-REG(2)
MOVE 1.3000 TO #TAB-REG(3)
MOVE 1.2800 TO #TAB-REG(4)
MOVE 1.3100 TO #TAB-REG(5)
MOVE 1.4000 TO #TAB-REG(6)
MOVE 1.3800 TO #TAB-REG(7)
MOVE 1.3500 TO #TAB-REG(8)
MOVE 1.3200 TO #TAB-REG(9)
MOVE 1.3600 TO #TAB-REG(10)
MOVE 1.1000 TO #TAB-REG(11)
MOVE 1.1200 TO #TAB-REG(12)
MOVE 1.0800 TO #TAB-REG(13)
MOVE 1.0500 TO #TAB-REG(14)
MOVE 1.0000 TO #TAB-REG(15)
MOVE 1.0500 TO #TAB-REG(16)
MOVE 1.0700 TO #TAB-REG(17)
MOVE 1.0300 TO #TAB-REG(18)
MOVE 1.1500 TO #TAB-REG(19)
MOVE 1.2000 TO #TAB-REG(20)
MOVE 1.1800 TO #TAB-REG(21)
MOVE 1.2500 TO #TAB-REG(22)
MOVE 1.1000 TO #TAB-REG(23)
MOVE 1.2200 TO #TAB-REG(24)
MOVE 1.3300 TO #TAB-REG(25)
MOVE 1.0000 TO #TAB-REG(26)
MOVE 1.0000 TO #TAB-REG(27)
*
* FAIXAS DE RENDA
MOVE 300.00  TO #FAIXA-RENDA(1)
MOVE 1.0000  TO #FATOR-FAIXA(1)
MOVE 600.00  TO #FAIXA-RENDA(2)
MOVE 0.8500  TO #FATOR-FAIXA(2)
MOVE 1000.00 TO #FAIXA-RENDA(3)
MOVE 0.7000  TO #FATOR-FAIXA(3)
MOVE 1500.00 TO #FAIXA-RENDA(4)
MOVE 0.5500  TO #FATOR-FAIXA(4)
MOVE 9999.99 TO #FAIXA-RENDA(5)
MOVE 0.4000  TO #FATOR-FAIXA(5)
*
WRITE '====================================='
WRITE 'BATCHPGT - GERACAO PAGAMENTOS MENSAL'
WRITE 'COMPETENCIA:' #COMPETENCIA
WRITE 'DATA EXECUCAO:' #DT-HOJE
WRITE '====================================='
*
* OBTER ULTIMO NUM PAGAMENTO - LIMITE (1) DISPENSA ESCAPE
READ (1) PAGAMENTO-V BY NUM-PAGAMENTO DESCENDING
  MOVE PAGAMENTO-V.NUM-PAGAMENTO TO #SEQ-PGTO
END-READ
*
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
* PROCESSAMENTO PRINCIPAL
* LEITURA EM ORDEM ALFABETICA POR CPF (OTIMIZACAO 1999)
* NOTA: SISTEMAS DOWNSTREAM DEPENDEM DESTA ORDENACAO
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
RESET #CPF-ANT
READ BENEFICIARIO-V BY NUM-CPF
*
  ADD 1 TO #QTD-PROCESSADOS
  MOVE FALSE TO #ERRO-CALC
*
* EVITAR DUPLICATAS
  IF BENEFICIARIO-V.NUM-CPF = #CPF-ANT
    ADD 1 TO #QTD-IGNORADOS
    ESCAPE TOP
  END-IF
  MOVE BENEFICIARIO-V.NUM-CPF TO #CPF-ANT
*
* VERIF STATUS ATIVO
  IF BENEFICIARIO-V.SIT-BENEFICIARIO NE 'A'
    ADD 1 TO #QTD-IGNORADOS
    ESCAPE TOP
  END-IF
*
* ============================================
* VALIDACAO DE CPF PELA ROTINA CORPORATIVA
* ATE 2011 A FOLHA NAO CRITICAVA O CPF LIDO DO
* ARQ 150 - CHAMADO 6620/2011
* ============================================
  MOVE 'C' TO #PV-TIPO-DOC
  MOVE BENEFICIARIO-V.NUM-CPF TO #PV-CPF
  RESET #PV-NIS
  CALLNAT 'SUBVALCP' #PV-TIPO-DOC #PV-CPF #PV-NIS
                     #PV-COD-RETORNO #PV-MSG
                     #PV-IND-ESPECIAL
  IF #PV-COD-RETORNO NE 0
    COMPRESS 'CPF INVALIDO:' BENEFICIARIO-V.NUM-CPF
        #PV-MSG INTO #MSG-LOG
    WRITE #MSG-LOG
    MOVE #MSG-LOG TO #LOG-ERRO
    WRITE WORK FILE 2 #LOG-ERRO
    ADD 1 TO #QTD-ERROS
    ADD 1 TO #QTD-REJEIT
    ESCAPE TOP
  END-IF
*
* VERIF SE JA GEROU NESTA COMPETENCIA
* USA O SUPERDESCRITOR S1 - CPF + ANO-MES-REF
  COMPRESS BENEFICIARIO-V.NUM-CPF #COMPET-A
      INTO #CHAVE-CPF-COMP LEAVING NO SPACE
  FIND NUMBER PAGAMENTO-V WITH SUPER-CPF-COMPET = #CHAVE-CPF-COMP
  IF *NUMBER > 0
    ADD 1 TO #QTD-IGNORADOS
    ESCAPE TOP
  END-IF
*
* BUSCAR PROGRAMA - ARQ 151
  RESET #STATUS-PROG #VLR-BASE #TIPO-PROG #FATOR-REAJ
  FIND PROGRAMA-V WITH COD-PROGRAMA = BENEFICIARIO-V.COD-PROGRAMA
    IF NO RECORDS FOUND
      COMPRESS 'ERRO: PROG NAO ENCONTRADO CPF='
          BENEFICIARIO-V.NUM-CPF 'PROG='
          BENEFICIARIO-V.COD-PROGRAMA INTO #MSG-LOG
      WRITE #MSG-LOG
      MOVE #MSG-LOG TO #LOG-ERRO
      WRITE WORK FILE 2 #LOG-ERRO
      ADD 1 TO #QTD-ERROS
      ADD 1 TO #QTD-REJEIT
      MOVE 'X' TO #STATUS-PROG
    END-NOREC
    MOVE PROGRAMA-V.VLR-BASE-INDIVIDUAL TO #VLR-BASE
    MOVE PROGRAMA-V.TIPO-PROGRAMA       TO #TIPO-PROG
    MOVE PROGRAMA-V.FATOR-REAJUSTE      TO #FATOR-REAJ
    MOVE PROGRAMA-V.SIT-PROGRAMA        TO #STATUS-PROG
  END-FIND
  IF #STATUS-PROG = 'X'
    ESCAPE TOP
  END-IF
  IF #STATUS-PROG NE 'A'
    ADD 1 TO #QTD-IGNORADOS
    ESCAPE TOP
  END-IF
*
* PREPARAR DADOS P/ CALCULO
  MOVE BENEFICIARIO-V.QTD-DEPENDENTES    TO #NUM-DEP
  MOVE BENEFICIARIO-V.COD-REGIAO         TO #COD-REG
  MOVE BENEFICIARIO-V.VLR-RENDA-FAMILIAR TO #RENDA
  COMPUTE #ANO-NASC = BENEFICIARIO-V.DT-NASCIMENTO / 10000
*
* --------------------------------------------------------
* JANELA DE SECULO - REMEDIACAO Y2K 08/1998
* PROJETO BUG2000 - EQUIPE R.SOUZA - CHAMADO 1998/0442
* A CARGA HISTORICA ANTERIOR A 07/1998 GRAVOU AAMMDD.
* REGISTRO NAO CONVERTIDO AINDA CHEGA COM ANO < 100.
* --------------------------------------------------------
  IF #ANO-NASC < 100
    MOVE #ANO-NASC TO #L-AA-CURTO
    IF #L-AA-CURTO < #L-SEC-JANELA
      COMPUTE #L-ANO-EXPANDIDO = 2000 + #L-AA-CURTO
    ELSE
      COMPUTE #L-ANO-EXPANDIDO = 1900 + #L-AA-CURTO
    END-IF
    MOVE #L-ANO-EXPANDIDO TO #ANO-NASC
  END-IF
  COMPUTE #IDADE = #ANO - #ANO-NASC
*
* ============================================
* CADEIA CORPORATIVA DE CALCULO - CHAMADO 6621/2011
* VALELEG E CALCBENF PASSARAM A SER CHAMADOS DAQUI.
* O CALCULO INLINE ABAIXO SEGUE ATIVO ATE PARECER DA
* COORD. DE BENEFICIOS - CHAMADO 6622/2011 EM ABERTO.
* ============================================
  MOVE BENEFICIARIO-V.NUM-CPF      TO #PC-CPF
  MOVE BENEFICIARIO-V.COD-PROGRAMA TO #PC-COD-PROGRAMA
  MOVE BENEFICIARIO-V.COD-REGIAO   TO #PC-COD-REGIAO
  MOVE #COMPETENCIA                TO #PC-COMPETENCIA
  MOVE #RENDA                      TO #PC-RENDA-FAMILIAR
  MOVE #NUM-DEP                    TO #PC-QTD-DEPEND
  MOVE #IDADE                      TO #PC-IDADE
  MOVE #VLR-BASE                   TO #PC-VLR-BASE
  MOVE BENEFICIARIO-V.SIT-BENEFICIARIO TO #PC-SIT-BENEF
  RESET #PC-VLR-BRUTO #PC-VLR-DESCONTO
        #PC-VLR-ABONO #PC-VLR-LIQUIDO
        #PC-TIPO-PGTO #PC-COD-RETORNO #PC-MSG
*
  CALLNAT 'VALELEG'  #PC-CPF #PC-COD-PROGRAMA #PC-COMPETENCIA
                     #PC-COD-REGIAO #PC-RENDA-FAMILIAR
                     #PC-QTD-DEPEND #PC-IDADE #PC-SIT-BENEF
                     #PC-VLR-BASE #PC-VLR-BRUTO
                     #PC-VLR-DESCONTO #PC-VLR-ABONO
                     #PC-VLR-LIQUIDO #PC-TIPO-PGTO
                     #PC-COD-RETORNO #PC-MSG
  IF #PC-COD-RETORNO NE 0
    ADD 1 TO #QTD-IGNORADOS
    ESCAPE TOP
  END-IF
*
  CALLNAT 'CALCBENF' #PC-CPF #PC-COD-PROGRAMA #PC-COMPETENCIA
                     #PC-COD-REGIAO #PC-RENDA-FAMILIAR
                     #PC-QTD-DEPEND #PC-IDADE #PC-SIT-BENEF
                     #PC-VLR-BASE #PC-VLR-BRUTO
                     #PC-VLR-DESCONTO #PC-VLR-ABONO
                     #PC-VLR-LIQUIDO #PC-TIPO-PGTO
                     #PC-COD-RETORNO #PC-MSG
*
* CALC FATOR REGIONAL
  IF #COD-REG >= 1 AND #COD-REG <= 25
    MOVE #TAB-REG(#COD-REG) TO #FATOR-REG
  ELSE
    MOVE 1.0000 TO #FATOR-REG
  END-IF
*
* CALC FATOR FAMILIAR
  IF #NUM-DEP = 0
    MOVE 1.0000 TO #FATOR-FAM
  ELSE
    IF #NUM-DEP <= 2
      COMPUTE #FATOR-FAM = 1.0000 + (#NUM-DEP * 0.0500)
    ELSE
      IF #NUM-DEP <= 4
        COMPUTE #FATOR-FAM = 1.1000 + ((#NUM-DEP - 2) * 0.0300)
      ELSE
        COMPUTE #FATOR-FAM = 1.1600 + ((#NUM-DEP - 4) * 0.0200)
      END-IF
    END-IF
  END-IF
*
* CALC FATOR RENDA
  PERFORM DET-FAIXA-RENDA-BATCH
*
* CALC FATOR IDADE
  IF #IDADE >= 65
    MOVE 1.1500 TO #FATOR-IDADE
  ELSE
    IF #IDADE >= 60
      MOVE 1.1000 TO #FATOR-IDADE
    ELSE
      IF #IDADE < 18
        MOVE 1.0500 TO #FATOR-IDADE
      ELSE
        MOVE 1.0000 TO #FATOR-IDADE
      END-IF
    END-IF
  END-IF
*
* CALCULO PRINCIPAL
  COMPUTE #VLR-BENF = #VLR-BASE * #FATOR-REG * #FATOR-FAM
                       * #FATOR-RND * #FATOR-IDADE
  COMPUTE #VLR-BENF = #VLR-BENF * (1 + #FATOR-REAJ)
* TRUNCAR
  COMPUTE #VLR-TEMP = #VLR-BENF * 100
  COMPUTE #VLR-BENF = #VLR-TEMP / 100
  MOVE #VLR-BENF TO #VLR-BRUTO
  MOVE 0 TO #VLR-ABONO
  MOVE 0 TO #VLR-13
  MOVE 'N' TO #TIPO-PGTO
*
* 13O SALARIO E ABONO - DEZEMBRO
  IF #MES = 12
    MOVE 'D' TO #TIPO-PGTO
    COMPUTE #VLR-13 = #VLR-BASE * #FATOR-REG * #FATOR-IDADE
    COMPUTE #VLR-TEMP = #VLR-13 * 100
    COMPUTE #VLR-13 = #VLR-TEMP / 100
    COMPUTE #VLR-BRUTO = #VLR-BENF + #VLR-13
    IF #TIPO-PROG = 'A'
      COMPUTE #VLR-ABONO = #VLR-BENF * 0.15
      COMPUTE #VLR-TEMP = #VLR-ABONO * 100
      COMPUTE #VLR-ABONO = #VLR-TEMP / 100
      COMPUTE #VLR-BRUTO = #VLR-BRUTO + #VLR-ABONO
    END-IF
  END-IF
*
* CALC DESCONTOS SIMPLIFICADO
  MOVE 0 TO #VLR-DESC
  IF #VLR-BRUTO > 500.00
    COMPUTE #VLR-DESC = #VLR-BRUTO * 0.03
    COMPUTE #VLR-TEMP = #VLR-DESC * 100
    COMPUTE #VLR-DESC = #VLR-TEMP / 100
  END-IF
*
* CALC LIQUIDO
  COMPUTE #VLR-LIQ = #VLR-BRUTO - #VLR-DESC
  IF #VLR-LIQ < 0
    MOVE 0 TO #VLR-LIQ
  END-IF
  COMPUTE #VLR-TEMP = #VLR-LIQ * 100
  COMPUTE #VLR-LIQ = #VLR-TEMP / 100
*
* GRAVAR PAGAMENTO
  ADD 1 TO #SEQ-PGTO
  ADD 1 TO #SEQ-LOTE
  MOVE #SEQ-PGTO              TO PAGAMENTO-V.NUM-PAGAMENTO
  MOVE BENEFICIARIO-V.NUM-CPF TO PAGAMENTO-V.NUM-CPF
  MOVE BENEFICIARIO-V.COD-PROGRAMA TO PAGAMENTO-V.COD-PROGRAMA
  MOVE #COMPETENCIA            TO PAGAMENTO-V.ANO-MES-REF
  MOVE #VLR-BRUTO              TO PAGAMENTO-V.VLR-BRUTO
  MOVE #VLR-DESC               TO PAGAMENTO-V.VLR-DESCONTO-TOTAL
  MOVE #VLR-LIQ                TO PAGAMENTO-V.VLR-LIQUIDO
  MOVE #DT-HOJE                TO PAGAMENTO-V.DT-GERACAO
  MOVE 'G'                     TO PAGAMENTO-V.SIT-PAGAMENTO
  MOVE #TIPO-PGTO              TO PAGAMENTO-V.TIPO-PAGAMENTO
  MOVE #VLR-ABONO              TO PAGAMENTO-V.VLR-ABONO
  MOVE #NUM-LOTE               TO PAGAMENTO-V.NUM-LOTE
  MOVE #SEQ-LOTE               TO PAGAMENTO-V.SEQ-LOTE
  STORE PAGAMENTO-V
  END TRANSACTION
*
* EXTRACAO P/ REMESSA BANCARIA - CMWKF01 LRECL 240
* DD ALOCADO NO SIFAPJ01 - CHAMADO 7905/2016
  RESET #REG-EXTRACT
  MOVE '3' TO SUBSTR(#REG-EXTRACT,1,1)
  MOVE BENEFICIARIO-V.NUM-CPF TO SUBSTR(#REG-EXTRACT,2,11)
  MOVE BENEFICIARIO-V.COD-PROGRAMA
       TO SUBSTR(#REG-EXTRACT,13,4)
  MOVE #COMPET-A TO SUBSTR(#REG-EXTRACT,17,6)
  MOVE EDITED #SEQ-PGTO (EM=999999999999999)
       TO SUBSTR(#REG-EXTRACT,23,15)
  MOVE EDITED #VLR-LIQ (EM=9999999V99)
       TO SUBSTR(#REG-EXTRACT,38,9)
  WRITE WORK FILE 1 #REG-EXTRACT
*
  ADD 1 TO #QTD-GERADOS
  ADD #VLR-BRUTO TO #VLR-TOTAL-BRUTO
  ADD #VLR-DESC  TO #VLR-TOTAL-DESC
  ADD #VLR-LIQ   TO #VLR-TOTAL-LIQ
  ADD #VLR-ABONO TO #VLR-TOTAL-ABONO
*
* LOG A CADA 1000 REGISTROS
  IF #QTD-GERADOS MOD 1000 = 0
    WRITE 'PROCESSADOS:' #QTD-GERADOS
          'ULTIMO CPF:' BENEFICIARIO-V.NUM-CPF
  END-IF
*
END-READ
*
* RESUMO FINAL
WRITE '=====================================' /
      'BATCHPGT - RESUMO PROCESSAMENTO' /
      '=====================================' /
      'COMPETENCIA......:' #COMPETENCIA /
      'TOTAL PROCESSADOS:' #QTD-PROCESSADOS /
      'PAGTOS GERADOS...:' #QTD-GERADOS /
      'IGNORADOS........:' #QTD-IGNORADOS /
      'ERROS............:' #QTD-ERROS /
      'VLR TOTAL BRUTO..:' #VLR-TOTAL-BRUTO /
      'VLR TOTAL DESC...:' #VLR-TOTAL-DESC /
      'VLR TOTAL LIQUIDO:' #VLR-TOTAL-LIQ /
      'VLR TOTAL ABONO..:' #VLR-TOTAL-ABONO /
      '====================================='
*
* --------------------------------------------------------
* TRILHA DE AUDITORIA DO CICLO - ARQ 153
* IN-TCU 63/2010 - CHAMADO 7741/2015
* --------------------------------------------------------
MOVE 'BT'      TO #AUD-ACAO
MOVE 'PGTO'    TO #AUD-ENTIDADE
MOVE #COMPET-A TO #AUD-ID
RESET #AUD-CPF
COMPRESS 'FOLHA GERADA COMPET' #COMPET-A
    'QTD' #QTD-GERADOS INTO #AUD-DESCRICAO
PERFORM GRAVA-AUDITORIA
END TRANSACTION
*
CLOSE WORK FILE 1
CLOSE WORK FILE 2
*
* --------------------------------------------------------
* CODIGO DE RETORNO P/ O JCL SIFAPJ01
*   0 = FOLHA GERADA SEM REJEITADOS
*   4 = FOLHA GERADA COM REJEITADOS EM CMWKF02
*   8 = COMPETENCIA JA PROCESSADA - NADA A FAZER
* CHAMADO 4180/2004
* --------------------------------------------------------
IF #QTD-GERADOS = 0
  WRITE 'NENHUM PAGAMENTO GERADO P/ A COMPETENCIA'
  TERMINATE 8
END-IF
IF #QTD-REJEIT > 0
  WRITE 'HA REJEITADOS EM CMWKF02 - CONFERIR'
  TERMINATE 4
END-IF
TERMINATE 0
*
* --------------------------------------------------------
* TRATAMENTO DE ERRO NATURAL - CHAMADO 4181/2004
* O RC=12 ACIONA O STEP030 DE AVISO NO SIFAPJ01
* --------------------------------------------------------
ON ERROR
  WRITE 'ERRO NATURAL NR..:' *ERROR-NR
  WRITE 'LINHA............:' *ERROR-LINE
  WRITE 'PROGRAMA.........:' *PROGRAM
  WRITE 'ULTIMO CPF LIDO..:' #CPF-ANT
  WRITE 'COMPETENCIA......:' #COMPETENCIA
  BACKOUT TRANSACTION
  CLOSE WORK FILE 1
  CLOSE WORK FILE 2
  TERMINATE 12
END-ERROR
*
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
DEFINE SUBROUTINE DET-FAIXA-RENDA-BATCH
  FOR #J = 1 TO 5
    IF #RENDA <= #FAIXA-RENDA(#J)
      MOVE #FATOR-FAIXA(#J) TO #FATOR-RND
      ESCAPE BOTTOM
    END-IF
  END-FOR
END-SUBROUTINE
*
INCLUDE CCAUDIT
*
END
