* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
* PROGRAMA: BATCHCON
* SISTEMA:  SIFAP - SIST. FISC. ADM. PAGAMENTOS
* AUTOR:    MARCOS ANTONIO RIBEIRO
* DATA:     05/03/2000
* ALTERADO: 18/09/2005 - MARCOS RIBEIRO - INC BANCO REAL
* ALTERADO: 22/06/2008 - ROBERTO MENDES - AJUSTE CNAB 240
* ALTERADO: 30/01/2014 - ANDERSON LIMA  - INC AUDITORIA
* ALTERADO: 11/05/2017 - EQUIPE SIFAP   - INC CCAUDIT/ON ERROR
* OBJETIVO: CONCILIACAO PAGAMENTOS X RETORNO BANCARIO
*           PROCESSO CNAB 240 BANCO DO BRASIL
*           GERA REGISTROS AUDITORIA - ARQ 160/170
*
* JOB.....: NAO AUTOMATIZADO - EXECUCAO MANUAL VIA NATURAL
*           CHAMADO 8110/2017 - JCL PROPRIO SOLICITADO
* ENTRADA.: CMWKF01 - RETORNO CNAB 240 (LRECL 240)
* SAIDA...: CMPRINT - LOG DE EXECUCAO
* RETORNO.: 0=OK  4=COM DIVERGENCIAS  12=ERRO NATURAL
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
DEFINE DATA
LOCAL USING LDASIFAP
LOCAL
  1 PAGAMENTO-V VIEW OF PAGAMENTO
    2 NUM-PAGAMENTO      (N15)
    2 NUM-CPF            (A11)
    2 COD-PROGRAMA       (A4)
    2 ANO-MES-REF        (N6)
    2 VLR-BRUTO          (P9,2)
    2 VLR-LIQUIDO        (P9,2)
    2 SIT-PAGAMENTO      (A1)
    2 DT-GERACAO         (N8)
    2 DT-CREDITO         (N8)
    2 COD-BANCO          (A3)
    2 COD-RETORNO-BANCO  (A2)
*
  1 AUDITORIA-V VIEW OF AUDITORIA
    2 NUM-AUDITORIA      (N15)
    2 DT-EVENTO          (N8)
    2 HR-EVENTO          (N6)
    2 TS-EVENTO          (N14)
    2 COD-ACAO           (A2)
    2 COD-MODULO         (A8)
    2 DES-ACAO           (A80)
    2 TIPO-ENTIDADE      (A4)
    2 ID-ENTIDADE        (A15)
    2 NUM-CPF-AFETADO    (A11)
    2 USR-EVENTO         (A8)
    2 NOM-JOB-BATCH      (A16)
    2 SIT-BATCH          (A1)
    2 VLR-ANTERIOR       (A60)
    2 VLR-NOVO           (A60)
*
* REGISTRO CNAB 240 - LAYOUT BB
  1 #REG-CNAB            (A240)
  1 #CNAB-BANCO          (A3)
  1 #CNAB-LOTE           (A4)
  1 #CNAB-TIPO-REG       (A1)
  1 #CNAB-CPF            (A11)
  1 #CNAB-VLR            (A15)
  1 #CNAB-DT-PGTO        (A8)
  1 #CNAB-COD-RET        (A2)
  1 #CNAB-NUM-DOC        (A10)
*
  1 #COMPETENCIA         (N6)
  1 #COMPET-A            (A6)
  1 #DT-HOJE             (N8)
  1 #HR-ATUAL             (N6)
  1 #TIMN-AUX            (N7)
  1 #ARQ-RETORNO         (A60)
*
* CONTADORES
  1 #QTD-LIDOS           (N8)
  1 #QTD-CONCILIADOS     (N8)
  1 #QTD-DIVERGENTES     (N8)
  1 #QTD-NAO-ENCONTRADOS (N8)
  1 #QTD-AUDIT           (N8)
*
* VARIAVEIS TRABALHO
  1 #CPF-NUM             (N11)
  1 #VLR-RETORNO         (P9,2)
  1 #VLR-STR             (A15)
  1 #VLR-CENT            (N15)
  1 #VLR-PGTO-SIFAP      (P9,2)
  1 #NUM-PGTO            (N15)
  1 #DT-PGTO             (N8)
  1 #COD-RET             (A2)
  1 #FOUND               (L)
  1 #SEQ-AUDIT           (N15)
  1 #MSG                 (A80)
  1 #DIFF                (P9,2)
  1 #I                   (N2)
  1 #VLR-ANT-STR         (A60)
  1 #VLR-NOV-STR         (A60)
*
* CAMPOS EXIGIDOS PELO COPYCODE CCAUDIT
  1 #AUD-ACAO            (A2)
  1 #AUD-ENTIDADE        (A4)
  1 #AUD-ID              (A15)
  1 #AUD-CPF             (A11)
  1 #AUD-DESCRICAO       (A80)
  1 #AUD-SEQ             (N15)
  1 #AUD-TIMN            (N7)
END-DEFINE
*
MOVE *DATN TO #DT-HOJE
* *TIMN RETORNA N7 (HHMMSST) - ARQ 153 ARMAZENA N6
MOVE *TIMN TO #TIMN-AUX
DIVIDE 10 INTO #TIMN-AUX GIVING #HR-ATUAL
MOVE 0 TO #QTD-LIDOS
MOVE 0 TO #QTD-CONCILIADOS
MOVE 0 TO #QTD-DIVERGENTES
MOVE 0 TO #QTD-NAO-ENCONTRADOS
MOVE 0 TO #QTD-AUDIT
*
* OBTER ULTIMO SEQ AUDIT - LIMITE (1) DISPENSA ESCAPE
READ (1) AUDITORIA-V BY NUM-AUDITORIA DESCENDING
  MOVE AUDITORIA-V.NUM-AUDITORIA TO #SEQ-AUDIT
END-READ
*
INPUT 'SIFAP - CONCILIACAO BANCARIA' /
      '=============================' /
      'COMPETENCIA.....:' #COMPETENCIA /
      'ARQUIVO RETORNO.:' #ARQ-RETORNO
*
WRITE '================================================'
WRITE 'BATCHCON - CONCILIACAO PAGAMENTOS'
WRITE 'COMPETENCIA:' #COMPETENCIA
WRITE 'ARQUIVO:' #ARQ-RETORNO
WRITE '================================================'
*
* LEITURA ARQUIVO RETORNO CNAB 240
* EM Z/OS O VINCULO E PELA DD CMWKF01 - O NOME INFORMADO
* ACIMA E APENAS DOCUMENTAL - CHAMADO 8111/2017
MOVE EDITED #COMPETENCIA (EM=999999) TO #COMPET-A
READ WORK FILE 1 #REG-CNAB
*
  ADD 1 TO #QTD-LIDOS
*
* PARSE REGISTRO CNAB 240
  MOVE SUBSTR(#REG-CNAB,1,3)     TO #CNAB-BANCO
  MOVE SUBSTR(#REG-CNAB,4,4)     TO #CNAB-LOTE
  MOVE SUBSTR(#REG-CNAB,8,1)     TO #CNAB-TIPO-REG
*
* PROCESSAR APENAS REGISTROS DETALHE (TIPO=3)
  IF #CNAB-TIPO-REG NE '3'
    ESCAPE TOP
  END-IF
*
  MOVE SUBSTR(#REG-CNAB,44,11)   TO #CNAB-CPF
  MOVE SUBSTR(#REG-CNAB,120,15)  TO #CNAB-VLR
  MOVE SUBSTR(#REG-CNAB,140,8)   TO #CNAB-DT-PGTO
  MOVE SUBSTR(#REG-CNAB,231,2)   TO #CNAB-COD-RET
  MOVE SUBSTR(#REG-CNAB,74,10)   TO #CNAB-NUM-DOC
*
  MOVE #CNAB-CPF TO #CPF-NUM
  MOVE #CNAB-NUM-DOC TO #NUM-PGTO
*
* CONVERTER VALOR (CENTAVOS -> REAIS)
* ATE 2017 O A15 IA DIRETO P/ CAMPO COM DECIMAIS
* CHAMADO 8112/2017
  MOVE #CNAB-VLR TO #VLR-STR
  MOVE #VLR-STR TO #VLR-CENT
  COMPUTE #VLR-RETORNO = #VLR-CENT / 100
*
  MOVE #CNAB-DT-PGTO TO #DT-PGTO
  MOVE #CNAB-COD-RET TO #COD-RET
*
* BUSCAR PAGAMENTO CORRESPONDENTE
  MOVE FALSE TO #FOUND
  RESET #VLR-PGTO-SIFAP
  FIND PAGAMENTO-V WITH NUM-PAGAMENTO = #NUM-PGTO
    IF PAGAMENTO-V.NUM-CPF = #CNAB-CPF
        AND PAGAMENTO-V.ANO-MES-REF = #COMPETENCIA
      MOVE TRUE TO #FOUND
      MOVE PAGAMENTO-V.VLR-LIQUIDO TO #VLR-PGTO-SIFAP
    END-IF
  END-FIND
*
  IF NOT #FOUND
    ADD 1 TO #QTD-NAO-ENCONTRADOS
    COMPRESS 'NAO ENCONTRADO: CPF=' #CNAB-CPF ' DOC=' #CNAB-NUM-DOC
        INTO #MSG
    WRITE #MSG
    ESCAPE TOP
  END-IF
*
* CONCILIAR VALORES
  COMPUTE #DIFF = #VLR-PGTO-SIFAP - #VLR-RETORNO
  IF #DIFF < 0
    COMPUTE #DIFF = #DIFF * -1
  END-IF
*
  IF #DIFF > 0.01
    ADD 1 TO #QTD-DIVERGENTES
    COMPRESS 'DIVERGENCIA: CPF=' #CNAB-CPF
        ' SIFAP=' #VLR-PGTO-SIFAP
        ' BANCO=' #VLR-RETORNO INTO #MSG
    WRITE #MSG
*
    PERFORM GRAVA-AUDITORIA-DIVERG
  ELSE
    ADD 1 TO #QTD-CONCILIADOS
* ATUALIZAR STATUS PAGAMENTO
    DECIDE ON FIRST VALUE OF #COD-RET
      VALUE '00'
        FIND PAGAMENTO-V WITH NUM-PAGAMENTO = #NUM-PGTO
          MOVE 'P'     TO PAGAMENTO-V.SIT-PAGAMENTO
          MOVE #DT-PGTO TO PAGAMENTO-V.DT-CREDITO
          MOVE 1        TO PAGAMENTO-V.COD-BANCO
          MOVE #COD-RET TO PAGAMENTO-V.COD-RETORNO-BANCO
          UPDATE PAGAMENTO-V
          END TRANSACTION
        END-FIND
      VALUE '01'
        FIND PAGAMENTO-V WITH NUM-PAGAMENTO = #NUM-PGTO
          MOVE 'D'     TO PAGAMENTO-V.SIT-PAGAMENTO
          MOVE #COD-RET TO PAGAMENTO-V.COD-RETORNO-BANCO
          UPDATE PAGAMENTO-V
          END TRANSACTION
        END-FIND
      VALUE '02'
        FIND PAGAMENTO-V WITH NUM-PAGAMENTO = #NUM-PGTO
          MOVE 'E'     TO PAGAMENTO-V.SIT-PAGAMENTO
          MOVE #COD-RET TO PAGAMENTO-V.COD-RETORNO-BANCO
          UPDATE PAGAMENTO-V
          END TRANSACTION
        END-FIND
      NONE
        COMPRESS 'COD RETORNO DESCONHECIDO:' #COD-RET
            ' CPF=' #CNAB-CPF INTO #MSG
        WRITE #MSG
    END-DECIDE
*
    PERFORM GRAVA-AUDITORIA-CONC
  END-IF
*
END-WORK
*
* --------------------------------------------------------
* INTEGRACAO BANCO REAL - DESCONTINUADA
* BANCO REAL FOI ADQUIRIDO PELO SANTANDER EM 2007
* MANTER CODIGO PARA REFERENCIA HISTORICA
* RESPONSAVEL: MARCOS RIBEIRO - 18/09/2005
* --------------------------------------------------------
*  DEFINE WORK FILE 2 'RETORNO_REAL.DAT' TYPE 'ASCII'
*  READ WORK FILE 2 #REG-CNAB
*    MOVE SUBSTR(#REG-CNAB,1,3) TO #CNAB-BANCO
*    IF #CNAB-BANCO NE '356'   /* COD BANCO REAL */
*      ESCAPE TOP
*    END-IF
*    MOVE SUBSTR(#REG-CNAB,30,14) TO #CNAB-CPF
*    MOVE SUBSTR(#REG-CNAB,100,13) TO #CNAB-VLR
*    /* LAYOUT BANCO REAL DIFERENTE DO BB */
*    /* VALOR EM POSICAO 100-112, CPF EM 30-43 */
*    PERFORM CONCILIA-REAL
*  END-WORK
* --------------------------------------------------------
*
* RESUMO
WRITE '================================================' /
      'BATCHCON - RESUMO CONCILIACAO' /
      '================================================' /
      'REGISTROS LIDOS........:' #QTD-LIDOS /
      'CONCILIADOS............:' #QTD-CONCILIADOS /
      'DIVERGENTES............:' #QTD-DIVERGENTES /
      'NAO ENCONTRADOS........:' #QTD-NAO-ENCONTRADOS /
      'REGISTROS AUDITORIA....:' #QTD-AUDIT /
      '================================================'
*
* --------------------------------------------------------
* TRILHA DE AUDITORIA DO CICLO - ARQ 153
* IN-TCU 63/2010 - CHAMADO 8113/2017
* SEMENTE HERDADA DE #SEQ-AUDIT P/ NAO DUPLICAR CHAVE
* --------------------------------------------------------
MOVE #SEQ-AUDIT TO #AUD-SEQ
MOVE 'BT'       TO #AUD-ACAO
MOVE 'PGTO'     TO #AUD-ENTIDADE
MOVE #COMPET-A  TO #AUD-ID
RESET #AUD-CPF
COMPRESS 'CONCILIACAO COMPET' #COMPET-A
    'LIDOS' #QTD-LIDOS 'DIVERG' #QTD-DIVERGENTES
    INTO #AUD-DESCRICAO
PERFORM GRAVA-AUDITORIA
MOVE #AUD-SEQ TO #SEQ-AUDIT
END TRANSACTION
*
CLOSE WORK FILE 1
*
* CODIGO DE RETORNO - CHAMADO 8114/2017
IF #QTD-DIVERGENTES > 0 OR #QTD-NAO-ENCONTRADOS > 0
  WRITE 'CONCILIACAO COM PENDENCIAS - CONFERIR LOG'
  TERMINATE 4
END-IF
TERMINATE 0
*
* --------------------------------------------------------
* TRATAMENTO DE ERRO NATURAL - CHAMADO 8115/2017
* --------------------------------------------------------
ON ERROR
  WRITE 'ERRO NATURAL NR..:' *ERROR-NR
  WRITE 'LINHA............:' *ERROR-LINE
  WRITE 'PROGRAMA.........:' *PROGRAM
  WRITE 'ULTIMO DOC CNAB..:' #CNAB-NUM-DOC
  WRITE 'REGISTROS LIDOS..:' #QTD-LIDOS
  BACKOUT TRANSACTION
  CLOSE WORK FILE 1
  TERMINATE 12
END-ERROR
*
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
DEFINE SUBROUTINE GRAVA-AUDITORIA-CONC
  ADD 1 TO #SEQ-AUDIT
  ADD 1 TO #QTD-AUDIT
  MOVE #SEQ-AUDIT  TO AUDITORIA-V.NUM-AUDITORIA
  MOVE #DT-HOJE    TO AUDITORIA-V.DT-EVENTO
  MOVE #HR-ATUAL   TO AUDITORIA-V.HR-EVENTO
  MOVE 'BATCH'     TO AUDITORIA-V.USR-EVENTO
  MOVE 'CO'        TO AUDITORIA-V.COD-ACAO
  MOVE 'PGTO'      TO AUDITORIA-V.TIPO-ENTIDADE
  MOVE #NUM-PGTO   TO AUDITORIA-V.ID-ENTIDADE
  COMPRESS 'CONCILIADO COD RET=' #COD-RET INTO AUDITORIA-V.DES-ACAO
  STORE AUDITORIA-V
  END TRANSACTION
END-SUBROUTINE
*
DEFINE SUBROUTINE GRAVA-AUDITORIA-DIVERG
  ADD 1 TO #SEQ-AUDIT
  ADD 1 TO #QTD-AUDIT
  MOVE #SEQ-AUDIT  TO AUDITORIA-V.NUM-AUDITORIA
  MOVE #DT-HOJE    TO AUDITORIA-V.DT-EVENTO
  MOVE #HR-ATUAL   TO AUDITORIA-V.HR-EVENTO
  MOVE 'BATCH'     TO AUDITORIA-V.USR-EVENTO
  MOVE 'DV'        TO AUDITORIA-V.COD-ACAO
  MOVE 'PGTO'      TO AUDITORIA-V.TIPO-ENTIDADE
  MOVE #NUM-PGTO   TO AUDITORIA-V.ID-ENTIDADE
  MOVE #VLR-PGTO-SIFAP TO #VLR-ANT-STR
  MOVE #VLR-RETORNO TO #VLR-NOV-STR
  MOVE #VLR-ANT-STR TO AUDITORIA-V.VLR-ANTERIOR
  MOVE #VLR-NOV-STR TO AUDITORIA-V.VLR-NOVO
  COMPRESS 'DIVERGENCIA VALOR SIFAP X BANCO' INTO AUDITORIA-V.DES-ACAO
  STORE AUDITORIA-V
  END TRANSACTION
END-SUBROUTINE
*
INCLUDE CCAUDIT
*
END
