* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
* PROGRAMA: CADBENEF
* SISTEMA:  SIFAP - SIST. FISC. ADM. PAGAMENTOS
* AUTOR:    CARLOS ROBERTO DA SILVA
* DATA:     15/03/1997
* ALTERADO: 22/08/2005 - MARCIA HELENA - INC VALID CPF
* ALTERADO: 10/01/2011 - JOSE FERREIRA - AJUSTE STATUS IDOSO
* ALTERADO: 07/06/2011 - ROBERTO MENDES - INC CALLNAT VALID
* ALTERADO: 12/09/2012 - ANDERSON LIMA  - INC TRILHA AUDIT
* OBJETIVO: CADASTRO DE BENEFICIARIO - INCLUSAO/ALTERACAO
*           MANUTENCAO DADOS CADASTRAIS ARQ 150
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
DEFINE DATA
LOCAL USING PDAVALID
LOCAL
  1 BENEFICIARIO-V VIEW OF BENEFICIARIO
    2 NUM-CPF            (A11)
    2 NOME-COMPLETO      (A60)
    2 DT-NASCIMENTO      (N8)
    2 SEXO               (A1)
    2 GRP-ENDERECO
      3 LOGRADOURO       (A60)
      3 BAIRRO           (A40)
      3 MUNICIPIO        (A40)
      3 UF               (A2)
      3 CEP              (N8)
    2 TEL-CELULAR        (A15)
    2 RG-NUMERO          (A15)
    2 SIT-BENEFICIARIO   (A1)
    2 COD-PROGRAMA       (A4)
    2 VLR-RENDA-FAMILIAR (P9,2)
    2 QTD-DEPENDENTES    (N2)
    2 DT-CADASTRO        (N8)
    2 DT-ULT-ALTERACAO   (N8)
    2 COD-REGIAO         (A2)
    2 NUM-NIS            (N11)
*
* TRILHA DE AUDITORIA - ARQ 153 - IN-TCU 63/2010
  1 AUDITORIA-V VIEW OF AUDITORIA
    2 NUM-AUDITORIA      (N15)
    2 DT-EVENTO          (N8)
    2 HR-EVENTO          (N6)
    2 TS-EVENTO          (N14)
    2 COD-ACAO           (A2)
    2 COD-MODULO         (A8)
    2 DES-ACAO           (A80)
    2 TIPO-ENTIDADE      (A4)
    2 ID-ENTIDADE        (A15)
    2 NUM-CPF-AFETADO    (A11)
    2 USR-EVENTO         (A8)
    2 NOM-JOB-BATCH      (A16)
    2 SIT-BATCH          (A1)
*
  1 #CPF                 (N11)
  1 #NOME                (A60)
  1 #DT-NASC             (N8)
  1 #SEXO                (A1)
  1 #ENDERECO            (A80)
  1 #MUNICIPIO           (A40)
  1 #UF                  (A2)
  1 #CEP                 (N8)
  1 #TELEFONE            (A15)
  1 #RG                  (A15)
  1 #STATUS              (A1)
  1 #COD-PROG            (N4)
  1 #RENDA-FAM           (P9,2)
  1 #NUM-DEP             (N2)
  1 #COD-REG             (N2)
  1 #NIS                 (N11)
*
  1 #OPER                (A1)    /* I=INCLUSAO A=ALTERACAO */
  1 #DT-HOJE             (N8)
  1 #ANO-ATUAL           (N4)
  1 #ANO-NASC            (N4)
  1 #IDADE               (N3)
  1 #MSG                 (A60)
  1 #ERRO                (L)
  1 #CPF-VALIDO          (L)
  1 #FOUND               (L)
*
* RETORNO DA VALIDACAO CORPORATIVA - CALLNAT VALBENEF
  1 #RESULTADO           (A1)
  1 #QTD-ERROS           (N2)
  1 #MSG-ERRO            (A60/1:10)
*
* CAMPOS DA TRILHA DE AUDITORIA - CCAUDIT
  1 #AUD-ACAO            (A2)
  1 #AUD-ENTIDADE        (A4)
  1 #AUD-ID              (A15)
  1 #AUD-CPF             (A11)
  1 #AUD-DESCRICAO       (A80)
  1 #AUD-SEQ             (N15)
  1 #AUD-TIMN            (N7)
*
* VARIAVEIS P/ VALIDACAO CPF
  1 #CPF-STR             (A11)
  1 #DIG                 (N1/1:11)
  1 #SOMA                (N5)
  1 #RESTO               (N3)
  1 #DV1                 (N1)
  1 #DV2                 (N1)
  1 #PESO                (N2)
  1 #I                   (N2)
END-DEFINE
*
* OBTER DATA ATUAL
MOVE *DATN TO #DT-HOJE
* CHAMADO 6622/2011 - EXTRACAO DO ANO CORRIGIDA
* (USAVA DIVIDE C/ REMAINDER NA MESMA VARIAVEL)
COMPUTE #ANO-ATUAL = #DT-HOJE / 10000
*
* CONTROLE DE FLUXO - CHAMADO 6622/2011
* REPEAT EXTERNO P/ VIABILIZAR A SAIDA ANTECIPADA DAS
* VALIDACOES (ESCAPE BOTTOM) SEM REESCREVER AS REGRAS
REPEAT
*
INPUT 'SIFAP - CADASTRO DE BENEFICIARIO' /
      '================================' /
      'OPERACAO (I/A):' #OPER /
      'CPF...........:' #CPF /
      'NOME..........:' #NOME /
      'DT NASCIMENTO.:' #DT-NASC '(AAAAMMDD)' /
      'SEXO..........:' #SEXO '(M/F)' /
      'ENDERECO......:' #ENDERECO /
      'MUNICIPIO.....:' #MUNICIPIO /
      'UF............:' #UF /
      'CEP...........:' #CEP /
      'TELEFONE......:' #TELEFONE /
      'RG............:' #RG /
      'COD PROGRAMA..:' #COD-PROG /
      'RENDA FAMILIAR:' #RENDA-FAM /
      'NUM DEPENDENTES:' #NUM-DEP /
      'COD REGIAO....:' #COD-REG /
      'NIS...........:' #NIS
*
* VALIDACAO BASICA
MOVE FALSE TO #ERRO
*
IF #OPER NE 'I' AND #OPER NE 'A'
  MOVE 'OPERACAO INVALIDA - INFORME I OU A' TO #MSG
  MOVE TRUE TO #ERRO
  ESCAPE BOTTOM
END-IF
*
IF #CPF = 0
  MOVE 'CPF OBRIGATORIO' TO #MSG
  MOVE TRUE TO #ERRO
  ESCAPE BOTTOM
END-IF
*
* VALIDACAO CPF - ALGORITMO MOD 11
PERFORM VALIDA-CPF
* ============================================
* VALIDACAO CPF PELA ROTINA CORPORATIVA
* CHAMADO 6620/2011 - MANTIDA A ROTINA INTERNA
* ACIMA ATE PARECER DA COORD. DE BENEFICIOS
* ============================================
MOVE 'C' TO #PV-TIPO-DOC
MOVE EDITED #CPF (EM=99999999999) TO #PV-CPF
RESET #PV-NIS
CALLNAT 'SUBVALCP' #PV-TIPO-DOC #PV-CPF #PV-NIS
                   #PV-COD-RETORNO #PV-MSG
                   #PV-IND-ESPECIAL
IF NOT #CPF-VALIDO
  MOVE 'CPF INVALIDO - DIGITO VERIFICADOR INCORRETO' TO #MSG
  MOVE TRUE TO #ERRO
  ESCAPE BOTTOM
END-IF
*
IF #NOME = ' '
  MOVE 'NOME OBRIGATORIO' TO #MSG
  MOVE TRUE TO #ERRO
  ESCAPE BOTTOM
END-IF
*
IF #DT-NASC = 0
  MOVE 'DATA NASCIMENTO OBRIGATORIA' TO #MSG
  MOVE TRUE TO #ERRO
  ESCAPE BOTTOM
END-IF
*
IF #SEXO NE 'M' AND #SEXO NE 'F'
  MOVE 'SEXO INVALIDO' TO #MSG
  MOVE TRUE TO #ERRO
  ESCAPE BOTTOM
END-IF
*
* ============================================
* VALIDACAO NIS/PIS - CHAMADO 6621/2011
* MODO AVISO - NAO BLOQUEIA A GRAVACAO ATE
* PARECER DA COORD. DE BENEFICIOS
* ============================================
MOVE 'N' TO #PV-TIPO-DOC
RESET #PV-CPF
MOVE EDITED #NIS (EM=99999999999) TO #PV-NIS
CALLNAT 'SUBVALNI' #PV-TIPO-DOC #PV-CPF #PV-NIS
                   #PV-COD-RETORNO #PV-MSG
                   #PV-IND-ESPECIAL
IF #PV-COD-RETORNO NE 0
  WRITE 'AVISO -' #PV-MSG
END-IF
*
* VERIFICAR SE BENEF JA EXISTE - LEITURA ARQ 150
* CPF E ALFANUMERICO NO ARQ 150 (AB NUM-CPF A11)
MOVE EDITED #CPF (EM=99999999999) TO #CPF-STR
FIND BENEFICIARIO-V WITH NUM-CPF = #CPF-STR
  IF NO RECORDS FOUND
    MOVE FALSE TO #FOUND
  END-NOREC
  MOVE TRUE TO #FOUND
END-FIND
*
IF #OPER = 'I' AND #FOUND
  MOVE 'BENEFICIARIO JA CADASTRADO' TO #MSG
  MOVE TRUE TO #ERRO
  ESCAPE BOTTOM
END-IF
*
IF #OPER = 'A' AND NOT #FOUND
  MOVE 'BENEFICIARIO NAO ENCONTRADO PARA ALTERACAO' TO #MSG
  MOVE TRUE TO #ERRO
  ESCAPE BOTTOM
END-IF
*
* CALC IDADE BENEF
* ============================================
* Y2K - REMEDIACAO 08/1998 - PROJETO BUG2000
* EQUIPE: R.SOUZA - CHAMADO 1998/0442
* ATE 07/1998 A DATA CHEGAVA EM AAMMDD E O ANO
* ERA EXPANDIDO PELA JANELA DE SECULO ABAIXO:
*    MOVE #DT-NASC TO #AA-CURTO
*    IF #AA-CURTO < 50
*      COMPUTE #ANO-NASC = 2000 + #AA-CURTO
*    ELSE
*      COMPUTE #ANO-NASC = 1900 + #AA-CURTO
*    END-IF
* CAMPO CONVERTIDO P/ AAAAMMDD EM 08/1998
* JANELA MANTIDA NA LDASIFAP P/ ARQ HISTORICO
* ============================================
* CHAMADO 6622/2011 - EXTRACAO DO ANO CORRIGIDA
COMPUTE #ANO-NASC = #DT-NASC / 10000
COMPUTE #IDADE = #ANO-ATUAL - #ANO-NASC
*
* DEF STATUS INICIAL
IF #OPER = 'I'
  MOVE 'A' TO #STATUS
END-IF
*
* AJUSTE P/ BENEFICIARIOS ACIMA DE 75 ANOS
IF #IDADE > 75
  MOVE 'S' TO #STATUS
END-IF
*
IF #ERRO
  ESCAPE BOTTOM
END-IF
*
* ============================================
* VALIDACAO CADASTRAL CORPORATIVA - VALBENEF
* CHAMADO 6620/2011 - MODO AVISO ATE PARECER
* DA COORD. DE BENEFICIOS - NAO BLOQUEIA
* ============================================
CALLNAT 'VALBENEF' #CPF-STR #NOME #DT-NASC #SEXO #UF #CEP
                   #STATUS #RESULTADO #QTD-ERROS
                   #MSG-ERRO(*)
IF #RESULTADO = 'I'
  WRITE 'AVISO - VALIDACAO CADASTRAL:' #QTD-ERROS 'ERRO(S)'
END-IF
*
* GRAVACAO / ATUALIZACAO - ARQ 150
DECIDE ON FIRST VALUE OF #OPER
  VALUE 'I'
    MOVE #CPF-STR    TO BENEFICIARIO-V.NUM-CPF
    MOVE #NOME       TO BENEFICIARIO-V.NOME-COMPLETO
    MOVE #DT-NASC    TO BENEFICIARIO-V.DT-NASCIMENTO
    MOVE #SEXO       TO BENEFICIARIO-V.SEXO
* CHAMADO 4471/2003 - ENDERECO A80 GRAVADO EM
* LOGRADOURO A60 - CAUDA DE 20 BYTES E PERDIDA
    MOVE #ENDERECO   TO BENEFICIARIO-V.LOGRADOURO
    MOVE #MUNICIPIO  TO BENEFICIARIO-V.MUNICIPIO
    MOVE #UF         TO BENEFICIARIO-V.UF
    MOVE #CEP        TO BENEFICIARIO-V.CEP
    MOVE #TELEFONE   TO BENEFICIARIO-V.TEL-CELULAR
    MOVE #RG         TO BENEFICIARIO-V.RG-NUMERO
    MOVE #STATUS     TO BENEFICIARIO-V.SIT-BENEFICIARIO
    MOVE EDITED #COD-PROG (EM=9999)
                     TO BENEFICIARIO-V.COD-PROGRAMA
    MOVE #RENDA-FAM  TO BENEFICIARIO-V.VLR-RENDA-FAMILIAR
    MOVE #NUM-DEP    TO BENEFICIARIO-V.QTD-DEPENDENTES
    MOVE #DT-HOJE    TO BENEFICIARIO-V.DT-CADASTRO
    MOVE #DT-HOJE    TO BENEFICIARIO-V.DT-ULT-ALTERACAO
    MOVE EDITED #COD-REG (EM=99)
                     TO BENEFICIARIO-V.COD-REGIAO
    MOVE #NIS        TO BENEFICIARIO-V.NUM-NIS
    STORE BENEFICIARIO-V
* TRILHA DE AUDITORIA - CHAMADO 5510/2012
    MOVE 'IN'                  TO #AUD-ACAO
    MOVE 'BENF'                TO #AUD-ENTIDADE
    MOVE #CPF-STR              TO #AUD-ID
    MOVE #CPF-STR              TO #AUD-CPF
    MOVE 'INCLUSAO CADASTRAL'  TO #AUD-DESCRICAO
    PERFORM GRAVA-AUDITORIA
    END TRANSACTION
    WRITE 'BENEFICIARIO INCLUIDO COM SUCESSO'
  VALUE 'A'
    FIND BENEFICIARIO-V WITH NUM-CPF = #CPF-STR
      MOVE #NOME       TO BENEFICIARIO-V.NOME-COMPLETO
      MOVE #ENDERECO   TO BENEFICIARIO-V.LOGRADOURO
      MOVE #MUNICIPIO  TO BENEFICIARIO-V.MUNICIPIO
      MOVE #UF         TO BENEFICIARIO-V.UF
      MOVE #CEP        TO BENEFICIARIO-V.CEP
      MOVE #TELEFONE   TO BENEFICIARIO-V.TEL-CELULAR
      MOVE #RG         TO BENEFICIARIO-V.RG-NUMERO
      MOVE #STATUS     TO BENEFICIARIO-V.SIT-BENEFICIARIO
      MOVE #RENDA-FAM  TO BENEFICIARIO-V.VLR-RENDA-FAMILIAR
      MOVE #NUM-DEP    TO BENEFICIARIO-V.QTD-DEPENDENTES
      MOVE #DT-HOJE    TO BENEFICIARIO-V.DT-ULT-ALTERACAO
      UPDATE BENEFICIARIO-V
* TRILHA DE AUDITORIA - CHAMADO 5510/2012
      MOVE 'AL'                   TO #AUD-ACAO
      MOVE 'BENF'                 TO #AUD-ENTIDADE
      MOVE #CPF-STR               TO #AUD-ID
      MOVE #CPF-STR               TO #AUD-CPF
      MOVE 'ALTERACAO CADASTRAL'  TO #AUD-DESCRICAO
      PERFORM GRAVA-AUDITORIA
      END TRANSACTION
    END-FIND
    WRITE 'BENEFICIARIO ALTERADO COM SUCESSO'
  NONE
    WRITE 'OPERACAO INVALIDA'
END-DECIDE
*
* SAIDA NORMAL - CHAMADO 6622/2011
ESCAPE BOTTOM
END-REPEAT
*
IF #ERRO
  WRITE #MSG
END-IF
*
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
* SUBROTINA: VALIDACAO CPF - MODULO 11
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
DEFINE SUBROUTINE VALIDA-CPF
  MOVE TRUE TO #CPF-VALIDO
  MOVE #CPF TO #CPF-STR
*
* EXTRAIR DIGITOS
  FOR #I = 1 TO 11
    MOVE SUBSTR(#CPF-STR,#I,1) TO #DIG(#I)
  END-FOR
*
* PRIMEIRO DIGITO VERIFICADOR
  MOVE 0 TO #SOMA
  MOVE 10 TO #PESO
  FOR #I = 1 TO 9
    COMPUTE #SOMA = #SOMA + (#DIG(#I) * #PESO)
    SUBTRACT 1 FROM #PESO
  END-FOR
  COMPUTE #RESTO = #SOMA - ((#SOMA / 11) * 11)
  IF #RESTO < 2
    MOVE 0 TO #DV1
  ELSE
    COMPUTE #DV1 = 11 - #RESTO
  END-IF
*
  IF #DV1 NE #DIG(10)
    MOVE FALSE TO #CPF-VALIDO
    ESCAPE ROUTINE
  END-IF
*
* SEGUNDO DIGITO VERIFICADOR
  MOVE 0 TO #SOMA
  MOVE 11 TO #PESO
  FOR #I = 1 TO 10
    COMPUTE #SOMA = #SOMA + (#DIG(#I) * #PESO)
    SUBTRACT 1 FROM #PESO
  END-FOR
  COMPUTE #RESTO = #SOMA - ((#SOMA / 11) * 11)
  IF #RESTO < 2
    MOVE 0 TO #DV2
  ELSE
    COMPUTE #DV2 = 11 - #RESTO
  END-IF
*
  IF #DV2 NE #DIG(11)
    MOVE FALSE TO #CPF-VALIDO
  END-IF
END-SUBROUTINE
*
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
* TRILHA DE AUDITORIA - IN-TCU 63/2010 - CHAMADO 5510
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
INCLUDE CCAUDIT
*
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
* TRATAMENTO DE ERRO NATURAL - CHAMADO 5511/2012
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
ON ERROR
  WRITE 'ERRO NATURAL' *ERROR-NR 'LINHA' *ERROR-LINE
  WRITE 'PGM' *PROGRAM 'LIB' *LIBRARY-ID
  BACKOUT TRANSACTION
  TERMINATE 12
END-ERROR
*
END
