* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
* PROGRAMA: CADDEPEND
* SISTEMA:  SIFAP - SIST. FISC. ADM. PAGAMENTOS
* AUTOR:    ANA LUCIA PEREIRA
* DATA:     20/06/1998
* ALTERADO: 14/03/2008 - ROBERTO MENDES - AJUSTE PE GROUP
* ALTERADO: 07/06/2011 - ROBERTO MENDES - INC VALID CPF DEP
* ALTERADO: 12/09/2012 - ANDERSON LIMA  - INC TRILHA AUDIT
* OBJETIVO: CADASTRO DE DEPENDENTES DO BENEFICIARIO
*           VINCULACAO AO BENEF TITULAR - ARQ 150
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
DEFINE DATA
LOCAL USING LDASIFAP
LOCAL
  1 BENEFICIARIO-V VIEW OF BENEFICIARIO
    2 NUM-CPF            (A11)
    2 NOME-COMPLETO      (A60)
    2 SIT-BENEFICIARIO   (A1)
    2 QTD-DEPENDENTES    (N2)
    2 GRP-DEPENDENTE     (1:10)
      3 NOME-DEPENDENTE  (A60)
      3 DT-NASC-DEPEND   (N8)
      3 PARENTESCO       (A2)  /* FI=FILHO CO=CONJUGE IR=IRMAO
      3 CPF-DEPENDENTE   (A11)
      3 SIT-DEPENDENTE   (A1)
      3 IND-DEFICIENCIA  (A1)
*
* TRILHA DE AUDITORIA - ARQ 153 - IN-TCU 63/2010
  1 AUDITORIA-V VIEW OF AUDITORIA
    2 NUM-AUDITORIA      (N15)
    2 DT-EVENTO          (N8)
    2 HR-EVENTO          (N6)
    2 TS-EVENTO          (N14)
    2 COD-ACAO           (A2)
    2 COD-MODULO         (A8)
    2 DES-ACAO           (A80)
    2 TIPO-ENTIDADE      (A4)
    2 ID-ENTIDADE        (A15)
    2 NUM-CPF-AFETADO    (A11)
    2 USR-EVENTO         (A8)
    2 NOM-JOB-BATCH      (A16)
    2 SIT-BATCH          (A1)
*
  1 #CPF-TITULAR         (N11)
  1 #CPF-TIT-STR         (A11)
  1 #NOME-DEP            (A60)
  1 #DT-NASC-DEP         (N8)
  1 #PARENTESCO          (A2)
  1 #CPF-DEP             (N11)
  1 #CPF-DEP-STR         (A11)
  1 #DOC-DEP             (A15)
  1 #SEXO-DEP            (A1)
  1 #NUM-DEP             (N2)
  1 #SIT-BENEF           (A1)
  1 #MSG                 (A60)
  1 #FOUND               (L)
  1 #ERRO                (L)
  1 #IDX                 (N2)
  1 #CONT                (A1)
*
* CAMPOS EXIGIDOS PELO COPYCODE CCVALCPF
  1 #CPF-STR             (A11)
  1 #CPF-OK              (L)
  1 #CPF-DIG             (N1/1:11)
  1 #CPF-SOMA            (N5)
  1 #CPF-QUOC            (N5)
  1 #CPF-RESTO           (N2)
  1 #CPF-DV1             (N1)
  1 #CPF-DV2             (N1)
  1 #CPF-PESO            (N2)
  1 #CPF-IDX             (N2)
  1 #CPF-IGUAIS          (L)
*
* CAMPOS DA TRILHA DE AUDITORIA - CCAUDIT
  1 #AUD-ACAO            (A2)
  1 #AUD-ENTIDADE        (A4)
  1 #AUD-ID              (A15)
  1 #AUD-CPF             (A11)
  1 #AUD-DESCRICAO       (A80)
  1 #AUD-SEQ             (N15)
  1 #AUD-TIMN            (N7)
END-DEFINE
*
* CONTROLE DE FLUXO - CHAMADO 6622/2011
* REPEAT EXTERNO P/ VIABILIZAR A SAIDA ANTECIPADA
* (ESCAPE BOTTOM) SEM REESCREVER AS REGRAS
REPEAT
*
INPUT 'SIFAP - CADASTRO DE DEPENDENTES' /
      '================================' /
      'CPF TITULAR...:' #CPF-TITULAR
*
* LEITURA ARQ 150 - BUSCA BENEFICIARIO
* CPF E ALFANUMERICO NO ARQ 150 (AB NUM-CPF A11)
MOVE EDITED #CPF-TITULAR (EM=99999999999) TO #CPF-TIT-STR
FIND BENEFICIARIO-V WITH NUM-CPF = #CPF-TIT-STR
  IF NO RECORDS FOUND
    MOVE FALSE TO #FOUND
  END-NOREC
  MOVE TRUE TO #FOUND
  MOVE BENEFICIARIO-V.QTD-DEPENDENTES  TO #NUM-DEP
  MOVE BENEFICIARIO-V.SIT-BENEFICIARIO TO #SIT-BENEF
END-FIND
*
IF NOT #FOUND
  WRITE 'BENEFICIARIO NAO ENCONTRADO'
  ESCAPE BOTTOM
END-IF
*
IF #SIT-BENEF = 'C' OR #SIT-BENEF = 'D'
  WRITE 'BENEFICIARIO CANCELADO/DESLIGADO - NAO PERMITE INCLUSAO'
  ESCAPE BOTTOM
END-IF
*
* LOOP DE INCLUSAO DE DEPENDENTES
REPEAT
  IF #NUM-DEP > 5
    WRITE 'LIMITE DE DEPENDENTES ATINGIDO'
    ESCAPE BOTTOM
  END-IF
*
  INPUT 'DADOS DO DEPENDENTE' /
        '===================' /
        'NOME..........:' #NOME-DEP /
        'DT NASCIMENTO.:' #DT-NASC-DEP /
        'PARENTESCO....:' #PARENTESCO '(FI/CO/IR/OU)' /
        'CPF DEPENDENTE:' #CPF-DEP /
        'DOCUMENTO.....:' #DOC-DEP /
        'SEXO..........:' #SEXO-DEP
*
* ============================================
* Y2K - REMEDIACAO 08/1998 - PROJETO BUG2000
* EQUIPE: R.SOUZA - CHAMADO 1998/0442
* DT-NASC-DEP CHEGAVA EM AAMMDD ATE 07/1998.
* A EXPANSAO USAVA A JANELA DE SECULO (PIVO 50)
* HOJE EM #L-SEC-JANELA NA LDASIFAP:
*    IF #L-AA-CURTO < #L-SEC-JANELA
*      COMPUTE #L-ANO-EXPANDIDO = 2000 + #L-AA-CURTO
*    ELSE
*      COMPUTE #L-ANO-EXPANDIDO = 1900 + #L-AA-CURTO
*    END-IF
* TELA CONVERTIDA P/ AAAAMMDD EM 08/1998
* ============================================
*
  MOVE FALSE TO #ERRO
*
  IF #NOME-DEP = ' '
    WRITE 'NOME DO DEPENDENTE OBRIGATORIO'
    MOVE TRUE TO #ERRO
  END-IF
*
  IF #PARENTESCO NE 'FI' AND #PARENTESCO NE 'CO'
      AND #PARENTESCO NE 'IR' AND #PARENTESCO NE 'OU'
    WRITE 'PARENTESCO INVALIDO'
    MOVE TRUE TO #ERRO
  END-IF
*
  IF #ERRO
    ESCAPE TOP
  END-IF
*
* ============================================
* VALIDACAO CPF DEPENDENTE - CHAMADO 6620/2011
* MODO AVISO - NAO BLOQUEIA A INCLUSAO ATE
* PARECER DA COORD. DE BENEFICIOS
* ============================================
  MOVE EDITED #CPF-DEP (EM=99999999999) TO #CPF-STR
  PERFORM VALIDA-CPF-PADRAO
  IF NOT #CPF-OK
    MOVE 'CPF DEPENDENTE INVALIDO' TO #MSG
  END-IF
*
* VERIF DEPENDENTE DUPLICADO
  MOVE EDITED #CPF-DEP (EM=99999999999) TO #CPF-DEP-STR
  FIND BENEFICIARIO-V WITH NUM-CPF = #CPF-TIT-STR
    FOR #IDX = 1 TO BENEFICIARIO-V.QTD-DEPENDENTES
      IF BENEFICIARIO-V.CPF-DEPENDENTE(#IDX) = #CPF-DEP-STR
          AND #CPF-DEP NE 0
        WRITE 'DEPENDENTE JA CADASTRADO (CPF DUPLICADO)'
        MOVE TRUE TO #ERRO
        ESCAPE BOTTOM
      END-IF
    END-FOR
  END-FIND
*
  IF #ERRO
    ESCAPE TOP
  END-IF
*
* INCLUSAO NO PE GROUP
  FIND BENEFICIARIO-V WITH NUM-CPF = #CPF-TIT-STR
    ADD 1 TO #NUM-DEP
    MOVE #NUM-DEP TO #IDX
    MOVE #NOME-DEP    TO BENEFICIARIO-V.NOME-DEPENDENTE(#IDX)
    MOVE #DT-NASC-DEP TO BENEFICIARIO-V.DT-NASC-DEPEND(#IDX)
    MOVE #PARENTESCO   TO BENEFICIARIO-V.PARENTESCO(#IDX)
    MOVE #CPF-DEP-STR  TO BENEFICIARIO-V.CPF-DEPENDENTE(#IDX)
* CHAMADO 4471/2003 - DOC-DEP E SEXO-DEP NAO EXISTEM
* NO ARQ 150. CAMPOS SEGUEM NA TELA, SEM GRAVACAO.
*   MOVE #DOC-DEP      TO BENEFICIARIO-V.DOC-DEP(#IDX)
*   MOVE #SEXO-DEP     TO BENEFICIARIO-V.SEXO-DEP(#IDX)
    MOVE #NUM-DEP      TO BENEFICIARIO-V.QTD-DEPENDENTES
    UPDATE BENEFICIARIO-V
* TRILHA DE AUDITORIA - CHAMADO 5510/2012
    MOVE 'AL'                    TO #AUD-ACAO
    MOVE 'BENF'                  TO #AUD-ENTIDADE
    MOVE #CPF-TIT-STR            TO #AUD-ID
    MOVE #CPF-TIT-STR            TO #AUD-CPF
    MOVE 'INCLUSAO DE DEPENDENTE' TO #AUD-DESCRICAO
    PERFORM GRAVA-AUDITORIA
    END TRANSACTION
  END-FIND
  WRITE 'DEPENDENTE INCLUIDO - TOTAL:' #NUM-DEP
*
  INPUT 'INCLUIR OUTRO DEPENDENTE? (S/N):' #CONT
  IF #CONT NE 'S'
    ESCAPE BOTTOM
  END-IF
END-REPEAT
*
WRITE 'PROCESSAMENTO FINALIZADO'
*
* SAIDA NORMAL - CHAMADO 6622/2011
ESCAPE BOTTOM
END-REPEAT
*
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
* VALIDACAO DE CPF - ROTINA NORMATIVA NT-SUPDE-014
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
INCLUDE CCVALCPF
*
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
* TRILHA DE AUDITORIA - IN-TCU 63/2010 - CHAMADO 5510
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
INCLUDE CCAUDIT
*
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
* TRATAMENTO DE ERRO NATURAL - CHAMADO 5511/2012
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
ON ERROR
  WRITE 'ERRO NATURAL' *ERROR-NR 'LINHA' *ERROR-LINE
  WRITE 'PGM' *PROGRAM 'LIB' *LIBRARY-ID
  BACKOUT TRANSACTION
  TERMINATE 12
END-ERROR
*
END
