* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
* PROGRAM:  CADDEPEND
* SYSTEM:   SIFAP - PAYMENT INSPECTION AND ADMINISTRATION SYSTEM
* AUTHOR:   ANA LUCIA PEREIRA
* DATE:     20/06/1998
* CHANGED:  14/03/2008 - ROBERTO MENDES - ADJUSTED PE GROUP
* CHANGED:  07/06/2011 - ROBERTO MENDES - ADDED DEPENDENT CPF VALIDATION
* CHANGED:  12/09/2012 - ANDERSON LIMA  - ADDED AUDIT TRAIL
* PURPOSE:  BENEFICIARY DEPENDENT REGISTRATION
*           LINK TO PRIMARY BENEFICIARY - FILE 150
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
DEFINE DATA
LOCAL USING LDASIFAP
LOCAL
  1 BENEFICIARIO-V VIEW OF BENEFICIARIO
    2 NUM-CPF            (A11)
    2 NOME-COMPLETO      (A60)
    2 SIT-BENEFICIARIO   (A1)
    2 QTD-DEPENDENTES    (N2)
    2 GRP-DEPENDENTE     (1:10)
      3 NOME-DEPENDENTE  (A60)
      3 DT-NASC-DEPEND   (N8)
      3 PARENTESCO       (A2)  /* FI=CHILD CO=SPOUSE IR=SIBLING
      3 CPF-DEPENDENTE   (A11)
      3 SIT-DEPENDENTE   (A1)
      3 IND-DEFICIENCIA  (A1)
*
* AUDIT TRAIL - FILE 153 - IN-TCU 63/2010
  1 AUDITORIA-V VIEW OF AUDITORIA
    2 NUM-AUDITORIA      (N15)
    2 DT-EVENTO          (N8)
    2 HR-EVENTO          (N6)
    2 TS-EVENTO          (N14)
    2 COD-ACAO           (A2)
    2 COD-MODULO         (A8)
    2 DES-ACAO           (A80)
    2 TIPO-ENTIDADE      (A4)
    2 ID-ENTIDADE        (A15)
    2 NUM-CPF-AFETADO    (A11)
    2 USR-EVENTO         (A8)
    2 NOM-JOB-BATCH      (A16)
    2 SIT-BATCH          (A1)
*
  1 #CPF-TITULAR         (N11)
  1 #CPF-TIT-STR         (A11)
  1 #NOME-DEP            (A60)
  1 #DT-NASC-DEP         (N8)
  1 #PARENTESCO          (A2)
  1 #CPF-DEP             (N11)
  1 #CPF-DEP-STR         (A11)
  1 #DOC-DEP             (A15)
  1 #SEXO-DEP            (A1)
  1 #NUM-DEP             (N2)
  1 #SIT-BENEF           (A1)
  1 #MSG                 (A60)
  1 #FOUND               (L)
  1 #ERRO                (L)
  1 #IDX                 (N2)
  1 #CONT                (A1)
*
* FIELDS REQUIRED BY COPYCODE CCVALCPF
  1 #CPF-STR             (A11)
  1 #CPF-OK              (L)
  1 #CPF-DIG             (N1/1:11)
  1 #CPF-SOMA            (N5)
  1 #CPF-QUOC            (N5)
  1 #CPF-RESTO           (N2)
  1 #CPF-DV1             (N1)
  1 #CPF-DV2             (N1)
  1 #CPF-PESO            (N2)
  1 #CPF-IDX             (N2)
  1 #CPF-IGUAIS          (L)
*
* AUDIT TRAIL FIELDS - CCAUDIT
  1 #AUD-ACAO            (A2)
  1 #AUD-ENTIDADE        (A4)
  1 #AUD-ID              (A15)
  1 #AUD-CPF             (A11)
  1 #AUD-DESCRICAO       (A80)
  1 #AUD-SEQ             (N15)
  1 #AUD-TIMN            (N7)
END-DEFINE
*
* FLOW CONTROL - TICKET 6622/2011
* OUTER REPEAT ENABLES EARLY EXIT
* (ESCAPE BOTTOM) WITHOUT REWRITING THE RULES
REPEAT
*
INPUT 'SIFAP - DEPENDENT REGISTRATION' /
      '===============================' /
      'PRIMARY CPF...:' #CPF-TITULAR
*
* READ FILE 150 - FIND BENEFICIARY
* CPF IS ALPHANUMERIC IN FILE 150 (AB NUM-CPF A11)
MOVE EDITED #CPF-TITULAR (EM=99999999999) TO #CPF-TIT-STR
FIND BENEFICIARIO-V WITH NUM-CPF = #CPF-TIT-STR
  IF NO RECORDS FOUND
    MOVE FALSE TO #FOUND
  END-NOREC
  MOVE TRUE TO #FOUND
  MOVE BENEFICIARIO-V.QTD-DEPENDENTES  TO #NUM-DEP
  MOVE BENEFICIARIO-V.SIT-BENEFICIARIO TO #SIT-BENEF
END-FIND
*
IF NOT #FOUND
  WRITE 'BENEFICIARY NOT FOUND'
  ESCAPE BOTTOM
END-IF
*
IF #SIT-BENEF = 'C' OR #SIT-BENEF = 'D'
  WRITE 'CANCELED/TERMINATED BENEFICIARY - ADDITION NOT ALLOWED'
  ESCAPE BOTTOM
END-IF
*
* DEPENDENT ADDITION LOOP
REPEAT
  IF #NUM-DEP > 5
    WRITE 'DEPENDENT LIMIT REACHED'
    ESCAPE BOTTOM
  END-IF
*
  INPUT 'DEPENDENT INFORMATION' /
        '=====================' /
        'NAME..........:' #NOME-DEP /
        'BIRTH DATE....:' #DT-NASC-DEP /
        'RELATIONSHIP..:' #PARENTESCO '(FI/CO/IR/OU)' /
        'DEPENDENT CPF.:' #CPF-DEP /
        'DOCUMENT......:' #DOC-DEP /
        'SEX...........:' #SEXO-DEP
*
* ============================================
* Y2K - REMEDIATION 08/1998 - BUG2000 PROJECT
* TEAM: R.SOUZA - TICKET 1998/0442
* DT-NASC-DEP ARRIVED AS YYMMDD UNTIL 07/1998.
* EXPANSION USED THE CENTURY WINDOW (PIVOT 50)
* NOW IN #L-SEC-JANELA IN LDASIFAP:
*    IF #L-AA-CURTO < #L-SEC-JANELA
*      COMPUTE #L-ANO-EXPANDIDO = 2000 + #L-AA-CURTO
*    ELSE
*      COMPUTE #L-ANO-EXPANDIDO = 1900 + #L-AA-CURTO
*    END-IF
* SCREEN CONVERTED TO YYYYMMDD IN 08/1998
* ============================================
*
  MOVE FALSE TO #ERRO
*
  IF #NOME-DEP = ' '
    WRITE 'DEPENDENT NAME IS REQUIRED'
    MOVE TRUE TO #ERRO
  END-IF
*
  IF #PARENTESCO NE 'FI' AND #PARENTESCO NE 'CO'
      AND #PARENTESCO NE 'IR' AND #PARENTESCO NE 'OU'
    WRITE 'INVALID RELATIONSHIP'
    MOVE TRUE TO #ERRO
  END-IF
*
  IF #ERRO
    ESCAPE TOP
  END-IF
*
* ============================================
* DEPENDENT CPF VALIDATION - TICKET 6620/2011
* WARNING MODE - DOES NOT BLOCK ADDITION PENDING
* BENEFITS DEPARTMENT REVIEW
* ============================================
  MOVE EDITED #CPF-DEP (EM=99999999999) TO #CPF-STR
  PERFORM VALIDA-CPF-PADRAO
  IF NOT #CPF-OK
    MOVE 'INVALID DEPENDENT CPF' TO #MSG
  END-IF
*
* CHECK FOR DUPLICATE DEPENDENT
  MOVE EDITED #CPF-DEP (EM=99999999999) TO #CPF-DEP-STR
  FIND BENEFICIARIO-V WITH NUM-CPF = #CPF-TIT-STR
    FOR #IDX = 1 TO BENEFICIARIO-V.QTD-DEPENDENTES
      IF BENEFICIARIO-V.CPF-DEPENDENTE(#IDX) = #CPF-DEP-STR
          AND #CPF-DEP NE 0
        WRITE 'DEPENDENT ALREADY REGISTERED (DUPLICATE CPF)'
        MOVE TRUE TO #ERRO
        ESCAPE BOTTOM
      END-IF
    END-FOR
  END-FIND
*
  IF #ERRO
    ESCAPE TOP
  END-IF
*
* ADD TO PE GROUP
  FIND BENEFICIARIO-V WITH NUM-CPF = #CPF-TIT-STR
    ADD 1 TO #NUM-DEP
    MOVE #NUM-DEP TO #IDX
    MOVE #NOME-DEP    TO BENEFICIARIO-V.NOME-DEPENDENTE(#IDX)
    MOVE #DT-NASC-DEP TO BENEFICIARIO-V.DT-NASC-DEPEND(#IDX)
    MOVE #PARENTESCO   TO BENEFICIARIO-V.PARENTESCO(#IDX)
    MOVE #CPF-DEP-STR  TO BENEFICIARIO-V.CPF-DEPENDENTE(#IDX)
* TICKET 4471/2003 - DOC-DEP AND SEXO-DEP DO NOT EXIST
* IN FILE 150. FIELDS REMAIN ON SCREEN BUT ARE NOT SAVED.
*   MOVE #DOC-DEP      TO BENEFICIARIO-V.DOC-DEP(#IDX)
*   MOVE #SEXO-DEP     TO BENEFICIARIO-V.SEXO-DEP(#IDX)
    MOVE #NUM-DEP      TO BENEFICIARIO-V.QTD-DEPENDENTES
    UPDATE BENEFICIARIO-V
* AUDIT TRAIL - TICKET 5510/2012
    MOVE 'AL'                    TO #AUD-ACAO
    MOVE 'BENF'                  TO #AUD-ENTIDADE
    MOVE #CPF-TIT-STR            TO #AUD-ID
    MOVE #CPF-TIT-STR            TO #AUD-CPF
    MOVE 'DEPENDENT ADDED'         TO #AUD-DESCRICAO
    PERFORM GRAVA-AUDITORIA
    END TRANSACTION
  END-FIND
  WRITE 'DEPENDENT ADDED - TOTAL:' #NUM-DEP
*
  INPUT 'ADD ANOTHER DEPENDENT? (S/N):' #CONT
  IF #CONT NE 'S'
    ESCAPE BOTTOM
  END-IF
END-REPEAT
*
WRITE 'PROCESSING COMPLETED'
*
* NORMAL EXIT - TICKET 6622/2011
ESCAPE BOTTOM
END-REPEAT
*
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
* CPF VALIDATION - STANDARD ROUTINE NT-SUPDE-014
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
INCLUDE CCVALCPF
*
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
* AUDIT TRAIL - IN-TCU 63/2010 - TICKET 5510
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
INCLUDE CCAUDIT
*
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
* NATURAL ERROR HANDLING - TICKET 5511/2012
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
ON ERROR
  WRITE 'NATURAL ERROR' *ERROR-NR 'LINE' *ERROR-LINE
  WRITE 'PGM' *PROGRAM 'LIB' *LIBRARY-ID
  BACKOUT TRANSACTION
  TERMINATE 12
END-ERROR
*
END
