* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
* PROGRAMA: CADPROG
* SISTEMA:  SIFAP - SIST. FISC. ADM. PAGAMENTOS
* AUTOR:    MARCOS ANTONIO RIBEIRO
* DATA:     10/09/1997
* ALTERADO: 05/07/2003 - MARCOS RIBEIRO - INC FATOR CORRECAO
* ALTERADO: 12/09/2012 - ANDERSON LIMA  - INC TRILHA AUDIT
* ALTERADO: 18/11/2012 - FERNANDA COSTA - NOVOS COD ELEG
* OBJETIVO: CADASTRO PROGRAMAS SOCIAIS - INCLUSAO/CONSULTA
*           MANUTENCAO TABELA PROGRAMAS ARQ 155
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
DEFINE DATA
LOCAL USING LDASIFAP
LOCAL
  1 PROGRAMA-V VIEW OF PROGRAMA-SOCIAL
    2 COD-PROGRAMA         (A4)
    2 NOME-PROGRAMA        (A60)
    2 TIPO-PROGRAMA        (A1)  /* A=ASSIST P=PREVID T=TRAB
    2 VLR-BASE-INDIVIDUAL  (P7,2)
    2 COD-ELEGIBILIDADE    (A5)
    2 DT-CRIACAO           (N8)
    2 DT-ENCERRAMENTO      (N8)
    2 SIT-PROGRAMA         (A1)
    2 RENDA-MAX-PERCAP     (P7,2)
    2 IDADE-MIN            (N3)
    2 IDADE-MAX            (N3)
    2 FATOR-REAJUSTE       (P3,4)
*
* TRILHA DE AUDITORIA - ARQ 153 - IN-TCU 63/2010
  1 AUDITORIA-V VIEW OF AUDITORIA
    2 NUM-AUDITORIA        (N15)
    2 DT-EVENTO            (N8)
    2 HR-EVENTO            (N6)
    2 TS-EVENTO            (N14)
    2 COD-ACAO             (A2)
    2 COD-MODULO           (A8)
    2 DES-ACAO             (A80)
    2 TIPO-ENTIDADE        (A4)
    2 ID-ENTIDADE          (A15)
    2 NUM-CPF-AFETADO      (A11)
    2 USR-EVENTO           (A8)
    2 NOM-JOB-BATCH        (A16)
    2 SIT-BATCH            (A1)
*
  1 #COD-PROG            (N4)
  1 #COD-PROG-A          (A4)
  1 #NOME-PROG           (A60)
  1 #TIPO                (A1)
  1 #VLR-BASE            (P9,2)
  1 #COD-ELEG            (A5)
  1 #DT-INICIO           (N8)
  1 #DT-FIM              (N8)
  1 #STATUS              (A1)
  1 #RENDA-MAX           (P9,2)
  1 #IDADE-MIN           (N3)
  1 #IDADE-MAX           (N3)
  1 #FATOR-REAJ          (N3,4)
  1 #FATOR-K             (N5,6)
  1 #OPER                (A1)
  1 #MSG                 (A60)
  1 #FOUND               (L)
  1 #VLR-CALC            (P9,2)
*
* CAMPOS DA TRILHA DE AUDITORIA - CCAUDIT
  1 #AUD-ACAO            (A2)
  1 #AUD-ENTIDADE        (A4)
  1 #AUD-ID              (A15)
  1 #AUD-CPF             (A11)
  1 #AUD-DESCRICAO       (A80)
  1 #AUD-SEQ             (N15)
  1 #AUD-TIMN            (N7)
END-DEFINE
*
* CONTROLE DE FLUXO - CHAMADO 6622/2011
* REPEAT EXTERNO P/ VIABILIZAR A SAIDA ANTECIPADA
* (ESCAPE BOTTOM) SEM REESCREVER AS REGRAS
REPEAT
*
INPUT 'SIFAP - CADASTRO PROGRAMAS SOCIAIS' /
      '===================================' /
      'OPERACAO (I/C):' #OPER /
      'COD PROGRAMA..:' #COD-PROG
*
IF #OPER NE 'I' AND #OPER NE 'C'
  WRITE 'OPERACAO INVALIDA'
  ESCAPE BOTTOM
END-IF
*
IF #OPER = 'C'
  PERFORM CONSULTA-PROG
  ESCAPE BOTTOM
END-IF
*
* INCLUSAO
INPUT 'DADOS DO PROGRAMA' /
      '==================' /
      'NOME..........:' #NOME-PROG /
      'TIPO..........:' #TIPO '(A/P/T)' /
      'VLR BASE......:' #VLR-BASE /
      'COD ELEGIBIL..:' #COD-ELEG /
      'DT INICIO.....:' #DT-INICIO /
      'DT FIM........:' #DT-FIM '(0=INDETERMINADO)' /
      'RENDA MAXIMA..:' #RENDA-MAX /
      'IDADE MINIMA..:' #IDADE-MIN /
      'IDADE MAXIMA..:' #IDADE-MAX /
      'FATOR REAJUSTE:' #FATOR-REAJ
*
* VERIF PROGRAMA EXISTENTE
* COD-PROGRAMA E ALFANUMERICO NO ARQ 151 (AA A4)
MOVE EDITED #COD-PROG (EM=9999) TO #COD-PROG-A
FIND PROGRAMA-V WITH COD-PROGRAMA = #COD-PROG-A
  IF NO RECORDS FOUND
    MOVE FALSE TO #FOUND
  END-NOREC
  MOVE TRUE TO #FOUND
END-FIND
*
IF #FOUND
  WRITE 'PROGRAMA JA CADASTRADO'
  ESCAPE BOTTOM
END-IF
*
* CALC VLR BASE AJUSTADO C/ FATOR K
COMPUTE #FATOR-K = 1.00 + (#FATOR-REAJ * 0.347215)
COMPUTE #VLR-CALC = #VLR-BASE * #FATOR-K
*
MOVE #COD-PROG-A   TO PROGRAMA-V.COD-PROGRAMA
MOVE #NOME-PROG   TO PROGRAMA-V.NOME-PROGRAMA
MOVE #TIPO         TO PROGRAMA-V.TIPO-PROGRAMA
MOVE #VLR-CALC     TO PROGRAMA-V.VLR-BASE-INDIVIDUAL
MOVE #COD-ELEG     TO PROGRAMA-V.COD-ELEGIBILIDADE
MOVE #DT-INICIO    TO PROGRAMA-V.DT-CRIACAO
MOVE #DT-FIM       TO PROGRAMA-V.DT-ENCERRAMENTO
MOVE 'A'           TO PROGRAMA-V.SIT-PROGRAMA
MOVE #RENDA-MAX    TO PROGRAMA-V.RENDA-MAX-PERCAP
MOVE #IDADE-MIN    TO PROGRAMA-V.IDADE-MIN
MOVE #IDADE-MAX    TO PROGRAMA-V.IDADE-MAX
MOVE #FATOR-REAJ   TO PROGRAMA-V.FATOR-REAJUSTE
STORE PROGRAMA-V
* TRILHA DE AUDITORIA - CHAMADO 5510/2012
MOVE 'IN'                   TO #AUD-ACAO
MOVE 'PROG'                 TO #AUD-ENTIDADE
MOVE #COD-PROG-A            TO #AUD-ID
RESET #AUD-CPF
MOVE 'INCLUSAO PROGRAMA SOCIAL'  TO #AUD-DESCRICAO
PERFORM GRAVA-AUDITORIA
END TRANSACTION
*
WRITE 'PROGRAMA INCLUIDO COM SUCESSO - VLR AJUSTADO:' #VLR-CALC
*
* SAIDA NORMAL - CHAMADO 6622/2011
ESCAPE BOTTOM
END-REPEAT
*
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
DEFINE SUBROUTINE CONSULTA-PROG
  MOVE EDITED #COD-PROG (EM=9999) TO #COD-PROG-A
  FIND PROGRAMA-V WITH COD-PROGRAMA = #COD-PROG-A
    WRITE 'COD PROGRAMA.:' PROGRAMA-V.COD-PROGRAMA /
          'NOME.........:' PROGRAMA-V.NOME-PROGRAMA /
          'TIPO.........:' PROGRAMA-V.TIPO-PROGRAMA /
          'VLR BASE.....:' PROGRAMA-V.VLR-BASE-INDIVIDUAL /
          'ELEGIBILIDADE:' PROGRAMA-V.COD-ELEGIBILIDADE /
          'STATUS.......:' PROGRAMA-V.SIT-PROGRAMA
  END-FIND
* ESTILO ANTIGO DE 1997 - NAO PADRONIZADO P/ NO RECORDS
* FOUND. MANTIDO - CHAMADO 3312/2004 EM ABERTO
  IF *NUMBER(PROGRAMA-V) = 0
    WRITE 'PROGRAMA NAO ENCONTRADO'
  END-IF
END-SUBROUTINE
*
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
* TRILHA DE AUDITORIA - IN-TCU 63/2010 - CHAMADO 5510
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
INCLUDE CCAUDIT
*
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
* TRATAMENTO DE ERRO NATURAL - CHAMADO 5511/2012
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
ON ERROR
  WRITE 'ERRO NATURAL' *ERROR-NR 'LINHA' *ERROR-LINE
  WRITE 'PGM' *PROGRAM 'LIB' *LIBRARY-ID
  BACKOUT TRANSACTION
  TERMINATE 12
END-ERROR
*
END
