* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
* PROGRAM:  CALCDSCT
* SYSTEM:   SIFAP - PAYMENT INSPECTION AND ADMINISTRATION SYSTEM
* AUTHOR:   ROBERTO MENDES JUNIOR
* DATE:     25/08/1999
* CHANGED:  12/04/2007 - MARCIA HELENA - ADDED COURT-ORDERED DISCOUNT
* CHANGED:  30/09/2015 - ANDERSON LIMA - NEW RATES
* CHANGED:  14/06/2016 - SUPDE TEAM - TICKET 7210 DDM STANDARD
* PURPOSE:  CALCULATE BENEFIT DISCOUNTS AND DEDUCTIONS
*           PROCESS MANDATORY DISCOUNT - FILES 160/150
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
DEFINE DATA
LOCAL USING LDASIFAP
LOCAL
  1 PAGAMENTO-V VIEW OF PAGAMENTO
    2 NUM-PAGAMENTO      (N15)
    2 NUM-CPF            (A11)
    2 VLR-BRUTO          (P9,2)
    2 VLR-DESCONTO-TOTAL (P7,2)
    2 ANO-MES-REF        (N6)
    2 GRP-DESCONTO       (1:8)
      3 TIPO-DESCONTO    (A3)    /* C=CONTRIB I=TAX J=COURT-ORDERED
                                    S=UNION P=ALIMONY A=ADMIN */
      3 VLR-DESCONTO     (P7,2)
      3 PCT-DESCONTO     (P3,2)
      3 DT-INICIO-DSCT   (N8)
      3 DT-FIM-DSCT      (N8)
      3 NUM-PROCESSO     (A20)
*
  1 BENEFICIARIO-V VIEW OF BENEFICIARIO
    2 NUM-CPF            (A11)
    2 NOME-COMPLETO      (A60)
    2 SIT-BENEFICIARIO   (A1)
    2 UF                 (A2)
*
  1 #CPF                 (N11)
  1 #CPF-STR             (A11)
  1 #NUM-PGTO            (N15)
  1 #VLR-BRUTO           (P9,2)
  1 #VLR-TOTAL-DSCT      (P9,2)
  1 #VLR-DSCT-ITEM       (P9,2)
  1 #VLR-MAX-DSCT        (P9,2)
  1 #VLR-TEMP            (N11)
  1 #PCT-DSCT            (P3,2)
  1 #TIPO-DSCT           (A1)
  1 #NUM-DSCT            (N2)
  1 #IDX                 (N2)
  1 #DT-HOJE             (N8)
  1 #FOUND               (L)
  1 #COMP                (N6)
  1 #MSG                 (A60)
  1 #K                   (N2)
*
* CONTRIBUTION RATE TABLE
  1 #FAIXA-CONTRIB       (P9,2/1:4)
  1 #ALIQ-CONTRIB        (N3,2/1:4)
END-DEFINE
*
MOVE *DATN TO #DT-HOJE
*
* LOAD SOCIAL CONTRIBUTION TABLE
MOVE  500.00 TO #FAIXA-CONTRIB(1)
MOVE  0.03   TO #ALIQ-CONTRIB(1)
MOVE 1000.00 TO #FAIXA-CONTRIB(2)
MOVE  0.05   TO #ALIQ-CONTRIB(2)
MOVE 2000.00 TO #FAIXA-CONTRIB(3)
MOVE  0.07   TO #ALIQ-CONTRIB(3)
MOVE 9999.99 TO #FAIXA-CONTRIB(4)
MOVE  0.09   TO #ALIQ-CONTRIB(4)
*
INPUT 'SIFAP - DISCOUNT CALCULATION' /
      '============================' /
      'BENEFICIARY CPF.:' #CPF /
      'PAYMENT NUMBER..:' #NUM-PGTO
*
* FIND PAYMENT - FILE 160
MOVE EDITED #CPF (EM=99999999999) TO #CPF-STR
MOVE FALSE TO #FOUND
FIND PAGAMENTO-V WITH NUM-PAGAMENTO = #NUM-PGTO
  IF PAGAMENTO-V.NUM-CPF = #CPF-STR
    MOVE TRUE TO #FOUND
    MOVE PAGAMENTO-V.VLR-BRUTO TO #VLR-BRUTO
    MOVE PAGAMENTO-V.ANO-MES-REF TO #COMP
  END-IF
END-FIND
*
IF NOT #FOUND
  WRITE 'PAYMENT NOT FOUND'
  ESCAPE ROUTINE
END-IF
*
* FIND BENEFICIARY - FILE 150
FIND BENEFICIARIO-V WITH NUM-CPF = #CPF-STR
  IGNORE
END-FIND
IF *NUMBER(BENEFICIARIO-V) = 0
  WRITE 'BENEFICIARY NOT FOUND'
  ESCAPE ROUTINE
END-IF
*
MOVE 0 TO #VLR-TOTAL-DSCT
*
* CALCULATE SOCIAL CONTRIBUTION DISCOUNT (MANDATORY)
PERFORM CALC-CONTRIB-SOCIAL
*
* CALCULATE MAXIMUM DISCOUNT CAP - 30% OF GROSS
COMPUTE #VLR-MAX-DSCT = #VLR-BRUTO * 0.30
* TRUNCATE
COMPUTE #VLR-TEMP = #VLR-MAX-DSCT * 100
COMPUTE #VLR-MAX-DSCT = #VLR-TEMP / 100
*
* PROCESS DISCOUNTS REGISTERED IN THE PE GROUP
FIND PAGAMENTO-V WITH NUM-PAGAMENTO = #NUM-PGTO
  FOR #IDX = 1 TO C*GRP-DESCONTO
*
* CHECK DISCOUNT EFFECTIVE PERIOD
    IF PAGAMENTO-V.DT-FIM-DSCT(#IDX) NE 0
        AND PAGAMENTO-V.DT-FIM-DSCT(#IDX) < #DT-HOJE
      ESCAPE TOP
    END-IF
    IF PAGAMENTO-V.DT-INICIO-DSCT(#IDX) > #DT-HOJE
      ESCAPE TOP
    END-IF
*
    MOVE PAGAMENTO-V.TIPO-DESCONTO(#IDX) TO #TIPO-DSCT
*
    DECIDE ON FIRST VALUE OF #TIPO-DSCT
      VALUE 'J'
* COURT-ORDERED DISCOUNT - FIXED AMOUNT OR PERCENTAGE
        IF PAGAMENTO-V.VLR-DESCONTO(#IDX) > 0
          MOVE PAGAMENTO-V.VLR-DESCONTO(#IDX) TO #VLR-DSCT-ITEM
        ELSE
          COMPUTE #VLR-DSCT-ITEM = #VLR-BRUTO *
              (PAGAMENTO-V.PCT-DESCONTO(#IDX) / 100)
        END-IF
* COURT-ORDERED DISCOUNT HAS NO CAP
        ADD #VLR-DSCT-ITEM TO #VLR-TOTAL-DSCT
      VALUE 'P'
* ALIMONY
        IF PAGAMENTO-V.VLR-DESCONTO(#IDX) > 0
          MOVE PAGAMENTO-V.VLR-DESCONTO(#IDX) TO #VLR-DSCT-ITEM
        ELSE
          COMPUTE #VLR-DSCT-ITEM = #VLR-BRUTO *
              (PAGAMENTO-V.PCT-DESCONTO(#IDX) / 100)
        END-IF
        ADD #VLR-DSCT-ITEM TO #VLR-TOTAL-DSCT
      VALUE 'I'
* WITHHOLDING TAX
        COMPUTE #VLR-DSCT-ITEM = #VLR-BRUTO *
            (PAGAMENTO-V.PCT-DESCONTO(#IDX) / 100)
        ADD #VLR-DSCT-ITEM TO #VLR-TOTAL-DSCT
      VALUE 'S'
* UNION DUES
        COMPUTE #VLR-DSCT-ITEM = #VLR-BRUTO * 0.01
        ADD #VLR-DSCT-ITEM TO #VLR-TOTAL-DSCT
      VALUE 'A'
* ADMINISTRATIVE DISCOUNT
        IF PAGAMENTO-V.VLR-DESCONTO(#IDX) > 0
          MOVE PAGAMENTO-V.VLR-DESCONTO(#IDX) TO #VLR-DSCT-ITEM
        ELSE
          COMPUTE #VLR-DSCT-ITEM = #VLR-BRUTO *
              (PAGAMENTO-V.PCT-DESCONTO(#IDX) / 100)
        END-IF
        ADD #VLR-DSCT-ITEM TO #VLR-TOTAL-DSCT
      NONE
        IGNORE
    END-DECIDE
*
* APPLY 30% CAP - EXCEPT COURT-ORDERED
    IF #TIPO-DSCT NE 'J'
      IF #VLR-TOTAL-DSCT > #VLR-MAX-DSCT
        MOVE #VLR-MAX-DSCT TO #VLR-TOTAL-DSCT
      END-IF
    END-IF
*
  END-FOR
END-FIND
*
* TRUNCATE TOTAL DISCOUNT
COMPUTE #VLR-TEMP = #VLR-TOTAL-DSCT * 100
COMPUTE #VLR-TOTAL-DSCT = #VLR-TEMP / 100
*
* UPDATE PAYMENT
FIND PAGAMENTO-V WITH NUM-PAGAMENTO = #NUM-PGTO
  MOVE #VLR-TOTAL-DSCT TO PAGAMENTO-V.VLR-DESCONTO-TOTAL
  UPDATE PAGAMENTO-V
  END TRANSACTION
END-FIND
*
WRITE 'DISCOUNTS CALCULATED' /
      '====================' /
      'GROSS AMOUNT..:' #VLR-BRUTO /
      'DISCOUNT......:' #VLR-TOTAL-DSCT /
      '30% CAP.......:' #VLR-MAX-DSCT
*
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
DEFINE SUBROUTINE CALC-CONTRIB-SOCIAL
  FOR #K = 1 TO 4
    IF #VLR-BRUTO <= #FAIXA-CONTRIB(#K)
      COMPUTE #VLR-DSCT-ITEM = #VLR-BRUTO * #ALIQ-CONTRIB(#K)
      ADD #VLR-DSCT-ITEM TO #VLR-TOTAL-DSCT
      ESCAPE BOTTOM
    END-IF
  END-FOR
END-SUBROUTINE
*
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
* NATURAL ERROR HANDLING - TICKET 7210
ON ERROR
  WRITE 'NATURAL ERROR' *ERROR-NR
        'LINE'          *ERROR-LINE
        'PGM'          *PROGRAM
  BACKOUT TRANSACTION
  TERMINATE 12
END-ERROR
*
END
