* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
* SUBPROGRAMA: CALCBENF
* SISTEMA:  SIFAP - SIST. FISC. ADM. PAGAMENTOS
* AUTOR:    CARLOS ROBERTO DA SILVA
* DATA:     18/04/1997
* ALTERADO: 30/11/2001 - CARLOS SILVA  - INC 13O SALARIO
* ALTERADO: 15/06/2004 - PATRICIA GOMES - AJUSTE FATOR REG
* ALTERADO: 22/12/2009 - JOSE FERREIRA  - ABONO NATALINO
* ALTERADO: 09/05/2011 - EQUIPE SUPDE   - CHAMADO 6210 CONV SUBP
* ALTERADO: 08/03/2013 - FERNANDA COSTA - NOVAS FAIXAS RENDA
* ALTERADO: 14/06/2016 - EQUIPE SUPDE    - CHAMADO 7210 PADR DDM
* OBJETIVO: CALCULO VALOR BENEFICIO MENSAL
*           PROC PRINCIPAL DE CALCULO - ARQ 150/160/155
* CHAMADO POR: BATCHPGT VIA CALLNAT - INTERFACE PDACALC
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
DEFINE DATA
PARAMETER USING PDACALC
LOCAL USING LDASIFAP
LOCAL
  1 BENEFICIARIO-V VIEW OF BENEFICIARIO
    2 NUM-CPF            (A11)
    2 NOME-COMPLETO      (A60)
    2 DT-NASCIMENTO      (N8)
    2 SIT-BENEFICIARIO   (A1)
    2 COD-PROGRAMA       (A4)
    2 VLR-RENDA-FAMILIAR (P9,2)
    2 QTD-DEPENDENTES    (N2)
    2 COD-REGIAO         (N2)
    2 UF                 (A2)
    2 NUM-NIS            (N11)
*
  1 PAGAMENTO-V VIEW OF PAGAMENTO
    2 NUM-PAGAMENTO      (N15)
    2 NUM-CPF            (A11)
    2 COD-PROGRAMA       (A4)
    2 ANO-MES-REF        (N6)     /* AAAAMM */
    2 VLR-BRUTO          (P9,2)
    2 VLR-DESCONTO-TOTAL (P7,2)
    2 VLR-LIQUIDO        (P9,2)
    2 DT-GERACAO         (N8)
    2 SIT-PAGAMENTO      (A1)
    2 TIPO-PAGAMENTO     (A1)     /* N=NORMAL D=DECIMO T=TERCEIRO */
    2 VLR-ABONO          (P9,2)
*
  1 PROGRAMA-V VIEW OF PROGRAMA-SOCIAL
    2 COD-PROGRAMA        (A4)
    2 TIPO-PROGRAMA       (A1)
    2 VLR-BASE-INDIVIDUAL (P7,2)
    2 FATOR-REAJUSTE      (P3,4)
    2 SIT-PROGRAMA        (A1)
*
* VARIAVEIS DE TRABALHO
  1 #CPF                 (N11)
  1 #CPF-STR             (A11)
  1 #COMPETENCIA         (N6)
  1 #MES                 (N2)
  1 #ANO                 (N4)
  1 #ANO-NASC            (N4)
  1 #IDADE               (N3)
  1 #VLR-BASE            (P9,2)
  1 #VLR-BENF            (P9,2)
  1 #VLR-BRUTO           (P9,2)
  1 #VLR-DESC            (P9,2)
  1 #VLR-LIQ             (P9,2)
  1 #VLR-ABONO           (P9,2)
  1 #VLR-13              (P9,2)
  1 #VLR-TOTAL           (P9,2)
  1 #VLR-TEMP            (N11)
  1 #FATOR-REG           (N3,4)
  1 #FATOR-FAM           (N3,4)
  1 #FATOR-RND           (N3,4)
  1 #FATOR-IDADE         (N3,4)
  1 #NUM-DEP             (N2)
  1 #COD-REG             (N2)
  1 #COD-PROG            (A4)
  1 #RENDA               (P9,2)
  1 #TIPO-PROG           (A1)
  1 #FATOR-REAJ          (N3,4)
  1 #MSG                 (A78)
  1 #ERRO                (L)
  1 #DT-HOJE             (N8)
  1 #DT-NASC             (N8)
  1 #STATUS-BENEF        (A1)
  1 #TIPO-PGTO           (A1)
  1 #J                   (N2)
*
* TABELA FATORES REGIONAIS
  1 #TAB-REG             (N3,4/1:27)
*
* FAIXAS DE RENDA
  1 #FAIXA-RENDA         (P9,2/1:5)
  1 #FATOR-FAIXA         (N3,4/1:5)
END-DEFINE
*
MOVE *DATN TO #DT-HOJE
*
* INICIALIZA TABELA FATORES REGIONAIS
* REGIOES: 01-05=NORTE 06-10=NORDESTE 11-15=SUDESTE 16-20=SUL 21-25=C.OESTE 99=ESPEC
MOVE 1.3500 TO #TAB-REG(1)   /* AC */
MOVE 1.3200 TO #TAB-REG(2)   /* AM */
MOVE 1.3000 TO #TAB-REG(3)   /* AP */
MOVE 1.2800 TO #TAB-REG(4)   /* PA */
MOVE 1.3100 TO #TAB-REG(5)   /* RO */
MOVE 1.4000 TO #TAB-REG(6)   /* MA */
MOVE 1.3800 TO #TAB-REG(7)   /* PI */
MOVE 1.3500 TO #TAB-REG(8)   /* CE */
MOVE 1.3200 TO #TAB-REG(9)   /* BA */
MOVE 1.3600 TO #TAB-REG(10)  /* PE */
MOVE 1.1000 TO #TAB-REG(11)  /* SP */
MOVE 1.1200 TO #TAB-REG(12)  /* RJ */
MOVE 1.0800 TO #TAB-REG(13)  /* MG */
MOVE 1.0500 TO #TAB-REG(14)  /* ES */
MOVE 1.0000 TO #TAB-REG(15)  /* REF */
MOVE 1.0500 TO #TAB-REG(16)  /* PR */
MOVE 1.0700 TO #TAB-REG(17)  /* SC */
MOVE 1.0300 TO #TAB-REG(18)  /* RS */
MOVE 1.1500 TO #TAB-REG(19)  /* MS */
MOVE 1.2000 TO #TAB-REG(20)  /* MT */
MOVE 1.1800 TO #TAB-REG(21)  /* GO */
MOVE 1.2500 TO #TAB-REG(22)  /* TO */
MOVE 1.1000 TO #TAB-REG(23)  /* DF */
MOVE 1.2200 TO #TAB-REG(24)  /* RR */
MOVE 1.3300 TO #TAB-REG(25)  /* SE */
MOVE 1.0000 TO #TAB-REG(26)  /* RESERVA */
MOVE 1.0000 TO #TAB-REG(27)  /* RESERVA */
*
* FAIXAS DE RENDA - TETO E FATOR MULTIPLICADOR
MOVE 300.00  TO #FAIXA-RENDA(1)
MOVE 1.0000  TO #FATOR-FAIXA(1)
MOVE 600.00  TO #FAIXA-RENDA(2)
MOVE 0.8500  TO #FATOR-FAIXA(2)
MOVE 1000.00 TO #FAIXA-RENDA(3)
MOVE 0.7000  TO #FATOR-FAIXA(3)
MOVE 1500.00 TO #FAIXA-RENDA(4)
MOVE 0.5500  TO #FATOR-FAIXA(4)
MOVE 9999.99 TO #FAIXA-RENDA(5)
MOVE 0.4000  TO #FATOR-FAIXA(5)
*
* ENTRADA DE PARAMETROS - VIA PDACALC
* CHAMADO 6210/2011 - CONVERTIDO DE PROGRAMA ONLINE PARA
* SUBPROGRAMA. A CHAMADA PASSOU A VIR DO BATCHPGT VIA CALLNAT.
* BLOCO INPUT ABAIXO DESATIVADO - NAO REMOVER (HISTORICO)
*  INPUT 'SIFAP - CALCULO BENEFICIO' /
*        '=========================' /
*        'CPF BENEFICIARIO:' #CPF /
*        'COMPETENCIA.....:' #COMPETENCIA '(AAAAMM)'
*
MOVE #PC-CPF         TO #CPF
MOVE #PC-COMPETENCIA TO #COMPETENCIA
RESET #PC-COD-RETORNO #PC-MSG
RESET #PC-VLR-BRUTO #PC-VLR-DESCONTO
RESET #PC-VLR-ABONO #PC-VLR-LIQUIDO
*
* EXTRAIR MES/ANO DA COMPETENCIA
COMPUTE #ANO = #COMPETENCIA / 100
COMPUTE #MES = #COMPETENCIA - (#ANO * 100)
*
IF #MES < 1 OR #MES > 12
  MOVE 2020 TO #PC-COD-RETORNO
  MOVE 'COMPETENCIA INVALIDA' TO #PC-MSG
  ESCAPE ROUTINE
END-IF
*
* LEITURA BENEFICIARIO - ARQ 150
MOVE EDITED #CPF (EM=99999999999) TO #CPF-STR
FIND BENEFICIARIO-V WITH NUM-CPF = #CPF-STR
  IF NO RECORDS FOUND
    MOVE 2001 TO #PC-COD-RETORNO
    MOVE 'BENEFICIARIO NAO ENCONTRADO' TO #PC-MSG
    ESCAPE ROUTINE
  END-NOREC
  MOVE BENEFICIARIO-V.QTD-DEPENDENTES    TO #NUM-DEP
  MOVE BENEFICIARIO-V.COD-REGIAO         TO #COD-REG
  MOVE BENEFICIARIO-V.VLR-RENDA-FAMILIAR TO #RENDA
  MOVE BENEFICIARIO-V.DT-NASCIMENTO      TO #DT-NASC
  MOVE BENEFICIARIO-V.SIT-BENEFICIARIO   TO #STATUS-BENEF
  MOVE BENEFICIARIO-V.COD-PROGRAMA       TO #COD-PROG
END-FIND
*
IF #STATUS-BENEF NE 'A'
  MOVE 2002 TO #PC-COD-RETORNO
  COMPRESS 'BENEFICIARIO NAO ATIVO - STATUS:' #STATUS-BENEF
           INTO #PC-MSG
  ESCAPE ROUTINE
END-IF
*
* LEITURA PROGRAMA - ARQ 155
FIND PROGRAMA-V WITH COD-PROGRAMA = #COD-PROG
  IF NO RECORDS FOUND
    MOVE 2003 TO #PC-COD-RETORNO
    MOVE 'PROGRAMA NAO ENCONTRADO' TO #PC-MSG
    ESCAPE ROUTINE
  END-NOREC
  MOVE PROGRAMA-V.VLR-BASE-INDIVIDUAL TO #VLR-BASE
  MOVE PROGRAMA-V.TIPO-PROGRAMA       TO #TIPO-PROG
  MOVE PROGRAMA-V.FATOR-REAJUSTE      TO #FATOR-REAJ
END-FIND
*
* CALC FATOR REGIONAL
IF #COD-REG >= 1 AND #COD-REG <= 25
  MOVE #TAB-REG(#COD-REG) TO #FATOR-REG
ELSE
  MOVE 1.0000 TO #FATOR-REG
END-IF
*
* CALC FATOR FAMILIAR - ADICIONAL POR DEPENDENTE
IF #NUM-DEP = 0
  MOVE 1.0000 TO #FATOR-FAM
ELSE
  IF #NUM-DEP <= 2
    COMPUTE #FATOR-FAM = 1.0000 + (#NUM-DEP * 0.0500)
  ELSE
    IF #NUM-DEP <= 4
      COMPUTE #FATOR-FAM = 1.1000 + ((#NUM-DEP - 2) * 0.0300)
    ELSE
      COMPUTE #FATOR-FAM = 1.1600 + ((#NUM-DEP - 4) * 0.0200)
    END-IF
  END-IF
END-IF
*
* CALC FATOR RENDA - DETERMINAR FAIXA
PERFORM DET-FAIXA-RENDA
*
* CALC FATOR IDADE
* --------------------------------------------------------
* Y2K - REMEDIACAO 08/1998 - PROJETO BUG2000
* EQUIPE: R.SOUZA / C.SILVA - CHAMADO 1998/0147
* ATE 07/1998 A DT NASCIMENTO ERA LIDA EM AAMMDD E O
* SECULO ERA DEDUZIDO PELA JANELA ABAIXO (PIVO 50).
* O CAMPO PASSOU A AAAAMMDD NA CARGA DE 08/1998.
*    COMPUTE #AA = #DT-NASC / 10000
*    IF #AA < 50
*      COMPUTE #ANO-NASC = 2000 + #AA
*    ELSE
*      COMPUTE #ANO-NASC = 1900 + #AA
*    END-IF
* --------------------------------------------------------
COMPUTE #ANO-NASC = #DT-NASC / 10000
COMPUTE #IDADE = #ANO - #ANO-NASC
IF #IDADE >= 65
  MOVE 1.1500 TO #FATOR-IDADE
ELSE
  IF #IDADE >= 60
    MOVE 1.1000 TO #FATOR-IDADE
  ELSE
    IF #IDADE < 18
      MOVE 1.0500 TO #FATOR-IDADE
    ELSE
      MOVE 1.0000 TO #FATOR-IDADE
    END-IF
  END-IF
END-IF
*
* * * * * * * * * * * * * * * * * * * * * * * * * * * * *
* CALCULO PRINCIPAL - VLR BENEFICIO MENSAL
* VLR = BASE * FATOR_REG * FATOR_FAM * FATOR_RND * FATOR_IDADE
* * * * * * * * * * * * * * * * * * * * * * * * * * * * *
COMPUTE #VLR-BENF = #VLR-BASE * #FATOR-REG * #FATOR-FAM
                     * #FATOR-RND * #FATOR-IDADE
*
* APLICAR REAJUSTE DO PROGRAMA
COMPUTE #VLR-BENF = #VLR-BENF * (1 + #FATOR-REAJ)
*
* TRUNCAR P/ 2 CASAS DECIMAIS - PADRAO MAINFRAME
COMPUTE #VLR-TEMP = #VLR-BENF * 100
COMPUTE #VLR-BENF = #VLR-TEMP / 100
*
MOVE #VLR-BENF TO #VLR-BRUTO
MOVE 'N' TO #TIPO-PGTO
*
* * * * * * * * * * * * * * * * * * * * * * * * * * * * *
* CALC 13O SALARIO - DEZEMBRO
* FORMULA DIFERENCIADA: VLR_13 = VLR_BASE * FATOR_REG * (MESES_ATIVOS/12)
* * * * * * * * * * * * * * * * * * * * * * * * * * * * *
IF #MES = 12
  MOVE 'D' TO #TIPO-PGTO
  COMPUTE #VLR-13 = #VLR-BASE * #FATOR-REG * #FATOR-IDADE
* TRUNCAR 13O
  COMPUTE #VLR-TEMP = #VLR-13 * 100
  COMPUTE #VLR-13 = #VLR-TEMP / 100
  COMPUTE #VLR-BRUTO = #VLR-BENF + #VLR-13
*
* ABONO NATALINO - 15% ADICIONAL PARA PROGRAMAS TIPO 'A'
  IF #TIPO-PROG = 'A'
    COMPUTE #VLR-ABONO = #VLR-BENF * 0.15
* TRUNCAR ABONO
    COMPUTE #VLR-TEMP = #VLR-ABONO * 100
    COMPUTE #VLR-ABONO = #VLR-TEMP / 100
    COMPUTE #VLR-BRUTO = #VLR-BRUTO + #VLR-ABONO
  ELSE
    MOVE 0 TO #VLR-ABONO
  END-IF
END-IF
*
* CHAMAR CALCULO DE DESCONTOS
PERFORM CALC-DESCONTOS
*
* CALC VLR LIQUIDO
COMPUTE #VLR-LIQ = #VLR-BRUTO - #VLR-DESC
IF #VLR-LIQ < 0
  MOVE 0 TO #VLR-LIQ
END-IF
*
* TRUNCAR LIQUIDO
COMPUTE #VLR-TEMP = #VLR-LIQ * 100
COMPUTE #VLR-LIQ = #VLR-TEMP / 100
*
* GRAVAR PAGAMENTO - ARQ 160
MOVE #CPF-STR      TO PAGAMENTO-V.NUM-CPF
MOVE #COD-PROG     TO PAGAMENTO-V.COD-PROGRAMA
MOVE #COMPETENCIA  TO PAGAMENTO-V.ANO-MES-REF
MOVE #VLR-BRUTO    TO PAGAMENTO-V.VLR-BRUTO
MOVE #VLR-DESC     TO PAGAMENTO-V.VLR-DESCONTO-TOTAL
MOVE #VLR-LIQ      TO PAGAMENTO-V.VLR-LIQUIDO
MOVE #DT-HOJE      TO PAGAMENTO-V.DT-GERACAO
MOVE 'G'           TO PAGAMENTO-V.SIT-PAGAMENTO
MOVE #TIPO-PGTO    TO PAGAMENTO-V.TIPO-PAGAMENTO
MOVE #VLR-ABONO    TO PAGAMENTO-V.VLR-ABONO
STORE PAGAMENTO-V
END TRANSACTION
*
* RETORNO DOS VALORES VIA PDACALC - CHAMADO 6210/2011
MOVE #VLR-BRUTO TO #PC-VLR-BRUTO
MOVE #VLR-DESC  TO #PC-VLR-DESCONTO
MOVE #VLR-ABONO TO #PC-VLR-ABONO
MOVE #VLR-LIQ   TO #PC-VLR-LIQUIDO
MOVE #TIPO-PGTO TO #PC-TIPO-PGTO
MOVE 0          TO #PC-COD-RETORNO
*
* SAIDA DE TELA DESATIVADA NA CONVERSAO P/ SUBPROGRAMA
*  WRITE 'CALCULO REALIZADO COM SUCESSO' /
*        '==============================' /
*        'CPF............:' #CPF /
*        'COMPETENCIA....:' #COMPETENCIA /
*        'VLR BRUTO......:' #VLR-BRUTO /
*        'VLR DESCONTO...:' #VLR-DESC /
*        'VLR LIQUIDO....:' #VLR-LIQ /
*        'TIPO PGTO......:' #TIPO-PGTO
*  IF #MES = 12
*    WRITE 'VLR 13O SALARIO:' #VLR-13 /
*          'VLR ABONO......:' #VLR-ABONO
*  END-IF
*
ESCAPE ROUTINE
*
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
DEFINE SUBROUTINE DET-FAIXA-RENDA
  FOR #J = 1 TO 5
    IF #RENDA <= #FAIXA-RENDA(#J)
      MOVE #FATOR-FAIXA(#J) TO #FATOR-RND
      ESCAPE BOTTOM
    END-IF
  END-FOR
END-SUBROUTINE
*
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
* CALC DESCONTOS - SIMPLIFICADO (VER CALCDSCT P/ COMPLETO)
DEFINE SUBROUTINE CALC-DESCONTOS
  MOVE 0 TO #VLR-DESC
* DESCONTO BASICO - 3% CONTRIB SOCIAL
  IF #VLR-BRUTO > 500.00
    COMPUTE #VLR-DESC = #VLR-BRUTO * 0.03
    COMPUTE #VLR-TEMP = #VLR-DESC * 100
    COMPUTE #VLR-DESC = #VLR-TEMP / 100
  END-IF
END-SUBROUTINE
*
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
* TRATAMENTO DE ERRO NATURAL - CHAMADO 7210
ON ERROR
  WRITE 'ERRO NATURAL' *ERROR-NR
        'LINHA'        *ERROR-LINE
        'PGM'          *PROGRAM
  BACKOUT TRANSACTION
  TERMINATE 12
END-ERROR
*
END
