* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
* COPYCODE: CCVALCPF
* SISTEMA:  SIFAP - SIST. FISC. ADM. PAGAMENTOS
* AUTOR:    CARLOS ROBERTO DA SILVA
* DATA:     15/03/1997
* ALTERADO: 17/05/2005 - MARCIA HELENA - INC DIGITOS IGUAIS
* ALTERADO: 07/06/2011 - ROBERTO MENDES - DIVIDE C/ REMAINDER
* OBJETIVO: ROTINA PADRAO DE VALIDACAO DE CPF - MODULO 11.
*           ESTA E A VERSAO NORMATIVA DO SIFAP (NT-SUPDE-014).
*           FORNECE A SUBROTINA VALIDA-CPF-PADRAO.
*
* USO:      1. DECLARAR OS CAMPOS EXIGIDOS NO DEFINE DATA
*           2. MOVER O CPF P/ #CPF-STR
*           3. PERFORM VALIDA-CPF-PADRAO
*           4. TESTAR #CPF-OK
*           5. COLOCAR "INCLUDE CCVALCPF" NO FIM DO MODULO,
*              NA AREA DAS SUBROTINAS, ANTES DO "END"
*
* CAMPOS EXIGIDOS NO DEFINE DATA DO MODULO QUE INCLUI:
*           1 #CPF-STR      (A11)       /* IN
*           1 #CPF-OK       (L)         /* OUT
*           1 #CPF-DIG      (N1/1:11)   /* TRABALHO
*           1 #CPF-SOMA     (N5)        /* TRABALHO
*           1 #CPF-QUOC     (N5)        /* TRABALHO
*           1 #CPF-RESTO    (N2)        /* TRABALHO
*           1 #CPF-DV1      (N1)        /* TRABALHO
*           1 #CPF-DV2      (N1)        /* TRABALHO
*           1 #CPF-PESO     (N2)        /* TRABALHO
*           1 #CPF-IDX      (N2)        /* TRABALHO
*           1 #CPF-IGUAIS   (L)         /* TRABALHO
*
* NOTA:     EXISTEM COPIAS INLINE DESTA ROTINA EM OUTROS
*           MODULOS DO SIFAP, COM COMPORTAMENTO DIFERENTE
*           DESTE. AS COPIAS NAO FORAM SUBSTITUIDAS.
*           CHAMADO 6620/2011 - EM ABERTO.
*           >>> NAO ALTERAR ESTA ROTINA SEM CONFRONTAR AS
*           >>> COPIAS - ELAS NAO SAO EQUIVALENTES.
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
DEFINE SUBROUTINE VALIDA-CPF-PADRAO
*
  MOVE TRUE TO #CPF-OK
  RESET #CPF-SOMA #CPF-QUOC #CPF-RESTO #CPF-DV1 #CPF-DV2
*
* CPF DEVE SER INTEIRAMENTE NUMERICO
  IF #CPF-STR NE MASK(NNNNNNNNNNN)
    MOVE FALSE TO #CPF-OK
    ESCAPE ROUTINE
  END-IF
*
* EXTRAIR OS 11 DIGITOS
  FOR #CPF-IDX = 1 TO 11
    MOVE SUBSTR(#CPF-STR,#CPF-IDX,1) TO #CPF-DIG(#CPF-IDX)
  END-FOR
*
* REJEITAR CPF COM TODOS OS DIGITOS IGUAIS
  MOVE TRUE TO #CPF-IGUAIS
  FOR #CPF-IDX = 2 TO 11
    IF #CPF-DIG(#CPF-IDX) NE #CPF-DIG(1)
      MOVE FALSE TO #CPF-IGUAIS
      ESCAPE BOTTOM
    END-IF
  END-FOR
  IF #CPF-IGUAIS
    MOVE FALSE TO #CPF-OK
    ESCAPE ROUTINE
  END-IF
*
* PRIMEIRO DIGITO VERIFICADOR - PESOS 10 A 2
  MOVE 10 TO #CPF-PESO
  FOR #CPF-IDX = 1 TO 9
    COMPUTE #CPF-SOMA = #CPF-SOMA
                      + (#CPF-DIG(#CPF-IDX) * #CPF-PESO)
    SUBTRACT 1 FROM #CPF-PESO
  END-FOR
  DIVIDE 11 INTO #CPF-SOMA GIVING #CPF-QUOC
                           REMAINDER #CPF-RESTO
  IF #CPF-RESTO < 2
    MOVE 0 TO #CPF-DV1
  ELSE
    COMPUTE #CPF-DV1 = 11 - #CPF-RESTO
  END-IF
  IF #CPF-DV1 NE #CPF-DIG(10)
    MOVE FALSE TO #CPF-OK
    ESCAPE ROUTINE
  END-IF
*
* SEGUNDO DIGITO VERIFICADOR - PESOS 11 A 2
  RESET #CPF-SOMA
  MOVE 11 TO #CPF-PESO
  FOR #CPF-IDX = 1 TO 10
    COMPUTE #CPF-SOMA = #CPF-SOMA
                      + (#CPF-DIG(#CPF-IDX) * #CPF-PESO)
    SUBTRACT 1 FROM #CPF-PESO
  END-FOR
  DIVIDE 11 INTO #CPF-SOMA GIVING #CPF-QUOC
                           REMAINDER #CPF-RESTO
  IF #CPF-RESTO < 2
    MOVE 0 TO #CPF-DV2
  ELSE
    COMPUTE #CPF-DV2 = 11 - #CPF-RESTO
  END-IF
  IF #CPF-DV2 NE #CPF-DIG(11)
    MOVE FALSE TO #CPF-OK
  END-IF
*
END-SUBROUTINE
