* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
* PROGRAMA: CONSBENF
* SISTEMA:  SIFAP - SIST. FISC. ADM. PAGAMENTOS
* AUTOR:    MARCIA HELENA OLIVEIRA
* DATA:     28/09/1998
* ALTERADO: 15/06/2003 - MARCIA HELENA - INC MASCARA CPF
* ALTERADO: 22/11/2007 - ROBERTO MENDES - INC HIST PAGTOS
* ALTERADO: 05/08/2012 - FERNANDA COSTA - AJUSTE TELA MAP
* ALTERADO: 09/04/2013 - ROBERTO MENDES - INC CALLNAT SUBVALCP
* ALTERADO: 22/07/2016 - ANDERSON LIMA  - INC TRILHA CCAUDIT
* ALTERADO: 30/05/2018 - PATRICIA GOMES - ALINHA VIEW AO DDM
* OBJETIVO: CONSULTA DADOS BENEFICIARIO - TELA ONLINE 3270
*           EXIBE DADOS CADASTRAIS E HISTORICO PAGAMENTOS
*           UTILIZA MAP P/ LAYOUT TELA - ARQ 150/160
* EXECUCAO: TRANSACAO ONLINE - BIBLIOTECA SIFAPPRD
*           NAO AGENDADO EM SIFAPJ01/SIFAPJ02 (BATCH)
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
DEFINE DATA
LOCAL USING PDAVALID
LOCAL USING LDASIFAP
LOCAL
  1 BENEFICIARIO-V VIEW OF BENEFICIARIO
    2 NUM-CPF            (A11)
    2 NOME-COMPLETO      (A60)
    2 DT-NASCIMENTO      (N8)
    2 SEXO               (A1)
    2 GRP-ENDERECO
      3 LOGRADOURO       (A60)
      3 NUMERO           (A10)
      3 BAIRRO           (A40)
      3 MUNICIPIO        (A40)
      3 UF               (A2)
      3 CEP              (N8)
      3 COD-REGIAO       (A2)
    2 SIT-BENEFICIARIO   (A1)
    2 COD-PROGRAMA       (A4)
    2 VLR-RENDA-FAMILIAR (P9,2)
    2 QTD-DEPENDENTES    (N2)
    2 NUM-NIS            (N11)
    2 DT-CADASTRO        (N8)
*
  1 PAGAMENTO-V VIEW OF PAGAMENTO
    2 NUM-PAGAMENTO      (N15)
    2 NUM-CPF            (A11)
    2 ANO-MES-REF        (N6)
    2 VLR-BRUTO          (P9,2)
    2 VLR-DESCONTO-TOTAL (P7,2)
    2 VLR-LIQUIDO        (P9,2)
    2 SIT-PAGAMENTO      (A1)
    2 TIPO-PAGAMENTO     (A1)
    2 DT-GERACAO         (N8)
*
* TRILHA DE AUDITORIA - ARQ 153 - VER COPYCODE CCAUDIT
  1 AUDITORIA-V VIEW OF AUDITORIA
    2 NUM-AUDITORIA      (N15)
    2 DT-EVENTO          (N8)
    2 HR-EVENTO          (N6)
    2 TS-EVENTO          (N14)
    2 COD-ACAO           (A2)
    2 COD-MODULO         (A8)
    2 DES-ACAO           (A80)
    2 TIPO-ENTIDADE      (A4)
    2 ID-ENTIDADE        (A15)
    2 NUM-CPF-AFETADO    (A11)
    2 USR-EVENTO         (A8)
    2 NOM-JOB-BATCH      (A16)
    2 SIT-BATCH          (A1)
*
  1 #CPF-BUSCA           (N11)
  1 #NIS-BUSCA           (N11)
  1 #TIPO-BUSCA          (A1)    /* C=CPF N=NIS */
  1 #CPF-A11             (A11)   /* CHAVE ARQ 150 - DDM AB
  1 #CPF-MASK            (A14)
  1 #CPF-STR             (A11)
  1 #CPF-NUM             (N11)   /* CPF EM FORMATO NUMERICO
  1 #ENDERECO            (A80)
  1 #MSG                 (A60)
  1 #STATUS-DESC         (A15)
  1 #I                   (N3)
  1 #MAX-HIST            (N3)    /* CAMPO OBSOLETO - ATE 2004
*
* CAMPOS DA TRILHA DE AUDITORIA - EXIGIDOS POR CCAUDIT
  1 #AUD-ACAO            (A2)
  1 #AUD-ENTIDADE        (A4)
  1 #AUD-ID              (A15)
  1 #AUD-CPF             (A11)
  1 #AUD-DESCRICAO       (A80)
  1 #AUD-SEQ             (N15)
  1 #AUD-TIMN            (N7)
*
* HISTORICO PAGAMENTOS
  1 #HIST-COMP           (N6/1:12)
  1 #HIST-BRUTO          (P9,2/1:12)
  1 #HIST-LIQ            (P9,2/1:12)
  1 #HIST-STS            (A1/1:12)
  1 #HIST-TIPO           (A1/1:12)
  1 #QTD-HIST            (N3)
*
* MASCARA CPF
  1 #CPF-P1              (A3)
  1 #CPF-P2              (A3)
  1 #CPF-P3              (A3)
  1 #CPF-P4              (A2)
END-DEFINE
*
* ============================================
* TELA ONLINE 3270 - LOOP DE CONSULTA
* SAIDA PELA PF3. MSG NA ULTIMA LINHA DA TELA.
* ============================================
REPEAT
*
  SET CONTROL 'MB'
  INPUT USING MAP 'CONSBENF-M01'
*
* TELA ALTERNATIVA SEM MAP
  IF *ERROR-NR NE 0
    INPUT 'SIFAP - CONSULTA BENEFICIARIO' /
          '==============================' /
          'TIPO BUSCA (C=CPF / N=NIS):' #TIPO-BUSCA /
          'CPF..........:' #CPF-BUSCA /
          'NIS..........:' #NIS-BUSCA
  END-IF
*
  IF *PF-KEY = 'PF3'
    ESCAPE BOTTOM
  END-IF
*
  IF #TIPO-BUSCA = ' '
    MOVE 'C' TO #TIPO-BUSCA
  END-IF
*
* ============================================
* VALIDACAO CPF PELA ROTINA CORPORATIVA
* CHAMADO 6620/2011 - SUBVALCP E A UNICA CRITICA
* DE CPF DESTA TELA. NAO HA ROTINA INLINE AQUI.
* ============================================
  IF #TIPO-BUSCA = 'C'
    MOVE 'C' TO #PV-TIPO-DOC
    MOVE EDITED #CPF-BUSCA (EM=99999999999) TO #PV-CPF
    RESET #PV-NIS
    CALLNAT 'SUBVALCP' #PV-TIPO-DOC #PV-CPF #PV-NIS
                       #PV-COD-RETORNO #PV-MSG
                       #PV-IND-ESPECIAL
    IF #PV-COD-RETORNO NE 0
      MOVE #PV-MSG TO #MSG
      REINPUT #MSG MARK *#CPF-BUSCA
    END-IF
    MOVE #PV-CPF TO #CPF-A11
  END-IF
*
* BUSCAR BENEFICIARIO - ARQ 150
  DECIDE ON FIRST VALUE OF #TIPO-BUSCA
    VALUE 'C'
      FIND BENEFICIARIO-V WITH NUM-CPF = #CPF-A11
        IF NO RECORDS FOUND
          REINPUT 'BENEFICIARIO NAO ENCONTRADO'
                  MARK *#CPF-BUSCA
        END-NOREC
        PERFORM EXIBE-BENEFICIARIO
      END-FIND
    VALUE 'N'
      FIND BENEFICIARIO-V WITH NUM-NIS = #NIS-BUSCA
        IF NO RECORDS FOUND
          REINPUT 'BENEFICIARIO NAO ENCONTRADO'
                  MARK *#NIS-BUSCA
        END-NOREC
        PERFORM EXIBE-BENEFICIARIO
      END-FIND
    NONE
      REINPUT 'TIPO BUSCA INVALIDO' MARK *#TIPO-BUSCA
  END-DECIDE
*
* ============================================
* TRILHA DE ACESSO A DADO PESSOAL
* IN-TCU 63/2010 - CHAMADO 8842/2016
* ============================================
  MOVE 'CO'     TO #AUD-ACAO
  MOVE 'BENF'   TO #AUD-ENTIDADE
  MOVE #CPF-A11 TO #AUD-ID
  MOVE #CPF-A11 TO #AUD-CPF
  MOVE 'CONSULTA CADASTRO BENEFICIARIO - CONSBENF'
       TO #AUD-DESCRICAO
  PERFORM GRAVA-AUDITORIA
  END TRANSACTION
*
END-REPEAT
*
* ============================================
* TRATAMENTO DE ERRO NATURAL - CHAMADO 5512/2005
* ESCAPE ROUTINE DEVOLVE O CONTROLE P/ A INSTRUCAO
* SEGUINTE A QUE PROVOCOU O ERRO.
* ============================================
ON ERROR
  WRITE 'ERRO NATURAL:' *ERROR-NR
        'LINHA:' *ERROR-LINE
        'PGM:' *PROGRAM
  ESCAPE ROUTINE
END-ERROR
*
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
* EXIBE CADASTRO E HISTORICO. EXECUTADA DENTRO DO BLOCO
* FIND, ONDE O RECORD BUFFER DO ARQ 150 ESTA GARANTIDO.
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
DEFINE SUBROUTINE EXIBE-BENEFICIARIO
*
* MASCARA CPF - OCULTAR DADOS SENSIVEIS
  MOVE BENEFICIARIO-V.NUM-CPF TO #CPF-A11
  MOVE BENEFICIARIO-V.NUM-CPF TO #CPF-STR
  MOVE EDITED #CPF-STR TO #CPF-NUM (EM=99999999999)
  PERFORM MASCARA-CPF
*
* ENDERECO - MONTADO A PARTIR DO GRUPO BA DO ARQ 150
  COMPRESS BENEFICIARIO-V.LOGRADOURO ','
           BENEFICIARIO-V.NUMERO '-'
           BENEFICIARIO-V.BAIRRO INTO #ENDERECO
*
* ============================================
* Y2K - REMEDIACAO 08/1998 - PROJETO BUG2000
* EQUIPE R.SOUZA - CHAMADO 1180/1998
* ATE 07/1998 A DT NASCIMENTO CHEGAVA EM AAMMDD E
* ERA EXPANDIDA PELA JANELA DE SECULO ABAIXO. O
* CAMPO PASSOU A AAAAMMDD NO ARQ 150 E O BLOCO
* FICOU DESATIVADO - NAO REMOVER (HISTORICO).
*   MOVE #L-AA-CURTO TO #L-ANO-EXPANDIDO
*   IF #L-AA-CURTO < #L-SEC-JANELA
*     COMPUTE #L-ANO-EXPANDIDO = 2000 + #L-AA-CURTO
*   ELSE
*     COMPUTE #L-ANO-EXPANDIDO = 1900 + #L-AA-CURTO
*   END-IF
* ============================================
*
* DESCRICAO STATUS
  DECIDE ON FIRST VALUE OF BENEFICIARIO-V.SIT-BENEFICIARIO
    VALUE 'A'
      MOVE 'ATIVO' TO #STATUS-DESC
    VALUE 'S'
      MOVE 'SUSPENSO' TO #STATUS-DESC
    VALUE 'C'
      MOVE 'CANCELADO' TO #STATUS-DESC
    VALUE 'I'
      MOVE 'INATIVO' TO #STATUS-DESC
    VALUE 'D'
      MOVE 'DESLIGADO' TO #STATUS-DESC
    NONE
      MOVE 'DESCONHECIDO' TO #STATUS-DESC
  END-DECIDE
*
* EXIBIR DADOS CADASTRAIS
  WRITE 'SIFAP - DADOS DO BENEFICIARIO' /
        '==============================' /
        'CPF...........:' #CPF-MASK /
        'NOME..........:' BENEFICIARIO-V.NOME-COMPLETO /
        'DT NASCIMENTO.:' BENEFICIARIO-V.DT-NASCIMENTO /
        'SEXO..........:' BENEFICIARIO-V.SEXO /
        'ENDERECO......:' #ENDERECO /
        'MUNICIPIO/UF..:' BENEFICIARIO-V.MUNICIPIO
                      '/' BENEFICIARIO-V.UF /
        'CEP...........:' BENEFICIARIO-V.CEP /
        'STATUS........:' BENEFICIARIO-V.SIT-BENEFICIARIO
                      '-' #STATUS-DESC /
        'COD PROGRAMA..:' BENEFICIARIO-V.COD-PROGRAMA /
        'RENDA FAMILIAR:' BENEFICIARIO-V.VLR-RENDA-FAMILIAR /
        'DEPENDENTES...:' BENEFICIARIO-V.QTD-DEPENDENTES /
        'REGIAO........:' BENEFICIARIO-V.COD-REGIAO /
        'NIS...........:' BENEFICIARIO-V.NUM-NIS /
        'DT CADASTRO...:' BENEFICIARIO-V.DT-CADASTRO
*
* HISTORICO DE PAGAMENTOS - ULTIMOS 12
  WRITE ' ' /
        'HISTORICO PAGAMENTOS (ULTIMOS 12)' /
        '================================='
  WRITE 'COMPETENCIA   BRUTO        LIQUIDO      STS  TIPO'
  WRITE '----------    -----------  -----------  ---  ----'
*
  MOVE 0 TO #QTD-HIST
  READ PAGAMENTO-V BY NUM-CPF = BENEFICIARIO-V.NUM-CPF
    IF PAGAMENTO-V.NUM-CPF NE BENEFICIARIO-V.NUM-CPF
      ESCAPE BOTTOM
    END-IF
    ADD 1 TO #QTD-HIST
    IF #QTD-HIST > 12
      ESCAPE BOTTOM
    END-IF
    WRITE PAGAMENTO-V.ANO-MES-REF '    '
          PAGAMENTO-V.VLR-BRUTO '  '
          PAGAMENTO-V.VLR-LIQUIDO '  '
          PAGAMENTO-V.SIT-PAGAMENTO '    '
          PAGAMENTO-V.TIPO-PAGAMENTO
  END-READ
*
  IF #QTD-HIST = 0
    WRITE 'NENHUM PAGAMENTO ENCONTRADO'
  END-IF
*
END-SUBROUTINE
*
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
* MASCARA CPF - FORMATO ***.***.XXX-XX
* NOTA: INCONSISTENCIA CONHECIDA - AS VEZES MOSTRA PRIMEIROS 3
*       DIGITOS AO INVES DOS ULTIMOS. DEPENDE DO TAMANHO DO CPF
*       ARMAZENADO. NAO CORRIGIR SEM APROVACAO DA AUDITORIA.
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
DEFINE SUBROUTINE MASCARA-CPF
  IF #CPF-NUM < 10000000000
* CPF COM MENOS DE 11 DIGITOS (PREENCHIDO COM ZEROS A ESQ)
    MOVE SUBSTR(#CPF-STR,1,3) TO #CPF-P1
    COMPRESS #CPF-P1 '.***.' '***-**' INTO #CPF-MASK LEAVING NO SPACE
  ELSE
    MOVE '***' TO #CPF-P1
    MOVE '***' TO #CPF-P2
    MOVE SUBSTR(#CPF-STR,7,3) TO #CPF-P3
    MOVE SUBSTR(#CPF-STR,10,2) TO #CPF-P4
    COMPRESS #CPF-P1 '.' #CPF-P2 '.' #CPF-P3 '-' #CPF-P4
        INTO #CPF-MASK LEAVING NO SPACE
  END-IF
END-SUBROUTINE
*
* TRILHA DE AUDITORIA - ARQ 153
INCLUDE CCAUDIT
*
END
