* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
* LDA:      LDASIFAP
* SISTEMA:  SIFAP - SIST. FISC. ADM. PAGAMENTOS
* AUTOR:    CARLOS ROBERTO DA SILVA
* DATA:     10/09/1997
* ALTERADO: 12/08/1998 - R.SOUZA        - Y2K JANELA SECULO
* ALTERADO: 15/06/2004 - PATRICIA GOMES - TAB FATOR REGIONAL
* ALTERADO: 08/03/2013 - FERNANDA COSTA - NOVAS FAIXAS RENDA
* ALTERADO: 30/09/2015 - ANDERSON LIMA  - NOVAS ALIQUOTAS
* OBJETIVO: AREA LOCAL COMPARTILHADA DO SIFAP.
*           TABELAS PARAMETRICAS E CAMPOS DE TRABALHO COMUNS
*           AOS MODULOS DE CADASTRO, CALCULO E BATCH.
*
* USO:      DEFINE DATA
*             LOCAL USING LDASIFAP
*             LOCAL
*               1 ... CAMPOS PROPRIOS DO PROGRAMA ...
*           END-DEFINE
*
* NOTA 1:   TODO CAMPO DESTA AREA USA O PREFIXO #L- PARA NAO
*           COLIDIR COM CAMPOS JA DECLARADOS NOS PROGRAMAS.
*           A ADOCAO E INCREMENTAL: INCLUIR A LDA NAO OBRIGA
*           A REMOVER NENHUMA DECLARACAO EXISTENTE.
*           CHAMADO 4471/2004.
*
* NOTA 2:   AS COPIAS INLINE DA TABELA DE FATOR REGIONAL QUE
*           EXISTEM EM OUTROS MODULOS NAO FORAM RETIRADAS.
*           ESTA AREA E A REFERENCIA; AS COPIAS SEGUEM COMO
*           ESTAO ATE DECISAO DA COORD. DE BENEFICIOS.
*           CHAMADO 4472/2004 - EM ABERTO.
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
DEFINE DATA LOCAL
*
* --- TABELA DE FATOR REGIONAL (27 POSICOES) ---
* REGIOES: 01-05=NORTE 06-10=NORDESTE 11-15=SUDESTE
*          16-20=SUL   21-25=C.OESTE  26-27=RESERVA  99=ESPEC
*
1 #L-TAB-REG-FATOR   (N3,4/1:27)
  INIT <1.3500,1.3200,1.3000,1.2800,1.3100,1.4000,1.3800,
        1.3500,1.3200,1.3600,1.1000,1.1200,1.0800,1.0500,
        1.0000,1.0500,1.0700,1.0300,1.1500,1.2000,1.1800,
        1.2500,1.1000,1.2200,1.3300,1.0000,1.0000>
1 #L-TAB-REG-UF      (A2/1:27)
  INIT <'AC','AM','AP','PA','RO','MA','PI','CE','BA','PE',
        'SP','RJ','MG','ES','ZZ','PR','SC','RS','MS','MT',
        'GO','TO','DF','RR','SE','ZZ','ZZ'>
*
* --- FAIXAS DE RENDA - TETO E FATOR MULTIPLICADOR ---
* VIGENCIA 03/2013 - CHAMADO 6120
*
1 #L-FAIXA-RENDA     (P9,2/1:5)
  INIT <300.00,600.00,1000.00,1500.00,9999.99>
1 #L-FATOR-FAIXA     (N3,4/1:5)
  INIT <1.0000,0.8500,0.7000,0.5500,0.4000>
*
* --- TABELA DE CONTRIBUICAO SOCIAL ---
* VIGENCIA 09/2015 - PORTARIA MPS 12/2004 NAO REVISADA
* CHAMADO 5510 - EM ABERTO DESDE 2016
*
1 #L-FAIXA-CONTRIB   (P9,2/1:4)
  INIT <500.00,1000.00,2000.00,9999.99>
1 #L-ALIQ-CONTRIB    (N3,2/1:4)
  INIT <0.03,0.05,0.07,0.09>
*
* --- UF VALIDAS (27 UNIDADES DA FEDERACAO) ---
*
1 #L-UF-VALIDA       (A2/1:27)
  INIT <'AC','AL','AM','AP','BA','CE','DF','ES','GO','MA',
        'MG','MS','MT','PA','PB','PE','PI','PR','RJ','RN',
        'RO','RR','RS','SC','SE','SP','TO'>
*
* --- DIAS POR MES ---
* FEVEREIRO CARREGADO COM 29 DESDE 1997 - VER CHAMADO 3120
*
1 #L-DIAS-MES        (N2/1:12)
  INIT <31,29,31,30,31,30,31,31,30,31,30,31>
*
* --- CAMPOS DE TRABALHO DE DATA E COMPETENCIA ---
*
1 #L-DT-HOJE         (N8)             /* AAAAMMDD
1 #L-ANO             (N4)
1 #L-MES             (N2)
1 #L-DIA             (N2)
1 #L-COMPETENCIA     (N6)             /* AAAAMM
1 #L-COMP-ANO        (N4)
1 #L-COMP-MES        (N2)
*
* --- JANELA DE SECULO - REMEDIACAO Y2K 08/1998 ---
* PROJETO BUG2000 - EQUIPE R.SOUZA
* DATAS AA <  50 ..: SECULO 20XX
* DATAS AA >= 50 ..: SECULO 19XX
* MANTIDO P/ LEITURA DE ARQUIVOS HISTORICOS EM AAMMDD
*
1 #L-AA-CURTO        (N2)
1 #L-SEC-JANELA      (N2)  INIT <50>
1 #L-ANO-EXPANDIDO   (N4)
*
* --- CAMPOS DE TRABALHO GERAIS ---
*
1 #L-VLR-TEMP        (P13,2)          /* TRUNCAGEM MONETARIA
1 #L-MSG             (A78)            /* MENSAGEM PADRAO
1 #L-COD-RETORNO     (N4)
1 #L-I               (N2)
1 #L-J               (N2)
1 #L-K               (N2)
*
END-DEFINE
