* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
* PDA:      PDACALC
* SISTEMA:  SIFAP - SIST. FISC. ADM. PAGAMENTOS
* AUTOR:    CARLOS ROBERTO DA SILVA
* DATA:     22/06/1997
* ALTERADO: 30/11/2001 - CARLOS SILVA   - INC 13O SALARIO
* ALTERADO: 28/07/2004 - PATRICIA GOMES - INC CAMPOS ELEG
* ALTERADO: 22/12/2009 - JOSE FERREIRA  - INC VLR ABONO
* ALTERADO: 30/09/2015 - ANDERSON LIMA  - INC TIPO PGTO
* OBJETIVO: AREA DE PARAMETROS DA CADEIA DE PAGAMENTO DO SIFAP.
*           CARREGA O CONTEXTO DE UM BENEFICIARIO/COMPETENCIA
*           DO INICIO AO FIM DA CADEIA:
*             VALELEG  - ELEGIBILIDADE
*             CALCBENF - VALOR BRUTO
*             CALCDSCT - DESCONTOS
*             CALCCORR - CORRECAO MONETARIA
*
* USO NO CHAMADOR:
*           DEFINE DATA
*             LOCAL USING PDACALC
*             LOCAL
*               1 ... CAMPOS PROPRIOS DO PROGRAMA ...
*           END-DEFINE
*
* USO NO CHAMADO:
*           DEFINE DATA
*             PARAMETER USING PDACALC
*             LOCAL
*               1 ... CAMPOS DE TRABALHO ...
*           END-DEFINE
*
* NOTA:     OS CAMPOS DE CHAVE SEGUEM O FORMATO DO DDM
*           (CPF A11, COD-PROGRAMA A4, COD-REGIAO A2) E NAO
*           O FORMATO NUMERICO USADO NAS VIEWS DOS PROGRAMAS.
*           A CONVERSAO E RESPONSABILIDADE DO CHAMADOR VIA
*           MOVE EDITED. VER CHAMADO 4471/2004.
*
* CODIGOS DE RETORNO (#PC-COD-RETORNO):
*           0000 - OK / ELEGIVEL
*           2001 - BENEFICIARIO NAO ENCONTRADO
*           2002 - BENEFICIARIO NAO ATIVO
*           2003 - PROGRAMA NAO ENCONTRADO
*           2004 - PROGRAMA INATIVO
*           2010 - NAO ELEGIVEL - VER #PC-MSG
*           2020 - COMPETENCIA INVALIDA
*           2030 - PAGAMENTO JA GERADO P/ COMPETENCIA
*           9999 - ERRO NATURAL - VER CMPRINT
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
DEFINE DATA PARAMETER
*
* --- ENTRADA - CHAVE ---
*
1 #PC-CPF             (A11)   /* IN  CPF S/ MASCARA (DDM AB)
1 #PC-COD-PROGRAMA    (A4)    /* IN  COD PROG SOCIAL (DDM AA)
1 #PC-COMPETENCIA     (N6)    /* IN  AAAAMM
*
* --- ENTRADA - CONTEXTO DO BENEFICIARIO ---
*
1 #PC-COD-REGIAO      (A2)    /* IN  01-27 OU 99 (DDM BJ)
1 #PC-RENDA-FAMILIAR  (P9,2)  /* IN  RENDA DECLARADA
1 #PC-QTD-DEPEND      (N2)    /* IN  QTD DEPENDENTES ATIVOS
1 #PC-IDADE           (N3)    /* IN  IDADE EM ANOS COMPLETOS
1 #PC-SIT-BENEF       (A1)    /* IN  A/S/C/I/D
1 #PC-VLR-BASE        (P9,2)  /* IN  VLR BASE DO PROGRAMA
*
* --- SAIDA - VALORES ---
*
1 #PC-VLR-BRUTO       (P9,2)  /* OUT VALOR BRUTO CALCULADO
1 #PC-VLR-DESCONTO    (P9,2)  /* OUT SOMA DOS DESCONTOS
1 #PC-VLR-ABONO       (P9,2)  /* OUT ABONO NATALINO
1 #PC-VLR-LIQUIDO     (P9,2)  /* OUT BRUTO - DESCONTO + ABONO
*
* --- SAIDA - CONTROLE ---
*
1 #PC-TIPO-PGTO       (A1)    /* OUT N=NORMAL D=DECIMO T=TERCEIRO
1 #PC-COD-RETORNO     (N4)    /* OUT 0000 = OK
1 #PC-MSG             (A60)   /* OUT BRANCO QUANDO OK
*
END-DEFINE
