* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
* PDA:      PDAVALID
* SISTEMA:  SIFAP - SIST. FISC. ADM. PAGAMENTOS
* AUTOR:    MARCIA HELENA OLIVEIRA
* DATA:     12/03/1998
* ALTERADO: 22/09/2003 - ANA LUCIA      - INC IND DOC ESPECIAL
* ALTERADO: 07/06/2011 - ROBERTO MENDES - INC CAMPO NIS
* OBJETIVO: AREA DE PARAMETROS DA FAMILIA DE SUBPROGRAMAS DE
*           VALIDACAO DE DOCUMENTOS DO BENEFICIARIO.
*           USADA POR SUBVALCP (CPF) E SUBVALNI (NIS/PIS).
*
* USO NO CHAMADOR:
*           DEFINE DATA
*             LOCAL USING PDAVALID
*             LOCAL
*               1 ... CAMPOS PROPRIOS DO PROGRAMA ...
*           END-DEFINE
*
* USO NO CHAMADO:
*           DEFINE DATA
*             PARAMETER USING PDAVALID
*             LOCAL
*               1 ... CAMPOS DE TRABALHO ...
*           END-DEFINE
*
* NORMA:    NT-SUPDE-011/1998 - UMA PDA POR FAMILIA DE ROTINA.
*           OS DOIS SUBPROGRAMAS RECEBEM A MESMA LISTA, NA
*           MESMA ORDEM. CAMPO NAO USADO PELO CHAMADO E
*           IGNORADO - ISTO E PROPOSITAL, NAO E DEFEITO.
*
* CODIGOS DE RETORNO (#PV-COD-RETORNO):
*           0000 - DOCUMENTO VALIDO
*           1001 - CPF INVALIDO - DIGITO VERIFICADOR
*           1002 - CPF NAO INFORMADO
*           1003 - CPF COM TODOS OS DIGITOS IGUAIS
*           1004 - TIPO DE DOCUMENTO INVALIDO P/ ESTA ROTINA
*           1005 - CPF COM CARACTERE NAO NUMERICO
*           1010 - NIS NAO INFORMADO
*           1011 - NIS INVALIDO - DIGITO VERIFICADOR
*           1012 - NIS COM CARACTERE NAO NUMERICO
*           9999 - ERRO NATURAL - VER CMPRINT
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
DEFINE DATA PARAMETER
*
* --- ENTRADA ---
*
1 #PV-TIPO-DOC        (A1)    /* IN  C=CPF  N=NIS/PIS/PASEP
1 #PV-CPF             (A11)   /* IN  CPF S/ MASCARA C/ ZEROS ESQ
1 #PV-NIS             (A11)   /* IN  NIS/PIS/PASEP S/ MASCARA
*
* --- SAIDA ---
*
1 #PV-COD-RETORNO     (N4)    /* OUT 0000 = VALIDO
1 #PV-MSG             (A60)   /* OUT BRANCO QUANDO VALIDO
1 #PV-IND-ESPECIAL    (A1)    /* OUT S=DOC ESPECIAL N=DOC COMUM
*
END-DEFINE
