* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
* PROGRAMA: RELPGT
* SISTEMA:  SIFAP - SIST. FISC. ADM. PAGAMENTOS
* AUTOR:    ANA LUCIA PEREIRA
* DATA:     17/12/1999
* ALTERADO: 25/03/2004 - ANA LUCIA     - AJUSTE PAGINACAO
* ALTERADO: 10/08/2010 - JOSE FERREIRA - INC SUBTOTAL PROG
* ALTERADO: 14/02/2013 - ANDERSON LIMA - IMPRESSORA LOGICA 1
* ALTERADO: 30/05/2018 - PATRICIA GOMES - ALINHA VIEW AO DDM
* OBJETIVO: RELATORIO ANALITICO DE PAGAMENTOS POR PERIODO
*           LISTAGEM DETALHADA C/ TOTALIZADORES
*           SAIDA IMPRESSORA MAINFRAME 66 LIN/PAG
* EXECUCAO: SIFAPJ02 STEP020 - MENSAL 2O DIA UTIL
*           CMSYNIN: COMP-INI / COMP-FIM / COD-PROGRAMA
*           CMPRT01: SYSOUT=A DEST=CENTRAL LRECL=133
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
DEFINE DATA
LOCAL USING LDASIFAP
LOCAL
  1 PAGAMENTO-V VIEW OF PAGAMENTO
    2 NUM-PAGAMENTO      (N15)
    2 NUM-CPF            (A11)
    2 COD-PROGRAMA       (A4)
    2 ANO-MES-REF        (N6)
    2 VLR-BRUTO          (P9,2)
    2 VLR-DESCONTO-TOTAL (P7,2)
    2 VLR-LIQUIDO        (P9,2)
    2 SIT-PAGAMENTO      (A1)
    2 TIPO-PAGAMENTO     (A1)
    2 DT-GERACAO         (N8)
    2 VLR-ABONO          (P9,2)
*
  1 BENEFICIARIO-V VIEW OF BENEFICIARIO
    2 NUM-CPF            (A11)
    2 NOME-COMPLETO      (A60)
    2 GRP-ENDERECO
      3 UF               (A2)
*
  1 #COMP-INI            (N6)
  1 #COMP-FIM            (N6)
  1 #COD-PROG-FILTRO     (N4)
  1 #COD-PROG-A4         (A4)   /* FILTRO NO FORMATO DO DDM
  1 #DT-HOJE             (N8)
*
* CONTROLE PAGINACAO
  1 #PAG                 (N4)
  1 #LINHA               (N2)
  1 #MAX-LINHAS          (N2)
*
* ACUMULADORES
  1 #TOT-BRUTO           (P13,2)
  1 #TOT-DESC            (P13,2)
  1 #TOT-LIQ             (P13,2)
  1 #TOT-ABONO           (P13,2)
  1 #QTD-REG             (N8)
  1 #SUB-BRUTO           (P13,2)
  1 #SUB-LIQ             (P13,2)
  1 #QTD-SUB             (N8)
  1 #PROG-ANT            (A4)
*
  1 #NOME-BENEF          (A30)
  1 #UF-BENEF            (A2)
  1 #CPF-MASK            (A14)
  1 #CPF-STR             (A11)
  1 #TIPO-DESC           (A8)
  1 #STATUS-DESC         (A8)
*
* LINHAS SEPARADORAS DE IMPRESSAO
  1 #SEP-100             (A100)
  1 #SEP-TRACO80         (A80)
  1 #SEP-IGUAL80         (A80)
END-DEFINE
*
* IMPRESSORA LOGICA 1 - DD CMPRT01 DO SIFAPJ02
DEFINE PRINTER (1) OUTPUT 'CMPRT01'
FORMAT (1) PS=66 LS=132
*
MOVE *DATN TO #DT-HOJE
MOVE 66 TO #MAX-LINHAS
MOVE 0 TO #PAG
MOVE 99 TO #LINHA
MOVE 0 TO #TOT-BRUTO
MOVE 0 TO #TOT-DESC
MOVE 0 TO #TOT-LIQ
MOVE 0 TO #TOT-ABONO
MOVE 0 TO #QTD-REG
MOVE 0 TO #SUB-BRUTO
MOVE 0 TO #SUB-LIQ
MOVE 0 TO #QTD-SUB
RESET #PROG-ANT
*
MOVE ALL '-' TO #SEP-100
MOVE ALL '-' TO #SEP-TRACO80
MOVE ALL '=' TO #SEP-IGUAL80
*
INPUT 'SIFAP - RELATORIO PAGAMENTOS' /
      '=============================' /
      'COMPETENCIA INICIAL:' #COMP-INI /
      'COMPETENCIA FINAL..:' #COMP-FIM /
      'COD PROGRAMA (0=TODOS):' #COD-PROG-FILTRO
*
* CONVERSAO DO FILTRO P/ O FORMATO DO DDM (AD - A4)
MOVE EDITED #COD-PROG-FILTRO (EM=9999) TO #COD-PROG-A4
*
* TITULO E RODAPE DA IMPRESSORA LOGICA 1
WRITE (1) TITLE LEFT JUSTIFIED
      'SIFAP - RELATORIO ANALITICO DE PAGAMENTOS'
      40X 'PAG:' #PAG /
      'PERIODO:' #COMP-INI 'A' #COMP-FIM
      40X 'DATA:' #DT-HOJE
*
WRITE (1) TRAILER LEFT JUSTIFIED
      'SIFAP/RELPGT - USO INTERNO - JOB SIFAPJ02'
*
AT TOP OF PAGE (1)
  WRITE (1) #SEP-100
  WRITE (1) 'COMPET  CPF            NOME'
        30X 'UF  BRUTO        DESC         LIQUIDO      STS      TIPO'
  WRITE (1) #SEP-100
END-TOPPAGE
*
* PROCESSAMENTO
READ PAGAMENTO-V BY ANO-MES-REF STARTING FROM #COMP-INI
     THRU #COMP-FIM
*
  AT START OF DATA
    RESET #TOT-BRUTO #TOT-DESC #TOT-LIQ #TOT-ABONO
          #QTD-REG #SUB-BRUTO #SUB-LIQ #QTD-SUB
  END-START
*
  IF PAGAMENTO-V.ANO-MES-REF > #COMP-FIM
    ESCAPE BOTTOM
  END-IF
*
  IF #COD-PROG-FILTRO NE 0
      AND PAGAMENTO-V.COD-PROGRAMA NE #COD-PROG-A4
    ESCAPE TOP
  END-IF
*
* QUEBRA POR PROGRAMA
* BREAK MANUAL - MANTIDO DESDE 1997 - CHAMADO 2210/2004
  IF PAGAMENTO-V.COD-PROGRAMA NE #PROG-ANT
      AND #PROG-ANT NE ' '
    PERFORM IMPRIME-SUBTOTAL
    MOVE 0 TO #SUB-BRUTO
    MOVE 0 TO #SUB-LIQ
    MOVE 0 TO #QTD-SUB
  END-IF
  MOVE PAGAMENTO-V.COD-PROGRAMA TO #PROG-ANT
*
* BUSCAR NOME BENEFICIARIO
  MOVE ' ' TO #NOME-BENEF
  MOVE ' ' TO #UF-BENEF
  FIND BENEFICIARIO-V WITH NUM-CPF = PAGAMENTO-V.NUM-CPF
    IF NO RECORDS FOUND
      IGNORE
    END-NOREC
    MOVE SUBSTR(BENEFICIARIO-V.NOME-COMPLETO,1,30)
         TO #NOME-BENEF
    MOVE BENEFICIARIO-V.UF TO #UF-BENEF
  END-FIND
*
* MASCARA CPF
  MOVE PAGAMENTO-V.NUM-CPF TO #CPF-STR
  COMPRESS '***.' SUBSTR(#CPF-STR,4,3) '.'
           SUBSTR(#CPF-STR,7,3) '-' SUBSTR(#CPF-STR,10,2)
      INTO #CPF-MASK LEAVING NO SPACE
*
* DESC TIPO
  DECIDE ON FIRST VALUE OF PAGAMENTO-V.TIPO-PAGAMENTO
    VALUE 'N'
      MOVE 'NORMAL' TO #TIPO-DESC
    VALUE 'D'
      MOVE 'DECIMO' TO #TIPO-DESC
    VALUE 'T'
      MOVE 'TERCEIRO' TO #TIPO-DESC
    NONE
      MOVE 'OUTRO' TO #TIPO-DESC
  END-DECIDE
*
* DESC STATUS
  DECIDE ON FIRST VALUE OF PAGAMENTO-V.SIT-PAGAMENTO
    VALUE 'G'
      MOVE 'GERADO' TO #STATUS-DESC
    VALUE 'P'
      MOVE 'PAGO' TO #STATUS-DESC
    VALUE 'C'
      MOVE 'CANCELAD' TO #STATUS-DESC
    VALUE 'D'
      MOVE 'DEVOLVID' TO #STATUS-DESC
    VALUE 'E'
      MOVE 'ESTORNAD' TO #STATUS-DESC
    NONE
      MOVE 'OUTRO' TO #STATUS-DESC
  END-DECIDE
*
* VERIF PAGINACAO
  IF #LINHA >= (#MAX-LINHAS - 5)
    PERFORM IMPRIME-CABECALHO
  END-IF
*
* IMPRIMIR LINHA DETALHE
  WRITE (1) PAGAMENTO-V.ANO-MES-REF '  '
        #CPF-MASK '  '
        #NOME-BENEF '  '
        #UF-BENEF ' '
        PAGAMENTO-V.VLR-BRUTO '  '
        PAGAMENTO-V.VLR-DESCONTO-TOTAL '  '
        PAGAMENTO-V.VLR-LIQUIDO '  '
        #STATUS-DESC ' '
        #TIPO-DESC
  ADD 1 TO #LINHA
*
* ACUMULADORES
  ADD PAGAMENTO-V.VLR-BRUTO          TO #TOT-BRUTO
  ADD PAGAMENTO-V.VLR-DESCONTO-TOTAL TO #TOT-DESC
  ADD PAGAMENTO-V.VLR-LIQUIDO        TO #TOT-LIQ
  ADD PAGAMENTO-V.VLR-ABONO          TO #TOT-ABONO
  ADD 1 TO #QTD-REG
  ADD PAGAMENTO-V.VLR-BRUTO   TO #SUB-BRUTO
  ADD PAGAMENTO-V.VLR-LIQUIDO TO #SUB-LIQ
  ADD 1 TO #QTD-SUB
*
* ULTIMO SUBTOTAL E TOTAL GERAL
  AT END OF DATA
    IF #PROG-ANT NE ' '
      PERFORM IMPRIME-SUBTOTAL
    END-IF
    PERFORM IMPRIME-TOTAL-GERAL
  END-ENDDATA
*
END-READ
*
* ============================================
* TRATAMENTO DE ERRO NATURAL - CHAMADO 5512/2005
* ============================================
ON ERROR
  WRITE (1) 'ERRO NATURAL:' *ERROR-NR
            'LINHA:' *ERROR-LINE
            'PGM:' *PROGRAM
  BACKOUT TRANSACTION
  TERMINATE 12
END-ERROR
*
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
DEFINE SUBROUTINE IMPRIME-CABECALHO
  ADD 1 TO #PAG
  NEWPAGE (1)
  MOVE 6 TO #LINHA
END-SUBROUTINE
*
DEFINE SUBROUTINE IMPRIME-SUBTOTAL
  WRITE (1) ' '
  WRITE (1) '  SUBTOTAL PROGRAMA:' #PROG-ANT
        '  QTD:' #QTD-SUB
        '  BRUTO:' #SUB-BRUTO
        '  LIQ:' #SUB-LIQ
  WRITE (1) #SEP-TRACO80
  ADD 3 TO #LINHA
END-SUBROUTINE
*
DEFINE SUBROUTINE IMPRIME-TOTAL-GERAL
  WRITE (1) ' '
  WRITE (1) #SEP-IGUAL80
  WRITE (1) 'TOTAL GERAL   QTD:' #QTD-REG
        '   BRUTO:' #TOT-BRUTO
        '   DESC:' #TOT-DESC
        '   LIQ:' #TOT-LIQ
  WRITE (1) 'TOTAL ABONO:' #TOT-ABONO
  WRITE (1) #SEP-IGUAL80
END-SUBROUTINE
*
END
