//*==================================================================
//* JOB......: SIFAPJ02
//* SISTEMA..: SIFAP - SIST. FISC. ADM. PAGAMENTOS
//* PDS......: SIFAP.PROD.JCLLIB(SIFAPJ02)
//* AUTOR....: PATRICIA GOMES DE SOUZA
//* DATA.....: 10/11/1999
//* ALTERADO.: 25/03/2004 - ANA LUCIA     - INC STEP RELPGT
//* ALTERADO.: 20/04/2006 - ROBERTO MENDES - SUBTOTAIS REGIAO
//* ALTERADO.: 14/02/2013 - ANDERSON LIMA - AJUSTE FORMATO 132
//* OBJETIVO.: RELATORIOS MENSAIS - BATCHREL (CONSOLIDADO) E
//*            RELPGT (ANALITICO POR PROGRAMA)
//*==================================================================
//* AGENDAMENTO (CONTROL-M)
//*   TABELA........: SIFAP-MENSAL
//*   JOB NAME......: SIFAPJ02
//*   GRUPO.........: SIFAP-REL
//*   PERIODICIDADE.: MENSAL - 2O DIA UTIL
//*   HORARIO.......: 06:00  JANELA 1H
//*   CONDICAO IN...: SIFAP-PGT-OK ODAT
//*   PREDECESSOR...: SIFAPJ01 (RC=0)
//*   CONDICAO OUT..: SIFAP-REL-OK ODAT
//*==================================================================
//* IMPRESSAO
//*   OS PROGRAMAS ALOCAM AS IMPRESSORAS LOGICAS COM:
//*     DEFINE PRINTER (1) OUTPUT 'CMPRT01'
//*     DEFINE PRINTER (2) OUTPUT 'CMPRT02'
//*     FORMAT (1) PS=66 LS=132
//*     FORMAT (2) PS=66 LS=132
//*   CADA IMPRESSORA LOGICA EXIGE UM DD DE MESMO NOME NESTE
//*   JCL. IMPRESSORA LOGICA SEM DD CORRESPONDENTE PROVOCA
//*   NAT1500 EM TEMPO DE EXECUCAO.
//*==================================================================
//* RESTART
//*   AMBOS OS STEPS SAO SOMENTE-LEITURA SOBRE ARQ 152.
//*   REEXECUCAO INTEGRAL E SEGURA E NAO DUPLICA DADO.
//*   BASTA REEXECUTAR O JOB DO INICIO.
//*==================================================================
//SIFAPJ02 JOB (SIFAP,DESIF),'RELATORIOS SIFAP',
//             CLASS=A,MSGCLASS=X,MSGLEVEL=(1,1),
//             REGION=0M,TIME=60,NOTIFY=&SYSUID
//*
//JOBLIB   DD DSN=SIFAP.PROD.LOADLIB,DISP=SHR
//         DD DSN=SAG.NAT426.LOAD,DISP=SHR
//         DD DSN=SAG.ADA614.LOAD,DISP=SHR
//*
//*------------------------------------------------------------------
//* STEP010 - RELATORIO CONSOLIDADO (BATCHREL)
//*------------------------------------------------------------------
//STEP010  EXEC PGM=NATBATCH,
//             PARM='IM=D,MADIO=0,MT=0,DBID=57,FNR=152'
//STEPLIB  DD DSN=SAG.NAT426.LOAD,DISP=SHR
//         DD DSN=SAG.ADA614.LOAD,DISP=SHR
//DDCARD   DD DSN=SIFAP.PROD.PARMLIB(ADAPARM),DISP=SHR
//CMPRINT  DD SYSOUT=*
//*
//* IMPRESSORA LOGICA 1 - CONSOLIDADO P/ CENTRAL DE IMPRESSAO
//CMPRT01  DD SYSOUT=A,DEST=CENTRAL,
//            DCB=(RECFM=FBA,LRECL=133,BLKSIZE=13300)
//*
//* COPIA EM ARQUIVO P/ GUARDA DE 10 ANOS (LEI 8159 ART 14)
//CMWKF01  DD DSN=SIFAP.PROD.REL.CONSOL(+1),
//            DISP=(NEW,CATLG,DELETE),
//            UNIT=SYSDA,SPACE=(CYL,(50,20),RLSE),
//            DCB=(RECFM=FB,LRECL=132,BLKSIZE=27852)
//*
//CMSYNIN  DD *
LOGON SIFAPPRD
BATCHREL
202601
FIN
/*
//*
//*------------------------------------------------------------------
//* STEP020 - RELATORIO ANALITICO (RELPGT)
//* SO EXECUTA SE STEP010 TERMINOU COM RC MENOR OU IGUAL A 4
//*------------------------------------------------------------------
//STEP020  EXEC PGM=NATBATCH,COND=(4,LT,STEP010),
//             PARM='IM=D,MADIO=0,MT=0,DBID=57,FNR=152'
//STEPLIB  DD DSN=SAG.NAT426.LOAD,DISP=SHR
//         DD DSN=SAG.ADA614.LOAD,DISP=SHR
//DDCARD   DD DSN=SIFAP.PROD.PARMLIB(ADAPARM),DISP=SHR
//CMPRINT  DD SYSOUT=*
//*
//* IMPRESSORA LOGICA 1 - ANALITICO POR PROGRAMA SOCIAL
//CMPRT01  DD SYSOUT=A,DEST=CENTRAL,
//            DCB=(RECFM=FBA,LRECL=133,BLKSIZE=13300)
//*
//* IMPRESSORA LOGICA 2 - RESUMO P/ COORDENACAO (SENARC)
//CMPRT02  DD SYSOUT=A,DEST=SENARC,COPIES=2,
//            DCB=(RECFM=FBA,LRECL=133,BLKSIZE=13300)
//*
//* CMSYNIN - COMPETENCIA INICIAL, FINAL E FILTRO DE PROGRAMA
//* PROGRAMA 0000 = TODOS
//CMSYNIN  DD *
LOGON SIFAPPRD
RELPGT
202601
202601
0000
FIN
/*
//*
//*==================================================================
//* CODIGOS DE RETORNO ESPERADOS
//*   RC=0  - RELATORIOS GERADOS
//*   RC=4  - GERADOS SEM MOVIMENTO NA COMPETENCIA
//*   RC=12 - ERRO NATURAL - VER CMPRINT E ACIONAR PLANTAO
//*==================================================================
