* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
* SUBPGM:   SUBVALNI
* SISTEMA:  SIFAP - SIST. FISC. ADM. PAGAMENTOS
* AUTOR:    ROBERTO MENDES JUNIOR
* DATA:     07/06/2011
* ALTERADO: 30/09/2015 - ANDERSON LIMA - AJUSTE MSG RETORNO
* OBJETIVO: SUBPROGRAMA DE VALIDACAO DE NIS/PIS/PASEP.
*           MODULO 11 COM PESOS 3,2,9,8,7,6,5,4,3,2.
*           NAO FAZ INPUT NEM WRITE - DEVOLVE TUDO PELA PDA.
*
* ORIGEM:   ATE 2011 O SIFAP NAO VALIDAVA NIS EM NENHUM
*           MODULO - APENAS TESTAVA CONTRA ZERO.
*           CHAMADO 6621/2011 - DEFIS.
*
* INVOCACAO:
*   CALLNAT 'SUBVALNI' #PV-TIPO-DOC #PV-CPF #PV-NIS
*                      #PV-COD-RETORNO #PV-MSG
*                      #PV-IND-ESPECIAL
*
* PRE-CONDICAO:
*   #PV-TIPO-DOC = 'N'
*   #PV-NIS      = NIS COM 11 POSICOES, ZEROS A ESQUERDA
*
* POS-CONDICAO:
*   #PV-COD-RETORNO = 0 QUANDO O NIS E VALIDO
*
* ALGORITMO:
*   SOMA = SOMATORIO(DIGITO(I) * PESO(I)) P/ I = 1 A 10
*   RESTO = SOMA MOD 11
*   SE RESTO < 2  ENTAO DV = 0
*                 SENAO DV = 11 - RESTO
*   NIS VALIDO QUANDO DV = DIGITO(11)
*
* NOTA:     O PARAMETRO #PV-CPF NAO E USADO AQUI. A PDA E
*           COMPARTILHADA COM SUBVALCP POR NORMA INTERNA
*           (NT-SUPDE-011/1998). NAO REMOVER DA LISTA.
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
DEFINE DATA
PARAMETER USING PDAVALID
LOCAL
  1 #NIS-STR             (A11)
  1 #NIS-DIG             (N1/1:11)
  1 #NIS-PESO            (N1/1:10)
    INIT <3,2,9,8,7,6,5,4,3,2>
  1 #NIS-SOMA            (N5)
  1 #NIS-QUOC            (N5)
  1 #NIS-RESTO           (N2)
  1 #NIS-DV              (N1)
  1 #NIS-IDX             (N2)
END-DEFINE
*
RESET #PV-COD-RETORNO #PV-MSG
MOVE 'N' TO #PV-IND-ESPECIAL
*
* ============================================
* CONSISTENCIA DOS PARAMETROS DE ENTRADA
* ============================================
IF #PV-TIPO-DOC NE 'N'
  MOVE 1004 TO #PV-COD-RETORNO
  MOVE 'TIPO DE DOCUMENTO INVALIDO P/ SUBVALNI' TO #PV-MSG
  ESCAPE ROUTINE
END-IF
*
IF #PV-NIS = ' ' OR #PV-NIS = '00000000000'
  MOVE 1010 TO #PV-COD-RETORNO
  MOVE 'NIS NAO INFORMADO' TO #PV-MSG
  ESCAPE ROUTINE
END-IF
*
IF #PV-NIS NE MASK(NNNNNNNNNNN)
  MOVE 1012 TO #PV-COD-RETORNO
  MOVE 'NIS COM CARACTERE NAO NUMERICO' TO #PV-MSG
  ESCAPE ROUTINE
END-IF
*
* ============================================
* VALIDACAO MODULO 11 - PESOS 3 2 9 8 7 6 5 4 3 2
* ============================================
MOVE #PV-NIS TO #NIS-STR
PERFORM VALIDA-NIS-MOD11
*
IF #NIS-DV NE #NIS-DIG(11)
  MOVE 1011 TO #PV-COD-RETORNO
  MOVE 'NIS INVALIDO - DIGITO VERIFICADOR' TO #PV-MSG
  ESCAPE ROUTINE
END-IF
*
* NIS VALIDO
MOVE 0 TO #PV-COD-RETORNO
RESET #PV-MSG
*
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
ON ERROR
  MOVE 9999 TO #PV-COD-RETORNO
  COMPRESS 'ERRO NATURAL' *ERROR-NR
           'LINHA' *ERROR-LINE
           'PGM' *PROGRAM INTO #PV-MSG
  ESCAPE ROUTINE
END-ERROR
*
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
DEFINE SUBROUTINE VALIDA-NIS-MOD11
*
  RESET #NIS-SOMA #NIS-QUOC #NIS-RESTO #NIS-DV
*
* EXTRAIR OS 11 DIGITOS
  FOR #NIS-IDX = 1 TO 11
    MOVE SUBSTR(#NIS-STR,#NIS-IDX,1) TO #NIS-DIG(#NIS-IDX)
  END-FOR
*
* SOMATORIO PONDERADO DOS 10 PRIMEIROS DIGITOS
  FOR #NIS-IDX = 1 TO 10
    COMPUTE #NIS-SOMA = #NIS-SOMA
                      + (#NIS-DIG(#NIS-IDX)
                      *  #NIS-PESO(#NIS-IDX))
  END-FOR
*
* DIGITO VERIFICADOR
  DIVIDE 11 INTO #NIS-SOMA GIVING #NIS-QUOC
                           REMAINDER #NIS-RESTO
  IF #NIS-RESTO < 2
    MOVE 0 TO #NIS-DV
  ELSE
    COMPUTE #NIS-DV = 11 - #NIS-RESTO
  END-IF
*
END-SUBROUTINE
*
END
