* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
* SUBPROGRAMA: VALELEG
* SISTEMA:  SIFAP - SIST. FISC. ADM. PAGAMENTOS
* AUTOR:    JOSE FERREIRA DOS SANTOS
* DATA:     03/02/1999
* ALTERADO: 28/07/2004 - PATRICIA GOMES  - NOVAS REGRAS ELEG
* ALTERADO: 11/10/2009 - FERNANDA COSTA  - AJUSTE FAIXA ETARIA
* ALTERADO: 18/08/2011 - ROBERTO MENDES  - CONV SUBPROGRAMA
* ALTERADO: 05/04/2013 - ANDERSON LIMA   - INC REGIAO 99
* OBJETIVO: VALIDACAO ELEGIBILIDADE BENEFICIARIO P/ PROGRAMA
*           VERIFICA REQUISITOS CADASTRO X PROGRAMA - ARQ 150/155
*           CHAMADO 6621/2011 - CHAMADO VIA CALLNAT PELO
*           BATCHPGT. ENTRADA E SAIDA PELA PDACALC.
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
DEFINE DATA
PARAMETER USING PDACALC
LOCAL USING LDASIFAP
LOCAL
  1 BENEFICIARIO-V VIEW OF BENEFICIARIO
    2 NUM-CPF            (A11)
    2 NOME-COMPLETO      (A60)
    2 DT-NASCIMENTO      (N8)
    2 SIT-BENEFICIARIO   (A1)
    2 COD-PROGRAMA       (A4)
    2 VLR-RENDA-FAMILIAR (P9,2)
    2 QTD-DEPENDENTES    (N2)
    2 GRP-ENDERECO
      3 UF               (A2)
      3 COD-REGIAO       (A2)
    2 NUM-NIS            (N11)
    2 IND-DOCUMENTOS-OK  (A1)
*
  1 PROGRAMA-V VIEW OF PROGRAMA-SOCIAL
    2 COD-PROGRAMA       (A4)
    2 NOME-PROGRAMA      (A60)
    2 TIPO-PROGRAMA      (A1)
    2 VLR-BASE-INDIVIDUAL (P7,2)
    2 COD-ELEGIBILIDADE  (A5)
    2 SIT-PROGRAMA       (A1)
    2 RENDA-MAX-PERCAP   (P7,2)
    2 IDADE-MIN          (N3)
    2 IDADE-MAX          (N3)
*
  1 #CPF-STR             (A11)
  1 #COD-PROG            (A4)
  1 #ELEGIVEL            (L)
  1 #MOTIVO              (A60/1:10)
  1 #QTD-MOT             (N2)
  1 #ELEG-OK             (L)
  1 #IDADE               (N3)
  1 #ANO-NASC            (N4)
  1 #ANO-ATUAL           (N4)
  1 #RENDA               (P9,2)
  1 #NUM-DEP             (N2)
  1 #COD-REG             (N2)
  1 #COD-ELEG            (A5)
  1 #TIPO-PROG           (A1)
  1 #STATUS-BENEF        (A1)
  1 #DOCS-OK             (A1)
  1 #SIT-PROG            (A1)
  1 #IDADE-MIN           (N3)
  1 #IDADE-MAX           (N3)
  1 #RENDA-MAX           (P7,2)
  1 #I                   (N2)
  1 #MSG                 (A78)
END-DEFINE
*
COMPUTE #ANO-ATUAL = *DATN / 10000
MOVE 0 TO #QTD-MOT
MOVE TRUE TO #ELEGIVEL
*
* ENTRADA PELA PDACALC - CHAMADO 6621/2011
* INPUT RETIRADO: ROTINA PASSOU A SER CHAMADA POR
* CALLNAT A PARTIR DO BATCHPGT.
MOVE #PC-CPF            TO #CPF-STR
MOVE #PC-COD-PROGRAMA   TO #COD-PROG
MOVE #PC-COD-REGIAO     TO #COD-REG
MOVE #PC-RENDA-FAMILIAR TO #RENDA
MOVE #PC-QTD-DEPEND     TO #NUM-DEP
MOVE #PC-IDADE          TO #IDADE
MOVE #PC-SIT-BENEF      TO #STATUS-BENEF
*
* LEITURA BENEFICIARIO - ARQ 150
FIND BENEFICIARIO-V WITH NUM-CPF = #CPF-STR
  IF NO RECORDS FOUND
    MOVE 2001 TO #PC-COD-RETORNO
    MOVE 'BENEFICIARIO NAO ENCONTRADO' TO #PC-MSG
    ESCAPE ROUTINE
  END-NOREC
  COMPUTE #ANO-NASC = BENEFICIARIO-V.DT-NASCIMENTO / 10000
  COMPUTE #IDADE = #ANO-ATUAL - #ANO-NASC
  MOVE BENEFICIARIO-V.VLR-RENDA-FAMILIAR TO #RENDA
  MOVE BENEFICIARIO-V.QTD-DEPENDENTES    TO #NUM-DEP
  MOVE BENEFICIARIO-V.COD-REGIAO         TO #COD-REG
  MOVE BENEFICIARIO-V.SIT-BENEFICIARIO   TO #STATUS-BENEF
  MOVE BENEFICIARIO-V.IND-DOCUMENTOS-OK  TO #DOCS-OK
END-FIND
*
* LEITURA PROGRAMA - ARQ 155
FIND PROGRAMA-V WITH COD-PROGRAMA = #COD-PROG
  IF NO RECORDS FOUND
    MOVE 2003 TO #PC-COD-RETORNO
    MOVE 'PROGRAMA NAO ENCONTRADO' TO #PC-MSG
    ESCAPE ROUTINE
  END-NOREC
  MOVE PROGRAMA-V.COD-ELEGIBILIDADE TO #COD-ELEG
  MOVE PROGRAMA-V.TIPO-PROGRAMA     TO #TIPO-PROG
  MOVE PROGRAMA-V.SIT-PROGRAMA      TO #SIT-PROG
  MOVE PROGRAMA-V.IDADE-MIN         TO #IDADE-MIN
  MOVE PROGRAMA-V.IDADE-MAX         TO #IDADE-MAX
  MOVE PROGRAMA-V.RENDA-MAX-PERCAP  TO #RENDA-MAX
END-FIND
*
IF #SIT-PROG NE 'A'
  MOVE 2004 TO #PC-COD-RETORNO
  MOVE 'PROGRAMA INATIVO' TO #PC-MSG
  ESCAPE ROUTINE
END-IF
*
* ============================================
* REGIAO 99 - INTERNACIONAL/DIPLOMATICO
* ============================================
IF #COD-REG = 99
  MOVE TRUE TO #ELEGIVEL
  MOVE 0 TO #PC-COD-RETORNO
  MOVE 'ELEGIVEL - REGIAO ESPECIAL' TO #PC-MSG
  ESCAPE ROUTINE
END-IF
*
* ============================================
* VERIF STATUS BENEFICIARIO
* ============================================
IF #STATUS-BENEF NE 'A'
  IF #STATUS-BENEF = 'S'
    ADD 1 TO #QTD-MOT
    MOVE 'BENEFICIARIO SUSPENSO' TO #MOTIVO(#QTD-MOT)
    MOVE FALSE TO #ELEGIVEL
  ELSE
    IF #STATUS-BENEF = 'C' OR #STATUS-BENEF = 'D'
      ADD 1 TO #QTD-MOT
      MOVE 'BENEFICIARIO CANCELADO/DESLIGADO' TO #MOTIVO(#QTD-MOT)
      MOVE FALSE TO #ELEGIVEL
    ELSE
      IF #STATUS-BENEF = 'I'
        ADD 1 TO #QTD-MOT
        MOVE 'BENEFICIARIO INATIVO' TO #MOTIVO(#QTD-MOT)
        MOVE FALSE TO #ELEGIVEL
      END-IF
    END-IF
  END-IF
END-IF
*
* ============================================
* VERIF FAIXA ETARIA
* ============================================
IF #IDADE-MIN > 0
  IF #IDADE < #IDADE-MIN
    ADD 1 TO #QTD-MOT
    MOVE 'IDADE INFERIOR AO MINIMO DO PROGRAMA' TO #MOTIVO(#QTD-MOT)
    MOVE FALSE TO #ELEGIVEL
  END-IF
END-IF
IF #IDADE-MAX > 0
  IF #IDADE > #IDADE-MAX
    ADD 1 TO #QTD-MOT
    MOVE 'IDADE SUPERIOR AO MAXIMO DO PROGRAMA' TO #MOTIVO(#QTD-MOT)
    MOVE FALSE TO #ELEGIVEL
  END-IF
END-IF
*
* ============================================
* VERIF RENDA FAMILIAR
* ============================================
IF #RENDA-MAX > 0
  IF #RENDA > #RENDA-MAX
    ADD 1 TO #QTD-MOT
    MOVE 'RENDA FAMILIAR ACIMA DO TETO DO PROGRAMA' TO #MOTIVO(#QTD-MOT)
    MOVE FALSE TO #ELEGIVEL
  END-IF
END-IF
*
* ============================================
* VERIF ELEGIBILIDADE POR TIPO PROGRAMA
* ============================================
DECIDE ON FIRST VALUE OF #TIPO-PROG
  VALUE 'A'
* ASSISTENCIAL - REQUER RENDA BAIXA E DOCUMENTACAO
    IF #RENDA > 600.00
      IF #NUM-DEP < 1
        ADD 1 TO #QTD-MOT
        MOVE 'PROG ASSISTENCIAL: RENDA > 600 SEM DEPENDENTES'
          TO #MOTIVO(#QTD-MOT)
        MOVE FALSE TO #ELEGIVEL
      END-IF
    END-IF
    IF #DOCS-OK NE 'S'
      ADD 1 TO #QTD-MOT
      MOVE 'DOCUMENTACAO INCOMPLETA' TO #MOTIVO(#QTD-MOT)
      MOVE FALSE TO #ELEGIVEL
    END-IF
  VALUE 'P'
* PREVIDENCIARIO - REQUER IDADE MINIMA 60
    IF #IDADE < 60
      ADD 1 TO #QTD-MOT
      MOVE 'PROG PREVIDENCIARIO: IDADE < 60' TO #MOTIVO(#QTD-MOT)
      MOVE FALSE TO #ELEGIVEL
    END-IF
  VALUE 'T'
* TRABALHO - REQUER IDADE ENTRE 16 E 65
    IF #IDADE < 16 OR #IDADE > 65
      ADD 1 TO #QTD-MOT
      MOVE 'PROG TRABALHO: IDADE FORA DA FAIXA 16-65' TO #MOTIVO(#QTD-MOT)
      MOVE FALSE TO #ELEGIVEL
    END-IF
  NONE
    ADD 1 TO #QTD-MOT
    MOVE 'TIPO PROGRAMA DESCONHECIDO' TO #MOTIVO(#QTD-MOT)
    MOVE FALSE TO #ELEGIVEL
END-DECIDE
*
* ============================================
* VERIF COD ELEGIBILIDADE ESPECIFICA
* ============================================
IF #COD-ELEG NE ' '
  PERFORM VERIF-ELEG-ESPECIFICA
END-IF
*
* ============================================
* RESULTADO
* ============================================
IF #ELEGIVEL
  MOVE 0 TO #PC-COD-RETORNO
  RESET #PC-MSG
ELSE
  MOVE 2010        TO #PC-COD-RETORNO
  MOVE #MOTIVO(1)  TO #PC-MSG
END-IF
*
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
ON ERROR
  MOVE 9999 TO #PC-COD-RETORNO
  COMPRESS 'ERRO NATURAL' *ERROR-NR
           'LINHA' *ERROR-LINE
           'PGM' *PROGRAM INTO #PC-MSG
  ESCAPE ROUTINE
END-ERROR
*
* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
DEFINE SUBROUTINE VERIF-ELEG-ESPECIFICA
  MOVE TRUE TO #ELEG-OK
  IF SUBSTR(#COD-ELEG,1,1) = 'R'
* REQUER NIS VALIDO
    IF BENEFICIARIO-V.NUM-NIS = 0
      ADD 1 TO #QTD-MOT
      MOVE 'NIS NAO CADASTRADO' TO #MOTIVO(#QTD-MOT)
      MOVE FALSE TO #ELEGIVEL
    END-IF
  END-IF
  IF SUBSTR(#COD-ELEG,2,1) = 'D'
* REQUER DEPENDENTES
    IF #NUM-DEP = 0
      ADD 1 TO #QTD-MOT
      MOVE 'PROGRAMA REQUER DEPENDENTES' TO #MOTIVO(#QTD-MOT)
      MOVE FALSE TO #ELEGIVEL
    END-IF
  END-IF
END-SUBROUTINE
*
END
